{"title":"3 Interesting Facts About the Omelet","slug":"3-interesting-facts-about-the-omelet","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/06/omelet-933514_960_720.jpg","image":{"src":"/images/omelet-933514_960_720.jpg","alt":""},"date":"2016-06-22T10:33:51","author":"Chino Valley Ranchers","content":"<p>For many people, omelets have become a staple in their morning breakfast. They are not only filled with delicious ingredients like eggs, cheeses and vegetables, but they are also very nutritious and make for the perfect energy starter.<!--more--></p>\n<p>But have you ever wondered where the omelet originates from and why they are such a popular dish? At Chino Valley Ranchers, we know everything there is to know about eggs, which is why we are excited to share these interesting facts about omelets with you. Take a look and enjoy!</p>\n<p><strong>1. Its origin is unknown. </strong></p>\n<p>While many associate the dish with the French, others believe that the Romans were actually the first to create the omelet. This is because ancient Romans paired an egg with sweetened honey and called it “ovemele,” which is rather close to the modern term, omelet. Others believe that this is just a coincidence and that the French were the originators of the omelet, deriving the term from “amelette,” which means “blade” in French. Because an omelet has the same shape of a blade, many believe that the French were the ones to invent the dish.</p>\n<p><strong>2. An omelet can be made with a variety of ingredients.</strong></p>\n<p>Part of the reason why so many people love omelets is because omelets can be made with pretty much any topping you like. Whether it is cheese, vegetables or your favorite meat, an omelet tastes good with lots of different ingredients.</p>\n<p><strong>3. Even Napoleon Bonaparte was a fan of omelets.</strong></p>\n<p>While he and his army were traveling through a small village, rumor has it that a local innkeeper served Napoleon Bonaparte his first omelet. He loved it so much that he had all of the eggs in the town gathered in order to serve omelets to his entire army the next day.</p>\n<p>With its long and interesting history, it is pretty clear that omelets are here to stay. Interested in making your own omelet? Be sure to purchase your eggs from Chino Valley Ranchers. Our quality and fresh eggs will make your next omelet taste delicious.</p>\n"}