{"title":"Farm Fresh: How to Find the Freshest Organic Eggs","slug":"farm-fresh-how-to-find-the-freshest-organic-eggs","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_dollarphotoclub_80475349.jpg","image":{"src":"/images/rsz_dollarphotoclub_80475349.jpg","alt":""},"date":"2015-04-20T14:39:24","author":"Chino Valley Ranchers","content":"<p>Though buying a new carton of eggs can be egg-citing, they can be dangerous if they are not fresh. Eggs, like most other foods, are perishable and if not properly maintained, can grow dangerous bacteria that can lead to food poisoning or salmonella. Fortunately, there are a few things you can do to make sure that the eggs you buy are stored safely and good to eat.<!--more--></p>\n<p><strong>1. Check the expiration date.</strong> It seems obvious, but the later the “Best By” date, the fresher the eggs will be. In addition to the expiration date, be sure to check all the eggs before you even leave the grocery store to make sure there are no cracks or holes in the shells.</p>\n<p><strong>2. Go straight home.</strong> Do not pass “GO,” do not collect $200. The longer the eggs sit in the carton without refrigeration, the higher the risk of bacteria growing. When storing the eggs, put them in the coldest part of the fridge—not the door—and make sure they are kept at or slightly below 40 degrees Fahrenheit.</p>\n<p><strong>3. Store cracked eggs.</strong> Did any eggs crack on the way home from the store? It happens. If so, not all hope is lost! Break the eggs into a small, clean container, seal them up, and use them within two days.</p>\n<p><strong>4. Consume within the month.</strong> Specifically, any eggs left in the shell can be good for anywhere from three to five weeks. Unsure how to tell if the egg has gone bad? Here is a quick tip: without breaking the shell, gently place the egg in a cup of water. If it sinks straight to the bottom, it is still good to eat. If it tips a little and stands on end, it is still safe to eat but is on its way out. If the egg floats, throw it out immediately.</p>\n<p>Have any questions about how we store our eggs at Chino Valley Ranchers? Contact us today for more information on how we ensure the highest possible safety with our eggs.</p>\n"}