{"title":"How to Make an Egg-celent Brunch Board","slug":"how-to-make-an-egg-celent-brunch-board","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2021/04/AdobeStock_315217700.jpeg","image":{"src":"/images/AdobeStock_315217700.jpeg","alt":""},"date":"2021-04-20T13:30:25","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">With Mother’s Day around the corner, it’s time to start making breakfast (or brunch) plans. One modern and beautiful way to do brunch is with a brunch board. They’re fun and easy to make, perfect for the creative types, and delightful to look at (not to mention delicious!). Here are a few simple steps to creating your own egg-celent brunch board.</span><!--more--></p>\n<p><b>Choose the right board.</b></p>\n<p><span style=\"font-weight: 400;\">The board is the canvas for your masterpiece and should be sturdy enough to hold a variety of food items. If you’re feeling extra creative, use multiple smaller boards.</span></p>\n<p><span style=\"font-weight: 400;\">Common options for brunch boards are wood serving boards, ceramic platters, large plates, and even cutting boards. You’ll also need to prepare different-sized bowls for things like spreads, dips, nut butters, and honey.</span></p>\n<p><b>Consider sweet and savory options. </b></p>\n<p><span style=\"font-weight: 400;\">A brunch board should have a balance between sweet and savory items. A few sweet options include pancakes, waffles, bagels, fruit, jams, crepes, toast, Nutella, donut holes, and pancake syrups. A few savory options to consider include bacon, sausage, salami, cheese, avocado, eggs, and mustard. Also, don’t forget garnishes and condiments, such as mustard, whipped cream, yogurt, honey, peanut butter, and jelly. </span></p>\n<p><span style=\"font-weight: 400;\">Pro Tip: Chino Valley Ranchers pasture raised eggs have a bold orange-yellow color that will really help your brunch board pop!</span></p>\n<p><b>Vary textures.</b></p>\n<p><span style=\"font-weight: 400;\">Place the larger items, like waffles and bagels, a good distance apart to avoid making the board seem too heavy on one side. Then add items that come in bowls and dishes. Don’t fill up the board just yet — you want to leave room for smaller items and some decoration.</span></p>\n<p><b>Be bold with color.</b></p>\n<p><span style=\"font-weight: 400;\">If you need help with ideas, simply open up your fridge and look for items that catch your eye. A few bright options to consider include raspberries, blackberries, avocado, strawberries, blueberries, green grapes, oranges, pineapple, kiwi, and vine tomatoes.</span></p>\n<p><span style=\"font-weight: 400;\">For decorations, you could add flowers, a candle or two, a jar filled with candy, marbles, and anything else you think will fit the mood. And don’t forget the Mother’s Day card!</span></p>\n"}