{"title":"How to Make Egg Drop Soup","slug":"how-to-make-egg-drop-soup","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/12/and-bean-curd-soup-1199735_960_720.jpg","image":{"src":"/images/and-bean-curd-soup-1199735_960_720.jpg","alt":""},"date":"2016-12-21T15:57:50","author":"Chino Valley Ranchers","content":"<p>Sometimes there’s nothing better than bundling up on the couch, watching your favorite shows and eating some warm, delicious soup. And with winter upon us, now is the perfect time to do it! That’s why we at Chino Valley Ranchers are happy to share a delicious egg drop soup recipe that you can enjoy during the colder months of the year. To learn how to make this soup for yourself, continue reading!<!--more--></p>\n<p><u>What You’ll Need</u>:</p>\n<ul>\n<li>Chino Valley Ranchers’ Eggs</li>\n<li>Broth (chicken or vegetable stock)</li>\n<li>Cornstarch</li>\n<li>Salt and/or soy sauce</li>\n</ul>\n<p><u>Optional Ingredients:</u></p>\n<ul>\n<li>Lemongrass</li>\n<li>Mushrooms</li>\n<li>Onions</li>\n<li>Ginger</li>\n</ul>\n<p><strong>1. Heat your broth. </strong></p>\n<p>Take a medium-sized pan, pour the broth into the pan and place it on top of the stove on high heat. Then, add any of the optional ingredients that are listed above to the broth. These ingredients can help add flavor to the final dish. Once that is done, turn down the heat and let the ingredients cook on a simmer for about 12-15 minutes.</p>\n<p><strong>2. Time to whisk. </strong></p>\n<p>First, take a little bit of the heated broth out of the pan and place it into a small bowl. Then, add cornstarch and whisk the two ingredients together. Once that is done, pour the mixture back into the pan and whisk the entire pan for a few minutes.</p>\n<p>It is then time to whisk the Chino Valley Ranchers eggs. Take a little bit of fresh cornstarch, crack your eggs and whisk the two ingredients together in a small bowl.</p>\n<p><strong>3. Add the eggs to the broth.</strong></p>\n<p>Place a fork over the bowl containing the egg and cornstarch mixture and slowly pour it into the pan. As you pour, softly whisk the broth. Then, remove the pan from the heat all together once the eggs are fully cooked.</p>\n<p>And just like that, your soup is ready to be served! To make this recipe really stand out, it is important to use the best ingredients out there, especially when it comes to the eggs. For high quality eggs, be sure to use Chino Valley Ranchers’ eggs. We produce tasty and nutritious egg products that we know you’ll love. For more information on our eggs, contact us today!</p>\n"}