{"title":"The History of the Egg","slug":"the-history-of-the-egg","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_eggs.jpg","image":{"src":"/images/rsz_eggs.jpg","alt":""},"date":"2016-06-01T16:46:23","author":"Chino Valley Ranchers","content":"<p>Eggs: they have become such a staple in our diet that it is hard to believe that there was a time without them. Have you ever wondered where eating eggs originated? Or how the egg industry put in place today initially formed? To help feed your curiosity, Chino Valley Ranchers has compiled a brief timeline of the history of eggs. Enjoy!<!--more--></p>\n<p><strong>The Origin of Edible Eggs</strong></p>\n<p>According to Indian history books, chickens have been domesticated in East India as far back as 3200 B.C. In North America, there is evidence to show that native chickens were domesticated prior to the arrival of Columbus. However, it is known that on his second trip to America, Columbus carried the first chickens that are now known for producing eggs.</p>\n<p><strong>The Start of the 1900s</strong></p>\n<p>At the turn of the century, many egg farmers did not sell through a local super market. Instead, they would sell directly to other families. When these farmers started to gain profit, they began increasing their flock counts to about 400 and started selling to markets. But time went by, having the hens live outside started to become a problem, as weather, diseases and other animals became a threat.</p>\n<p><strong>The 1930s</strong></p>\n<p>This was the time period when egg farmers moved to indoor housing for their birds. Not only did this prevent exposure to predators and other outside dangers, but it also resulted in healthier birds &#8211; and consequently &#8211; healthier eggs.</p>\n<p><strong>The 1940s – 1960s</strong></p>\n<p>During this time there was a lot of technological improvements underway for the egg industry. The system of caging was introduced and ultimately led to a mechanical and commercial operation of the egg production industry.</p>\n<p><strong>Today</strong></p>\n<p>In modern day society, eggs are everywhere and the options for consumers are limitless. Whether you prefer organic, soy-free or any other type of egg, consumers have the ability to buy whatever type of egg they like. The production of eggs has also increased quite a bit since the start of 1900s. In fact, there are about 300 million chickens laying about 250 eggs per year in the United States. That’s quite an increase!</p>\n<p>We hope that taking a look back at the history of eggs helps you see how much has changed in the egg producing business! For more information on anything egg-related, contact Chino Valley Ranchers today!</p>\n"}