{"title":"Why Soy Free Eggs?","slug":"why-soy-free-eggs-2","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_dollarphotoclub_80475349.jpg","image":{"src":"/images/rsz_dollarphotoclub_80475349.jpg","alt":""},"date":"2015-10-16T11:55:17","author":"Chino Valley Ranchers","content":"<p>Because it is readily available and a relatively cheap crop to grow, soy has become a staple of the American diet over the last 50 years. From cookies to cheese to candy, soy can be found in many of the foods we consume. This is fine if you don’t have any special dietary needs or food allergies. However, if you do, all of the soy in our food sources creates a problem for you. After receiving many requests from consumers for soy free eggs, we began researching if this was possible and how we could manage it without sacrificing the health of our hens.<!--more--></p>\n<p>In terms of nutritional content for our laying hens, the challenge for us was that there are not many certified organic products that could replace the soy. We stand firm on our standards when it comes to what we feed our chickens, and we could not waver in this commitment. Working closely with our nutritionist, we began testing new seeds and grains that were certified organic. One of the caveats was that the hens had to enjoy it! We finally found a blend that includes sunflower seeds—and it’s chicken approved!</p>\n<p>Once the feed was well into the chickens’ systems, we sent the eggs to a third party laboratory for a test to determine if in fact they were soy free eggs. We were relieved that the tests came back negative for any soy protein! In addition to the absence of soy, our soy free eggs are high in Omega-3 fatty acids and Vitamin E.</p>\n<p>When you buy <a href=\"http://chinovalleyranchers.com/our_eggs_soy_free_organic.php\">soy free eggs from Chino Valley Ranchers</a>, you can rest assured that you are buying a superior product. These eggs boast the same rich yellow yolk and excellent taste as our other organic eggs—the only thing missing is the soy!</p>\n<p>For information about our soy free eggs or any of our other organic egg products, <a href=\"http://chinovalleyranchers.com/contact_us.php\">contact us</a> today!</p>\n"}