{"title":"3 Benefits of Cage Free Eggs","slug":"3-benefits-of-cage-free-eggs","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/06/rsz_dollarphotoclub_80289409.jpg","image":{"src":"/images/rsz_dollarphotoclub_80289409.jpg","alt":""},"date":"2015-12-29T11:24:12","author":"Chino Valley Ranchers","content":"<p>There’s been a lot of press about cage free eggs lately. Maybe you heard that <a href=\"http://chinovalleyranchers.com/blog/large-corporations-make-cage-free-egg-promises/\">McDonald’s and Starbucks</a> have pledged to phase out battery raised eggs within the next 5 or so years, or maybe it was that Costco made the same promise. <!--more-->Maybe the recent <a href=\"http://chinovalleyranchers.com/blog/report-bird-flu-leads-to-death-of-millions-of-hens/\">bird flu epidemic</a> has you thinking about how your eggs are raised. Or maybe, just maybe, when you go grocery shopping, it takes you 10 minutes to decide which eggs to buy. Cage free, vegetarian fed, all natural, humane harvest? Which ones to buy? It can be very confusing for a conscientious consumer! Here are 3 reasons why you should buy cage free eggs.</p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/5-fun-facts-about-adding-cage-free-eggs-to-your-diet/\">5 Fun Facts About Adding Cage-Free Eggs to Your Diet</a></p>\n<ol>\n<li>It’s good for the hens. Chickens that live on factory farms live their lives stuffed into a cage with several other chickens, each with a space the size of a sheet of notebook paper. This gives them little room to stretch their wings or turn around. They suffer from excessive feather loss, bruises and other abrasions, all caused from rubbing against the wire bars and other hens in their cage. Even worse, the lack of exercise makes their bones brittle, which leaves them susceptible to injury and disease. Oftentimes they are too unhealthy to even stand up. Being stuffed into tiny cages causes much emotional distress for hens, as they cannot lay their eggs in a nest, perch, forage or take a dust bath. Of particular importance to hens is nesting, and they experience high levels of stress when they cannot lay their eggs in a nest.</li>\n<li>It’s safe. Studies have found that battery hens have a 25-times higher chance of contacting Salmonella than their cage-free counterparts. Additionally, as mentioned above, they are more susceptible to disease, which spreads rapidly in large, dense flocks.</li>\n<li>It’s better for everyone. Whenever you buy eggs, you make a choice about the type of food you want served at your table. At CVR, we believe that us humans have a responsibility to treat the animals that produce our food in a humane, kind, and responsible way. Change is possible, and your dollars speak. That’s why we encourage you to choose humanely raised, cage free eggs.</li>\n</ol>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/are-cage-free-eggs-safer-than-others/\">Are Cage Free Eggs Safer than Others?</a></p>\n<p>If you have any questions about cage free eggs, contact us today! We are happy to answer any questions you might have!</p>\n"}