{"title":"7 Steps to the Perfect Hard-Boiled Egg","slug":"7-steps-to-the-perfect-hard-boiled-egg","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/02/rsz_dollarphotoclub_71714215-624x416.jpg","image":{"src":"/images/rsz_dollarphotoclub_71714215-624x416.jpg","alt":""},"date":"2015-02-23T15:22:21","author":"Chino Valley Ranchers","content":"<p>Tired of a boring breakfast of cereal and milk? Make your breakfast more eggs-iting with some hard boiled eggs! They are nutritious and can be easily made in bulk, so they are an easy addition to your weekly meal prep. But making the perfect hard-boiled egg can be difficult. Shelling the egg can be time consuming and messy if you aren’t careful.<!--more--></p>\n<p>Before you start, make sure to only make as many eggs as you can consume in one week. Hard-boiled eggs are not meant to have a long shelf life, so to prevent any foodborne illness, limit the number you’re preparing.</p>\n<p>Here’s a quick tutorial on how to perfect your hard-boiled egg.</p>\n<p><strong>1. Place in saucepan: </strong>Place as many eggs as you want into the saucepan, as long as it doesn’t exceed one layer on the bottom. Large eggs are preferable.</p>\n<p><strong>2. Cover with water:</strong> At least one inch of tap water, or until the tops of the eggs are completely covered.</p>\n<p><strong>3. Cover the pan and bring to a boil:</strong> Cover the pan with a lid and turn on your stove to medium-high. The water should come to a boil fairly quickly.</p>\n<p><strong>4. Turn off the heat and let eggs sit:</strong> Once the water is boiling, turn the stove off and remove the saucepan from the heat. Keep the eggs covered and let them sit in the hot water for 15 minutes (12 for medium-sized eggs, 18 for extra large eggs).</p>\n<p><strong>5. Cold water:</strong> Cover the eggs in cold or ice water until the eggs are completely cooled.</p>\n<p><strong>6. Store:</strong> Dry and store the eggs in a Ziploc in the refrigerator. Remember, they will only last about a week.</p>\n<p><strong>7. Shelling:</strong> When you are ready to eat the egg, gently tap the shell on a hard surface. Rolling the egg between your hands can loosen it as well. Run the egg under cold water as you work to peel the shell.</p>\n<p>If you want more organic egg recipes, contact Chino Valley Ranchers today! We want to make sure you enjoy our organic eggs in whatever way you prefer.</p>\n"}