{"title":"An Egg A Day Keeps The Extra Pounds Away","slug":"an-egg-a-day-keeps-the-extra-pounds-away","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/02/Baked-Eggs-in-Portobello-Mushrooms-Blog-785x520.jpg","image":{"src":"/images/Baked-Eggs-in-Portobello-Mushrooms-Blog-785x520.jpg","alt":""},"date":"2020-12-11T00:36:38","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">They say an apple a day keeps the doctor away, but the same can be said for eggs. The nutritional content of eggs — especially organic ones — offers invaluable health benefits.</span></p>\n<p><!--more--></p>\n<p><b>What’s In An Egg?</b></p>\n<p><span style=\"font-weight: 400;\">Before we dive into the health benefits of eggs, let’s take a look at the nutritional content of eggs.</span></p>\n<p><span style=\"font-weight: 400;\">One large egg contains six grams of lean protein, five grams of fat, 1.5 grams of saturated fat, 185 milligrams of cholesterol, 125 milligrams of choline and less than one gram of carbohydrates. Egg whites contain about 80 percent of the egg’s protein content, while the egg yolk contains about 20 percent of the egg’s protein and the majority of the egg’s fat and cholesterol. The egg yolk also contains phytonutrients lutein and zeaxanthin, which support eye health and function. </span></p>\n<p><span style=\"font-weight: 400;\">The choline contained in an egg supports brain health and cognitive function. Eggs also contain folate, riboflavin, thiamin, calcium, iron, phosphorus, potassium, zinc and vitamins A, D, E, B-12 and B-6.</span></p>\n<p><b>Three Reasons to Eat Eggs Every Day</b></p>\n<p><span style=\"font-weight: 400;\">Here are a few reasons why eggs are an excellent food choice for breakfast.&#8217;</span></p>\n<p><b>1.Safeguard against eye disease</b></p>\n<p><span style=\"font-weight: 400;\">The pigments in the macula of the eye contain three carotenoids: lutein, zeaxanthin and meso-zeaxanthin. These pigments help protect the eye from the onset of macular degeneration by acting as both filters and antioxidants. Research suggests that high levels of macular pigment are associated with a decreased risk of age-related macular degeneration.</span></p>\n<p><span style=\"font-weight: 400;\">One study found that eating one egg per day increased participants’ blood levels of antioxidants lutein and zeaxanthin by 26% to 38%. </span></p>\n<p><span style=\"font-weight: 400;\">Omega-3 eggs can also help decrease the risk of macular degeneration. Studies have shown that increased consumption of omega-3 fatty acids was associated with a 38% reduced risk of advanced macular degeneration.</span></p>\n<p><b>2. Rich in antioxidants</b></p>\n<p><span style=\"font-weight: 400;\">A study by the University of Alberta analyzed the egg yolks laid by hens fed a diet high in wheat and corn to see how much of the antioxidative phenolic compounds in those grains was present in the eggs. Results showed that two raw egg yolks had almost twice as many antioxidants as an apple. Cooking the egg, however, reduced antioxidant levels in half. </span></p>\n<p><b>3. Supports weight loss efforts</b></p>\n<p><span style=\"font-weight: 400;\">One study showed that eating eggs for breakfast could aid in weight loss. Participants who ate two eggs a day for at least five days of the week showed a 61% greater decrease in body mass index, a 65% greater weight loss and a 34% greater decrease in waist circumference, compared to those who ate a comparable amount of  bagels for breakfast.</span></p>\n"}