{"title":"Chino Valley Ranchers Video Offers Glimpse of Pasture Raised Farm","slug":"chino-valley-ranchers-video-offers-glimpse-of-pasture-raised-farm","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2019/09/cvr-generations-of-quality.png","image":{"src":"/images/cvr-generations-of-quality.png","alt":""},"date":"2019-09-11T23:38:21","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">Chino Valley Ranchers has released a stunningly beautiful new video to promote its pasture raised egg line of products. In the video narrated by Chino Valley Ranchers’ very own Chris Nichols, pasture raised hens are shown enjoying the sunlight, dust-bathing and foraging for grass, seeds, worms and bugs.  </span><!--more--></p>\n<p><span style=\"font-weight: 400;\">In the video, Nichols says, “Because the hens naturally fertilize the pastures, we never have to use any harmful pesticides or chemical fertilizers. They get to enjoy all the benefits the pasture brings along with all the rest of the comforts we provide.” Pastures are rotated on a regular basis to ensure quality vegetative coverage. Rain naturally provides the pastures with water, eliminating the need for a complex irrigation system. </span></p>\n<p><span style=\"font-weight: 400;\">Chino Valley Ranchers pasture raised eggs have been certified by American Humane and carry the American Humane Certified seal for pasture raised eggs. To receive the seal, pasture-raised farms must offer 108 square feet per bird or one acre for every 400 hens. In contrast, free-range farms are required to offer one acre for every 2,000 hens. </span></p>\n<p><span style=\"font-weight: 400;\">Chino Valley Ranchers pasture raised farms adhere to American Humane requirements for pasture raised hens, which include providing hens with a minimum of eight hours of daylight per day, for at least 275 days of the year, weather permitting. Company employees and all personnel follow strict requirements for documentation, emergency management, inspections, equipment maintenance, molting, beak trimming and access to feed and water.</span></p>\n<p><span style=\"font-weight: 400;\">Speaking to the company’s commitment to producing pasture raised eggs, Nichols says, “We believe hens should enjoy sunlight and outdoor space not only for their benefit, but also for the benefit of our customers’ health. In support of customers’ good health, we hope to continue producing nutritious pasture raised eggs for generations to come.”</span></p>\n<p><span style=\"font-weight: 400;\">To view the Chino Valley Ranchers video on pasture-raised farms, visit </span><a href=\"https://www.chinovalleyranchers.com/pasture-raised-chickens/\"><span style=\"font-weight: 400;\">https://www.chinovalleyranchers.com/pasture-raised-chickens/</span></a><span style=\"font-weight: 400;\">. </span></p>\n<p>&nbsp;</p>\n"}