{"title":"Chopped Tomato and Avocado Egg Salad: A Perfect Lunch Option","slug":"chopped-tomato-and-avocado-egg-salad-a-perfect-lunch-option","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/04/Untitled-design.jpg","image":{"src":"/images/Untitled-design.jpg","alt":""},"date":"2018-04-05T21:29:17","author":"Chino Valley Ranchers","content":"<p>Do you love egg salad but wish there was a healthier version? This week, Chino Valley Ranchers brings you just that! Our chopped tomato and avocado egg salad is packed with protein and is a great way to add the green, leafy vegetables your doctor always stresses for you to eat. Plus, the vinaigrette dressing is simple, homemade, zesty and heart-healthy.<!--more--></p>\n<p>Ready to get choppin’? Keep reading for this yummy chopped egg salad recipe.</p>\n<p><u>What You’ll Need</u></p>\n<p>Ingredients for the Salad:</p>\n<ul>\n<li>Chino Valley Ranchers eggs</li>\n<li>Avocados, chopped</li>\n<li>Tomato, chopped</li>\n<li>Red onion, chopped</li>\n<li>Cilantro, chopped</li>\n<li>Spinach leaves</li>\n</ul>\n<p>Ingredients for the Dressing:</p>\n<ul>\n<li>Olive oil</li>\n<li>Vinegar</li>\n<li>Fresh lemon juice</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<p>Begin by bringing a pot of water to a rolling boil. Once boiling, place your Chino Valley Ranchers eggs in one by one and boil for about 10-12 minutes.</p>\n<p>While your Chino Valley Ranchers eggs are boiling, mix your dressing ingredients in a bowl in a 4:1:1 ratio of olive oil, vinegar, and lemon juice, respectively. Add a pinch of salt and pepper and set your dressing aside.</p>\n<p>Once your Chino Valley Ranchers eggs have finished boiling, plunge them into a bowl of ice water in order to halt the cooking. Peel each egg, begin slicing them about a quarter inch thick and then set aside.</p>\n<p>Assemble your salad by combining copped avocados, tomatoes, onion and cilantro into a large bowl. Add your peeled eggs and homemade dressing and gently toss to mix. To really get the flavors to pop, refrigerate your salad for at least one hour. Once it’s ready to serve, scoop your salad mix onto a bed of fresh spinach leaves. Enjoy!</p>\n<p>There you have it &#8211; A Chino Valley Ranchers lunch favorite! If you enjoyed this recipe, be sure to check out our other recipes on our website. For more information on our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us today</a>!­</p>\n"}