{"title":"Diablo Eggs: A Cinco de Mayo Special","slug":"diablo-eggs-a-cinco-de-mayo-special","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/01/delicious-deviled-eggs.jpg","image":{"src":"/images/delicious-deviled-eggs.jpg","alt":""},"date":"2018-05-03T16:42:17","author":"Chino Valley Ranchers","content":"<p>Every year on the 5<sup>th</sup> of May, people all over the United States gather to celebrate Cinco de Mayo with potlucks, picnics, and fiestas of all types. The holiday has a few different origins, however, it’s mostly a celebration of pride for Mexican heritage.<!--more--></p>\n<p>Whatever your reason for celebrating, Chino Valley Ranchers is helping you kick off Cinco de Mayo with our Diablo Eggs recipe. It’s a great twist on a classic potluck favorite and it’s sure to add some spice to your fiesta!</p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers eggs</li>\n<li>Brown mustard</li>\n<li>Mayonnaise</li>\n<li>Lime juice</li>\n<li>Chili powder</li>\n<li>Cumin</li>\n<li>Black pepper, ground</li>\n<li>Salt</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Cilantro, dried or fresh</li>\n<li>Pickled jalapeños</li>\n</ul>\n<p><strong>Hard-boil the eggs.</strong><br />\nPlace your Chino Valley Ranchers eggs into a large saucepan, cover them with cold water and bring the water to a boil. Allow the eggs to boil for three minutes. Then, turn off the heat, cover the pot and allow the eggs to continue to cook in hot water for at least twenty minutes. Once that is done, drain the eggs and cover them in cold water. When they are completely cooled, peel the eggs.</p>\n<p><strong>Prepare the yolks.</strong><br />\nCut the hard-boiled eggs in half, length-wise. Remove the yolks and place them in a bowl. Using a fork, add in equal parts of brown mustard, mayonnaise, and lime juice and mix together until the consistency is creamy and smooth. Stir in some chili powder, cumin, pepper, and salt. Be sure to taste the mixture and add more of any ingredients you think it needs. Just keep in mind that the seasoning flavors strengthen as the mixture sets.</p>\n<p><strong>Diablo the eggs.</strong><br />\nUsing a pastry bag or a spoon, fill the egg yolk mixture into the egg white halves. Lightly sprinkle with more chili powder and some cilantro over the top of each egg for an extra kick. Cover and chill them for at least half an hour before serving and enjoying them.<br />\nAs you celebrate Cinco de Mayo this year, we hope you enjoy this treat from south of the border! To make this dish really stand out, be sure to use Chino Valley Ranchers’ eggs! For more information on our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today.</p>\n"}