{"title":"Egg News: The Importance of Choline in Pregnancy","slug":"egg-news-the-importance-of-choline-in-pregnancy","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/10/Screen-Shot-2017-10-12-at-3.52.10-PM.png","image":{"src":"/images/Screen-Shot-2017-10-12-at-3.52.10-PM.png","alt":""},"date":"2017-10-12T22:49:21","author":"Chino Valley Ranchers","content":"<p>At Chino Valley Ranchers, we love talking about the nutritional benefits associated with eggs. We even created <a href=\"http://www.chinovalleyranchers.com/egg-facts/\">an outline</a> of the jam-packed nutrients you can expect in each Chino Valley Ranchers egg. One of these nutrients is choline, which is a key nutrient for the proper development of a baby’s brain and spinal cord.<!--more--></p>\n<p><strong>A Push for Prenatal Choline </strong></p>\n<p>In the late 90’s, the National Academy of Medicine first recognized choline as an essential nutrient, but there was little funding available for research. Now, scientists are beginning to crack the shell around the role of choline, especially with its role in pregnancy.</p>\n<p>A <a href=\"https://www.clinmedjournals.org/articles/jfmdp/journal-of-family-medicine-and-disease-prevention-jfmdp-2-048.php?jid=jfmdp\">recent study</a> prompted the American Medical Association (AMA) to begin recommending choline-supplemented prenatal vitamins. The study suggests that moms-to-be are not getting nearly as much as the daily recommended 450 mg amount. In addition, prenatal vitamins only contain 0-55 mg of choline, leaving the majority of women with “insufficient intakes”. In mid-June, the AMA House of Delegates voted unanimously to support the study’s recommended amount of choline in all prenatal vitamins.<strong> </strong></p>\n<p><strong>A Choline-Rich Diet</strong></p>\n<p>Though the AMA suggests that choline is essential for pregnancy, it’s also crucial for the average person! According to a <a href=\"http://www.fasebj.org/cgi/content/meeting_abstract/21/6/LB46-c\">NHANES survey</a>, the average American is receiving far below the recommended intake. Choline helps support nerve function, muscle movement, and a healthy metabolism. What’s better? An average egg contains 250 mg of choline, which is <a href=\"http://lpi.oregonstate.edu/mic/other-nutrients/choline\">more than half</a> the recommended daily intake. So the next time you’re having a meal put a Chino Valley Ranchers egg on it!</p>\n<p>Providing our customers with nutrient-dense egg products is important to us. It’s one of the reasons why we only use organic, quality grains to feed our hens. To learn more about Chino Valley Ranchers’ eggs and where to find them, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today!</p>\n"}