{"title":"Eggs Five Ways","slug":"eggs-five-ways","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2019/01/CVR_Blog_Thumbnail.png","image":{"src":"/images/CVR_Blog_Thumbnail.png","alt":""},"date":"2019-01-04T21:13:32","author":"Chino Valley Ranchers","content":"<p>Eggs are are one of the most versatile foods ever! Depending on how you cook them, they can take on many different textures and flavors. Today I’m sharing my favorite ways to prepare eggs using Chino Valley Ranchers Organic Free Range Eggs and Egg Whites.<!--more--></p>\n<h3>SOFT BOILED</h3>\n<ol data-rte-list=\"default\">\n<li>Add a half inch of water to a medium pot (about enough to cover your finger nail)</li>\n<li>Bring water to a boil</li>\n<li>Lightly place the eggs into the pot (you’ll want to be extra careful with this step because the eggs can easily crack)</li>\n<li>Cover and reduce heat to maintain a low, slow boil.</li>\n<li>Boil for 7 minutes for a more runny yolk or 8 minutes for a jammy yolk</li>\n<li>Immediately remove from heat and run eggs under cold water.</li>\n<li>Add a few ice cubes to the pot. Swirl the eggs around in the ice bath. This step will stop the eggs from cooking.</li>\n<li>One by one, take eggs out of the pot and crack open the bottoms. Place back into the water and let cool for another few minutes while stirring occasionally. This will allow water to seep under the shell and membrane which will make peeling easier.</li>\n<li>Peel egg shells and enjoy with salt, pepper and chili flakes</li>\n</ol>\n<h3>SOFT SCRAMBLED</h3>\n<ol data-rte-list=\"default\">\n<li>Crack two eggs into a small bowl</li>\n<li>Add a pinch of salt and pepper to the bowl and whisk until eggs are light and foamy</li>\n<li>In a small skillet add 1 tbsp ghee or avocado oil and heat on low/medium</li>\n<li>Pour egg mixture into the skillet and let it sit for about 10 seconds or until the outer edges are cooked</li>\n<li>Using a spatula, drag the cooked outer edges to the center, allowing the un-cooked liquid to spill to the outside.</li>\n<li>Repeat step 5 until the eggs are fully cooked</li>\n<li>Using a large spatula, transfer scramble onto a plate</li>\n</ol>\n<p>Sprinkle a pinch of flaky sea salt and chives over the top and enjoy</p>\n<h3>POACHED</h3>\n<ol data-rte-list=\"default\">\n<li>Fill a medium sized pot with water and bring to a rolling boil</li>\n<li>Add 1 tbsp of apple cider vinegar to the pot</li>\n<li>Using a large wooden spoon, stir the water in a consistent motion until a little vortex forms in the center</li>\n<li>Crack an egg into a 3/4 measuring cup</li>\n<li>Drop the egg into the vortex</li>\n<li>Cook for about 2 minutes</li>\n<li>Use a slotted spoon to remove egg from water</li>\n</ol>\n<p><img class=\"aligncenter wp-image-2648 size-large\" src=\"https://www.chinovalleyranchers.com/wp-content/uploads/2019/01/68EEC738-B14C-459A-9B95-2CB03D3D56B4_2000px-1024x1024.jpg\" alt=\"\" width=\"1024\" height=\"1024\" srcset=\"https://www.chinovalleyranchers.com/wp-content/uploads/2019/01/68EEC738-B14C-459A-9B95-2CB03D3D56B4_2000px-1024x1024.jpg 1024w, https://www.chinovalleyranchers.com/wp-content/uploads/2019/01/68EEC738-B14C-459A-9B95-2CB03D3D56B4_2000px-150x150.jpg 150w, https://www.chinovalleyranchers.com/wp-content/uploads/2019/01/68EEC738-B14C-459A-9B95-2CB03D3D56B4_2000px-300x300.jpg 300w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></p>\n<h3>FRIED</h3>\n<ol data-rte-list=\"default\">\n<li>In a medium skillet, heat ghee or avocado oil on medium/high heat until oil starts to sizzle (you want it pretty hot)</li>\n<li>Crack an egg into the skillet and let it sit until the whites are mostly cooked. The whites should start to bubble.</li>\n<li>Reduce heat and swirl the skillet so that the excess oil coats the egg white</li>\n<li>Once the white is fully cooked, transfer to a plate and enjoy</li>\n</ol>\n<h3>EGG WHITE OMELETTE</h3>\n<ol data-rte-list=\"default\">\n<li>In a small bowl whisk 1/2 cup Chino Valley Ranchers Cage Free Egg Whites with salt and pepper</li>\n<li>Pour egg whites into a small skillet with avocado oil or ghee</li>\n<li>Add sliced tomatoes, onions and spinach into the pan</li>\n<li>Heat low until egg whites are fully cooked (flipping half way)</li>\n<li>Transfer omelette to a plate and top with sliced avocado, flaky sea salt and green onions</li>\n</ol>\n<p>This <a href=\"https://www.wellnesswithcourtnie.com/blog/2018/12/24/eggs-4-ways\">blog</a> originally appeared on <a href=\"http://www.wellnesswithcourtnie.com/\">www.wellnesswithcourtnie.com</a>.</p>\n"}