{"title":"How to Make a Delicious Asparagus and Mushroom Frittata","slug":"how-to-make-a-delicious-asparagus-and-mushroom-frittata","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/03/ChinoValley.png","image":{"src":"/images/ChinoValley.png","alt":""},"date":"2017-03-10T18:13:41","author":"Chino Valley Ranchers","content":"<p>Frittatas are a quick and easy meal that everyone can enjoy. Delicious Chino Valley Ranchers’ eggs, veggies and cheese – what’s not to love? That’s why we’ve created a tasty asparagus and mushroom frittata recipe to try for yourself! Continue reading for the entire recipe or watch our video recipe below!<!--more--></p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Olive oil</li>\n<li>Mushrooms</li>\n<li>Asparagus</li>\n<li>Butter</li>\n<li>Grated Monterey Jack cheese</li>\n</ul>\n<p><u>Optional Ingredients:</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<p><strong>1. Sauté your vegetables.<br />\n</strong>Put a sauté pan over medium heat with a dollop of olive oil. Then, pour the mushrooms into the pan and allow them to sauté in the oil until they begin to turn a golden-brown. As the mushrooms begin to change in color, push them to the side and add sliced asparagus pieces to the other side. Allow both to finish cooking as you mix them together for a few more minutes. This helps the flavors blend together.</p>\n<p><strong>2. Scramble your eggs.<br />\n</strong>Crack your Chino Valley Ranchers’ eggs into a medium-sized bowl, using a fork to scramble the eggs, and continue to do so until the eggs have the same consistency.</p>\n<p><strong>3. Prepare to bake.<br />\n</strong>Using a small amount of butter, grease an oven-safe dish and pour the sautéed mushrooms and asparagus into it, evenly laying them out at the bottom. Then, pour the scrambled eggs over the vegetables. To ensure even coverage, tilt the dish from one side to the other. Sprinkle grated Monterey Jack cheese over the dish, making sure to cover everything.</p>\n<p><strong>4. Bake the frittata. </strong></p>\n<p>Pre-heat the oven to 350° Allow the frittata to bake until it has a clean fork. Depending on the size of your frittata, this might take up to 30 minutes.</p>\n<p>And there you have it – a delicious and healthy egg dish in four easy steps. To make the best frittata, or any meal for that matter, you need the freshest ingredients, like Chino Valley Ranchers’ eggs. Contact us today to learn more about our tasty products.</p>\n<p><iframe src=\"https://www.youtube.com/embed/8bwlPZ8FfBs\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n"}