{"title":"How a Chino Valley Ranchers Egg Can Benefit Bone Health","slug":"how-a-chino-valley-ranchers-egg-can-benefit-bone-health","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/10/hannah-tasker-333889.jpg","image":{"src":"/images/hannah-tasker-333889.jpg","alt":""},"date":"2017-10-27T19:36:57","author":"Chino Valley Ranchers","content":"<p>From a young age, we’ve all been told to drink milk so you can build healthy, strong bones. Fractures account for <a href=\"https://www.schwebel.com/userfiles/files/Fractures%281024%29.pdf\">16 percent</a> of musculoskeletal injuries in America, and calcium and vitamin D have always been the leading nutrients in the formation of our skeletal tissue. But, what role does protein play in bone health? Can one of Chino Valley Ranchers’ eggs keep the doctor away? <!--more-->These questions have prompted researchers to find out how, and if, dietary protein has a beneficial impact on bone health.<strong> </strong></p>\n<p><strong>Studies Look at High-Protein Diets on Bone Health</strong></p>\n<p><a href=\"https://www.ncbi.nlm.nih.gov/pubmed/28404575\">In a recent study</a> done by the National Osteoporosis Foundation, researchers analyzed the effects of high- versus low-protein diets on bone mineral density. After analyzing 16 randomized control trials and 20 prospective cohort studies, the researchers concluded that high protein intake seems to have a “favorable” effect on bone mineral density, especially in the lumbar spine.</p>\n<p><a href=\"http://ajcn.nutrition.org/content/75/4/773.abstract?ijkey=79a7fee89b85b92ca76e3ac249e10402b48c8e9f&amp;keytype2=tf_ipsecsha\">Another study</a>, which had a similar conclusion to the previous one mentioned, analyzed the quality of protein intake on bone health. This three-year study looked at a group of 342 men and women over the age of 65, which is the age group that accounts for <a href=\"https://www.schwebel.com/userfiles/files/Fractures%281024%29.pdf\">more than half</a> the number of bone fractures in America. Researchers found that when high-quality protein sources &#8211; such as eggs &#8211; were consumed with calcium supplements, bone density increased.</p>\n<p>While more studies concerning the effects of diet on bone health continue to take place, the same message still stands: always consume a well-balanced diet. At Chino Valley Ranchers, we understand that eggs make up many diets, which is why we provide our hens with thriving environments to ensure that you receive nutrient-dense, organic eggs that taste delicious. To learn more about Chino Valley Ranchers’ eggs and where to find them, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today!</p>\n"}