{"title":"How to Make the Perfect Summer Frittata","slug":"how-to-make-the-perfect-summer-frittata","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/07/rsz_img_6377.jpg","image":{"src":"/images/rsz_img_6377.jpg","alt":""},"date":"2016-07-11T12:33:55","author":"Chino Valley Ranchers","content":"<p>It is officially summer time, which means it is also time to relax, have some fun and enjoy quality time with the ones you love. And what better way to show your love than by cooking a delicious frittata this summer? At Chino Valley Ranchers, we believe there is nothing like it. Originally an Italian dish, this yummy fried egg meal is perfect for any egg lover. To create your own summer frittata, take a look at this delicious recipe and try it for yourself.<!--more--></p>\n<p><u>What You’ll Need</u>:</p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Onions</li>\n<li>Zucchini</li>\n<li>Red bell pepper</li>\n<li>Tomato</li>\n<li>Parsley</li>\n<li>Basil</li>\n<li>Salt</li>\n<li>Black pepper</li>\n<li>Olive oil</li>\n</ul>\n<p><strong>1. Cook your vegetables.</strong></p>\n<p>To start, take a non-stick pan, pour olive oil in it and place it on the stove on medium heat. Then add your vegetables: red bell pepper, onion and zucchini. Add salt and black pepper and then cook and stir until the vegetables are tender, which is usually around the seven- or eight-minute mark. As you finish stirring, add your tomato into the mixture.</p>\n<p><strong>2. Bring in the eggs.</strong></p>\n<p>Crack your Chino Valley Ranchers’ eggs into a bowl and whisk with some salt and black pepper. Once they are to your liking, pour the eggs into the vegetable pan and gently stir the skillet. Cook for about 15 minutes and reduce heat accordingly.</p>\n<p><strong>3. Get your broiler ready.</strong></p>\n<p>While your eggs and vegetables cook, preheat your broiler. Once they are done cooking, broil the frittata for about three or four minutes.</p>\n<p>There you have it! A delicious summer frittata ready to serve! You can place it on a serving platter and it should be enough for six to eight people to enjoy! To make your summer frittata really stand out, be sure to use Chino Valley Ranchers’ eggs. Our high quality eggs are delicious and always fresh. For more information on Chino Valley Ranchers and our eggs, contact us today!</p>\n"}