{"title":"Large Corporations Make Cage-Free Egg Promises","slug":"large-corporations-make-cage-free-egg-promises","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/07/rsz_dollarphotoclub_84273337.jpg","image":{"src":"/images/rsz_dollarphotoclub_84273337.jpg","alt":""},"date":"2015-12-15T09:17:41","author":"Chino Valley Ranchers","content":"<p>We have <em>egg-cellent</em> news on the egg front today! Several large, nation-wide restaurant chains have committed to transitioning to cage-free eggs by the year 2020. We are so <em>egg-cited</em>! The U.S. government defines cage-free, humane harvest eggs as chickens that have enough room to move around. Though they can still be confined to a cage, this is a huge improvement for laying hens.<!--more--></p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/5-fun-facts-about-adding-cage-free-eggs-to-your-diet/\">5 Fun Facts About Adding Cage-Free Eggs to Your Diet</a></p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/are-cage-free-eggs-safer-than-others/\">Are Cage Free Eggs Safer than Others?</a></p>\n<p>Companies that have made the pledge thus far include</p>\n<ul>\n<li>Starbucks: the coffee king’s goal is to be completely cage free in all of its North American stores by the year 2020. Apparently they’ve been moving towards this goal since 2008.</li>\n<li>Burger King: the burger chain has committed to be cage free by the year 2017.</li>\n<li>Panera: in November, the restaurant chain announced that it will use 100 percent cage-free eggs by the year 2020. This includes all eggshells, hardboiled eggs, liquid egg whites, and eggs used in their pastries, soufflés, and dressings. The change will affect nearly 2,000 Panera Bread and St. Louis Bread Co. stores throughout the United States.</li>\n<li>McDonald’s: Perhaps the biggest victory for the cage-free egg industry, McDonald’s announcement will no doubt push other fast-food chains to do the same. Their commitment affects only their U.S. and Canada stores, but last time we checked, <em>that’s a lot of stores</em>. Given the company’s very large scale, this will greatly impact the egg industry and how they take care of their laying hens. They purchase roughly 2 billion eggs each year, or about 5% of the total number of eggs produced in the country.</li>\n</ul>\n<p>In addition to these restaurants, large food suppliers such as Costco and General Mills have begun the process of switching to cage-free eggs. Though the change will not be immediate and will likely take 10 years or more to be fully implemented, we are very <em>egg-cited</em> about this!</p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/why-buy-soy-free-eggs/\">Why Buy Soy Free Eggs?</a></p>\n<p>If you have any questions about cage-free eggs, <a href=\"http://www.chinovalleyranchers.com/our_eggs_humane-harvest.php\">humane harvest</a> eggs, or <a href=\"http://www.chinovalleyranchers.com/our_eggs_soy_free_organic.php\">soy free</a> eggs, contact us today!</p>\n"}