{"title":"Power Up Your Morning with This Protein-Packed Egg Bowl","slug":"power-up-your-morning-with-this-protein-packed-egg-bowl","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/01/history-of-the-egg.jpg","image":{"src":"/images/history-of-the-egg.jpg","alt":""},"date":"2018-07-27T17:33:56","author":"Chino Valley Ranchers","content":"<p>Not only are eggs an amazing source of protein, they’re also loaded with satiating ingredients and healthy fats to help keep you going all day long. Enjoy the benefits of an egg’s power by trying this simple recipe from Chino Valley Ranchers! This protein-packed egg bowl will help keep you full, happy and filled with energy for hours to come.<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers eggs</li>\n<li>Vinegar</li>\n<li>Olive oil</li>\n<li>Garlic, minced</li>\n<li>Baby spinach</li>\n<li>Quinoa, cooked and drained</li>\n<li>Goat cheese, crumbled</li>\n<li>Toasted pumpkin seeds</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Lemon juice</li>\n</ul>\n<p><strong>Poach your eggs.</strong><br />\nFill a saucepan with some water and a little vinegar and bring it to a slight simmer. Adding vinegar is not mandatory, but it will help keep the egg together as it poaches. Crack your Chino Valley Ranchers eggs into a small dish, then transfer each one into a saucepan filled with water. Make sure to cook each egg separately for three to five minutes until the egg whites set. Remove each egg with a slotted spoon and let them dry on a paper towel.</p>\n<p><strong>Cook your garlic and spinach.<br />\n</strong>As you poach your eggs, coat a skillet with olive oil set at medium heat. Add the minced garlic and allow it to cook for at least one minute, then throw in the spinach. Cook the spinach until it looks as though it is about to wilt and add some salt and pepper.</p>\n<p><strong>Prepare your bowls.<br />\n</strong>In each bowl, place a cup of quinoa for the base and squeeze some lemon juice for a zesty kick. Top that off with spinach, avocado, goat cheese and pumpkin seeds. Sprinkle with some pepper and enjoy!</p>\n<p>Use Chino Valley Ranchers’ eggs in your protein-packed bowl to give you the extra strength you need to get through the day! When buying fresh, organic eggs, be sure to look for Chino Valley Ranchers. Visit our <a href=\"http://www.chinovalleyranchers.com/store-locator/\">store locator</a> to find a Chino Valley Ranchers’ distributor near you!</p>\n"}