{"title":"Try Our Bite-Sized Egg White Cups","slug":"try-our-bite-sized-egg-white-cups","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/03/Untitled-design.png","image":{"src":"/images/Untitled-design.png","alt":""},"date":"2018-03-16T17:54:43","author":"Chino Valley Ranchers","content":"<p>For those who have to get out the door early and quickly each day, breakfast is oftentimes an afterthought. And with losing an hour of sleep due to daylight-savings time, this might be even more apparent. That’s why this week, we at Chino Valley Ranchers bring you our bite-sized egg white cups to help you spring forward. Start your day with this grab-and-go meal packed with flavor and nutrients!<!--more--></p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers’ liquid egg whites</li>\n<li>Regular- or miniature-sized muffin pan</li>\n<li>Cooking spray</li>\n<li>Fresh spinach</li>\n<li>Bell pepper, diced</li>\n<li>White onion, diced</li>\n<li>Tomatoes, chopped</li>\n<li>Black pepper</li>\n<li>Salt</li>\n</ul>\n<p><u>Optional Ingredients:</u></p>\n<ul>\n<li>Cooked bacon or other meat, chopped</li>\n</ul>\n<p>Start by preheating your oven to 350°F. On your muffin pan, lightly spray each cup with cooking spray. Tear or chop the spinach leaves into small pieces and place them on the bottom of each cup; they will serve as the base of the bites. Mix in the diced bell peppers, white onions and tomatoes until the cups fill up about halfway. Add your choice of meat or additional ingredients and sprinkle with salt and pepper. Fill the rest of each cup with Chino Valley Ranchers’ liquid egg whites.</p>\n<p>With your muffin cups filled, place the pan into the oven until the egg whites are cooked, which takes about 10 &#8211; 12 minutes. Remove your bite-sized egg white cups from the oven and allow them to cook for about 5 &#8211; 10 minutes before enjoying.</p>\n<p>Not ready to eat them yet? These bite-size egg white cups can be stored in the fridge for three days or frozen in an air-tight bag. Just pop them into the oven for 10 minutes to reheat.</p>\n<p>There you have it – An easy breakfast that you can grab on the go! To make this recipe taste its best, be sure to use Chino Valley Ranchers’ liquid egg whites. It’s 100 percent organic, naturally fat-free, cholesterol-free and contains no additives or artificial ingredients. For more information about our products, contact us today.</p>\n"}