{"title":"Using Organic Egg Shells for Plant Fertilizer","slug":"using-organic-egg-shells-for-plant-fertilizer","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_dollarphotoclub_71714215.jpg","image":{"src":"/images/rsz_dollarphotoclub_71714215.jpg","alt":""},"date":"2015-06-23T13:45:52","author":"Chino Valley Ranchers","content":"<p>Are you looking for a great way to use your organic eggshells? There are many different ways you can recycle eggshells, but if you grow your own fruits, veggies, or herbs, then using organic eggshells as a fertilizer is an <em>egg-ceptional</em> way to reuse them. Eggshells contain nutrients such as calcium carbonate, which helps plants develop a strong cellular structure. Other nutrients include potassium phosphorus, magnesium, and sodium. Who wouldn’t want to add those to their food? Try out these tips for your summer garden.<!--more--></p>\n<p><strong>Teatime:</strong> One way to prepare your eggshells for their newfound job as a fertilizer is to steep them in water. Boil a gallon of water and add 10-20 clean, dry eggshells to it. Allow the shells to steep in water overnight. In the morning, simply strain the water into a bucket or bowl and use it to water your plants. This can be done up to once per week, but how often you can accomplish this depends on your family’s egg-eating habits.</p>\n<p><strong>Crush, mush, or stomp:</strong> Another way to infuse eggshells into your soil is to crush them. Gathering enough eggshells for this method may take awhile, so we recommend starting your collection near the end of fall. That way, when spring comes you’ll have accumulated enough to use for planting season. Once you’ve gathered enough eggshells, crush ‘em up (but make sure you are cleaning the residue off of each shell). The easiest way is to add them to a food processor and blend until a powder forms. It would also be fun to allow your kids to help: put the shells in a large gallon-sized zip bag, release the air, and zip shut. Have your kids stomp the eggshells to their heart’s delight (we recommend they wear shoes for this as eggshells can be sharp). Add the powder or finely stomped mixture to your potting soil and your plants will be happy all season. Tip: slugs and snails hate the sharpness of eggshells, so if you leave your pieces a bit bigger, it will help deter them.</p>\n<p>And that’s it! Pretty easy, right? All you have to do is save your eggshells!</p>\n<p>If you have any questions about our cage-free organic chickens and eggs, contact Chino Valley Ranchers today! We are family-owned and operated and would be happy to answer your questions.</p>\n"}