{"title":"What Every Consumer Should Know About Eggs","slug":"what-every-consumer-should-know-about-eggs","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/04/Untitled-design.jpg","image":{"src":"/images/Untitled-design.jpg","alt":""},"date":"2019-09-23T22:43:12","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">It almost seems like every few months you spot a new variety of eggs at the grocery store. From free-range and cage-free, to pasture-raised, certified organic, soy-free, Omega-3 enriched and Vegetarian — it can be hard to keep up with the labels. That’s why we decided to help clear up the confusion and help you understand what the labels mean.</span><!--more--></p>\n<p><b>Conventional Eggs</b></p>\n<p><span style=\"font-weight: 400;\">Conventional eggs have long been the standard in egg production. Hens laying these eggs live in cages and are provided with feed, water and security. </span></p>\n<p><b>Free-Range Eggs (American Humane Certified)</b></p>\n<p><span style=\"font-weight: 400;\">Hens laying free-range eggs have outdoor access, with at least 21.8 square feet of outdoor space per hen. The American Humane Society does not require a minimum period of outdoor access. </span></p>\n<p><b>Cage-Free Eggs (American Humane Certified)</b></p>\n<p><span style=\"font-weight: 400;\">Hens laying cage-free eggs are allowed to roam inside barns and have the freedom to nest, perch and dust-bathe. Each hen must have 1.25 square feet of floor space. </span></p>\n<p><b>Pasture-Raised Eggs (American Humane Certified)</b></p>\n<p><span style=\"font-weight: 400;\">Hens laying pasture-raised eggs are free to roam on pastures and have at least 108 square feet of pasture covered mainly with living vegetation. Pasture-raised hens forage for whatever bugs and plants are found on the pasture. The American Humane Society does not specify a minimum period of outdoor access.</span></p>\n<p><b>Certified Organic</b></p>\n<p><span style=\"font-weight: 400;\">Organic eggs are certified by the U.S. Department of Agriculture. The USDA requires that all feed, feed supplements, feed additives and pastures be organically produced, handled and certified under the NOP regulations. Antibiotics, GMO-derived products, animal by-products and synthetic preservatives are not allowed in any feed products. The USDA also prohibits the use of animal drugs and hormones to promote growth. </span></p>\n<p><i><span style=\"font-weight: 400;\">Learn more about the USDA’s </span></i><a href=\"https://www.ams.usda.gov/sites/default/files/media/Poultry%20-%20Guidelines.pdf\"><i><span style=\"font-weight: 400;\">Guidelines for Organic Certification of Poultry</span></i></a><i><span style=\"font-weight: 400;\">. </span></i></p>\n<p><b>Soy-Free</b></p>\n<p><span style=\"font-weight: 400;\">Soy-free eggs are produced by hens who have not consumed feed containing soy.</span></p>\n<p><b>Omega-3</b></p>\n<p><span style=\"font-weight: 400;\">Omega-3 eggs are produced by hens who consume a diet enriched with Omega-3 fats. </span></p>\n<p><b>Vegetarian</b></p>\n<p><span style=\"font-weight: 400;\">Vegetarian eggs are produced by hens fed a pure vegetarian diet consisting of grains, seeds and meal.</span></p>\n<p><span style=\"font-weight: 400;\">For more information about Chino Valley Ranchers specialty eggs, visit our page titled “</span><a href=\"https://www.chinovalleyranchers.com/it-starts-with-our-feed/\"><span style=\"font-weight: 400;\">It Starts With Our Feed</span></a><span style=\"font-weight: 400;\">”. </span></p>\n"}