{"title":"When Delicate becomes Diverse: 5 Uses for your Organic Eggshells","slug":"when-delicate-becomes-diverse-5-uses-for-your-organic-eggshells","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_dollarphotoclub_71714215.jpg","image":{"src":"/images/rsz_dollarphotoclub_71714215.jpg","alt":""},"date":"2015-05-04T15:53:10","author":"Chino Valley Ranchers","content":"<p>Egg white, egg yolk, egg shell… one of these things is not like the other. When we prepare and eat organic eggs, the shells are generally overlooked as they are not edible. According to <a href=\"http://www.earth911.com/food/eggshells/\">Earth911.com</a>, Americans alone will throw out 150,000 tons of eggshells every year. But just because we usually trash them does not mean that they are not as <em>egg</em>-citing as the rest of the egg! There are so many uses for the egg shells once the organic egg inside has been consumed. They are great for use around the home! So pull out those Pinterest boards, and let’s get <em>crackin’</em>!<!--more--></p>\n<ul>\n<li><strong>Pretty Planter: </strong>Want a unique indoor garden? Eggshells create the perfect starting home for seeds. Crack off the top third of the shell, clean it out, fill it with soil, and push a seed into the middle. The best part? When the plant starts to outgrow the shell, put the whole thing—shell and all—straight into a bigger pot. Eggshells are biodegradable, so they do not need to be removed.</li>\n<li><strong>Beneficial Band-Aid:</strong> The thin membrane that sits between the shell and the egg white is nature’s bandage. So next time a knife nicks skin, throw the membrane over it temporarily. It helps stop the bleeding just until proper medical attention can be given.</li>\n<li><strong>Cheery Chalk:</strong> Having trouble keeping those eggshells in one piece? Not a problem. Eggshell can be ground up and combined with flour, water, and the brightest, boldest, food coloring to form a paste. Set the paste in a silicone mold and let it dry for some great sidewalk chalk!</li>\n<li><strong>Brilliant Blades:</strong> When the blades in blenders and food processors get dull, eggshells help sharpen them. Store all used eggshells in the freezer, and whenever the blender gets dull, throw in the eggshells. Just be sure to clean it extra well afterward!</li>\n<li><strong>Premier Pesticide:</strong> Want to get rid of bugs in the garden and planters, but not ready to use a harmful pesticide? Spread crushed eggshells in a circle around the plants. Bugs would rather turn around than crawl over the jagged pieces.</li>\n</ul>\n<p><a href=\"http://www.chinovalleyranchers.com/our_eggs_organic.php\">Organic eggs</a> are not only healthy for the body, but for the home as well! Put your eggshells to good use with these ideas. For any questions or more ideas, call <a href=\"http://www.chinovalleyranchers.com/contact_us.php\">Chino Valley Ranchers</a> today!</p>\n"}