{"title":"Why Organic Matters","slug":"why-organic-matters","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/12/CVR_Blogmm_Thumbnail.png","image":{"src":"/images/CVR_Blogmm_Thumbnail.png","alt":""},"date":"2018-12-12T07:00:41","author":"Chino Valley Ranchers","content":"<p>Chino Valley Ranchers was one of the first egg producers to adopt the organic egg concept. It all dates back to the second generation of the family business when Steve and Kathy Nichols were asked if they could produce eggs that were certified organic. After a lot of research and over 30 years of refining diets and free-range techniques for raising hens, Chino Valley Ranchers has become one of the leading organic egg providers in the country.<!--more--></p>\n<p><strong>A Family Tradition<br />\n</strong>There are several facets involved in producing certified organic eggs. Not all “organic” egg ranchers have a true free-range environment for their hens, at least not to the extent that Chino Valley Ranchers lets their chickens roam free and live a happier, more active lifestyle.</p>\n<p>“My father took the chance in organic farming,” said Chris Nichols, Steve’s son and the third generation of leadership in this family business. “That really did enhance our business. We’re going on almost 30 years of cage-free. We figured out the best way to take care of these hens and give them the most optimal lifestyle—the most natural lifestyle—that they’re accustomed to.”</p>\n<p><strong>All-Organic Diets<br />\n</strong>According to the USDA, a certified organic egg means that each hen’s diet must be free of antibiotics, growth hormones, herbicides and pesticides. Any non-organic elements found in the feed or mistreatment in the hens’ environment can lead to a revocation of the organic certification.</p>\n<p>At Chino Valley Ranchers, we follow very careful planning, procedures and inspections to ensure that everything we do adheres to the highest possible organic standards set forth by the USDA and other organizations committed to quality, organic products. We’ve spent years perfecting all-organic, ideal diets for our hens that are designed to keep our chickens as healthy as possible. This leads to more nutrient-rich eggs and egg products that are certified organic per USDA standards.</p>\n<p><strong>The Benefits of Organic Eggs<br />\n</strong>At Chino Valley Ranchers, we are committed to bringing our customers the healthiest organic eggs possible. Our all-organic approach is what leads to better, healthier eggs laid by happy hens who are raised in the California sunshine. We take the USDA regulations seriously, but more importantly, we take your health seriously. So, the next time you think, “why organic eggs?”, remember Chino Valley Ranchers and our commitment to you.</p>\n<p>To learn more about our free-range, all-organic methods for raising hens, check out our latest <a href=\"https://www.chinovalleyranchers.com/the-california-organic-difference/\">video here</a>.</p>\n"}