{"title":"You’ll Want to Try These Hash Brown Egg Cups","slug":"youll-want-to-try-these-hash-brown-egg-cups","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/08/rsz_img_9273_1.jpg","image":{"src":"/images/rsz_img_9273_1.jpg","alt":""},"date":"2016-09-28T10:36:05","author":"Chino Valley Ranchers","content":"<p>At Chino Valley Ranchers, we think it is always fun to try new recipes – especially when eggs are involved! When we discovered this hash brown egg cups recipe, we knew we had to share it with our customers. This cute and tasty hash brown and egg combo is definitely something you will want to try. To see the full recipe, continue reading!<!--more--></p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Potatoes</li>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Cooking spray</li>\n</ul>\n<p><strong>1. Prepare your potatoes.</strong></p>\n<p>Get started by preheating your oven to 400° Fahrenheit. Once that is done, bake your potatoes for about 45 minutes to an hour, or until the potatoes are tender. Then remove them from the oven and let them cool. Once they are cool, peel and grate the potatoes. If the potatoes are still warm, this will be hard to do, so really give them time to cool. Then, add salt and pepper to the potatoes and toss the mixture with your hands to fully season them.</p>\n<p><strong>2. Get your hash browns ready.</strong></p>\n<p>Take out a muffin pan and thoroughly spray it – that way, the final dish does not stick to the bottom of the pan. Then, scoop out three to four tablespoons of your grated potatoes into each muffin hole. Your potatoes will act as a “hash brown nest” to your eggs, so feel free to use your fingers to mold that nest into each muffin hole. Lightly add another layer of cooking spray and place them in the oven for about 15-20 minutes, depending on how crisp you like your hash browns.</p>\n<p><strong>3. Add your eggs.</strong></p>\n<p>After pulling the hash brown nests out of the oven and letting them cool for a bit, it is time to add your eggs! Crack one Chino Valley Rancher egg into each muffin hole. Sprinkle a touch of salt and pepper over the eggs and place them in the oven. Have them bake for about 15-20 minutes, or until the egg whites are set. Then pull them out of the oven and let them cool.</p>\n<p>With that, your hash brown egg cups are ready to serve! To make this recipe the best it can be, be sure to use Chino Valley Ranchers’ eggs. We produce high quality and delicious eggs for our customers to enjoy. For more information on our eggs, contact Chino Valley Ranchers today!</p>\n"}