{"title":"You’ll Love Our Crustless Veggie Quiche Recipe","slug":"youll-love-our-crustless-veggie-quiche-recipe","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/06/recipe_broccoli_crustless_quiche.jpg","image":{"src":"/images/recipe_broccoli_crustless_quiche.jpg","alt":""},"date":"2017-06-07T21:49:35","author":"Chino Valley Ranchers","content":"<p>This week, Chino Valley Ranchers brings you a healthy twist on a breakfast classic! We’ve created a quiche that combines a medley of veggies, cheese, and your favorite Chino Valley Ranchers’ egg whites. What else makes this veggie quiche unique? It’s crustless! This means less time cooking, and more time digging in. Check out the recipe below:<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Olive oil</li>\n<li>Sliced yellow squash</li>\n<li>Sliced zucchini</li>\n<li>Chopped bell pepper</li>\n<li>Chopped roasted garlic</li>\n<li>Milk</li>\n<li>Shredded cheese</li>\n<li>Grated parmesan</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt &amp; pepper</li>\n<li>Ground thyme</li>\n</ul>\n<p><strong>1. Sizzle the squash.</strong></p>\n<p>Preheat your oven to 350° F. Lightly coat a large skillet with olive oil and bring it to medium-high temperature. Add the sliced squash, zucchini, chopped bell pepper and roasted garlic. Allow the veggies to cook until they are tender, making sure to stir frequently. Sprinkle with salt, pepper and ground thyme for an extra pop of flavor!</p>\n<p><strong>2. Assemble the quiche.</strong></p>\n<p>In a large bowl, whisk together your Chino Valley Ranchers’ eggs with equal parts of milk. Add the chopped bell pepper and mix until thoroughly combined.</p>\n<p>Arrange the cooked veggies in a non-stick pie pan and top with shredded cheese. Pour in the egg mixture and sprinkle the top with grated parmesan cheese.</p>\n<p><strong>3. Bake and serve.</strong></p>\n<p>Transfer your pie pan into the oven and bake it until it no longer jiggles, which usually takes about 45 minutes. Once it’s done, remove your quiche from the oven and let it cool for a few minutes before slicing and serving.</p>\n<p>Want to make this ahead of time? You can! Baked quiche freezes well – up to 2 months! Just make sure to thaw overnight and reheat at 350° F for about 20 minutes.</p>\n<p>We hope you enjoyed our healthy, crustless veggie quiche recipe! Be sure to check out other Chino Valley Ranchers’ recipes on our website. If you have questions about our products, please contact us today!</p>\n"}