{"title":"4 Steps to Organic Egg Certification","slug":"4-steps-to-organic-egg-certification","excerpt":"<p>It’s no crack up: When it comes to buying eggs, all of the information swirling around can leave consumers feeling eggs-tremely scrambled.  Free range? Organic? Brown? Vegetarian fed? Fortunately, the USDA has a stringent organic egg certification process. If shoppers are in the market for organic eggs, they can rest assured that the following steps&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_eggs.jpg","image":{"src":"/images/rsz_eggs.jpg","alt":""},"date":"2015-05-11T16:02:02","author":"Chino Valley Ranchers","content":"<p>It’s no <em>crack</em> up: When it comes to buying eggs, all of the information swirling around can leave consumers feeling <em>eggs-tremely</em> <em>scrambled</em>.  Free range? Organic? Brown? Vegetarian fed? Fortunately, the USDA has a stringent organic egg certification process. If shoppers are in the market for organic eggs, they can rest assured that the following steps were taken.<!--more--></p>\n<p>• Organic feed: From their second day of life, organic egg hens are required to feast on organic pasture grass. They might occasionally receive vitamin or mineral supplements, but only to keep them healthy, not to bulk them up.</p>\n<p>• Outdoor Access: In 2010, the Access to Pasture Rule was made effective. This means that all certified organic livestock absolutely must not be confined indoors. However, the rule fails to specify what “outdoor area” means; it does not guarantee that the chicken ever goes outside, only that it cannot be confined to a cage.</p>\n<p>• Omitted hormones and antibiotics: Organic egg-laying chickens should never receive growth hormones or antibiotics. However, some chicken farmers use antibiotics to avoid the spread of disease. Though traces of these antibiotics are very small in the actual egg, a resistance to these antibiotics can build up in humans over time, making the treatment of certain bacteria and viruses problematic.</p>\n<p>• Optimum healthcare: Organic laying hens are required to have premium health care; this includes necessary vaccines and immediate treatment of illness. In a large, mass-producing egg farm, it might be cheaper to slaughter sick hens rather than helping them. However, this option is not available for organic producers; they absolutely must treat illnesses in their hens. If the required medication is not on the NOSB-approved list, the eggs cannot be marketed as organic.</p>\n<p>At Chino Valley Ranchers, we are egg-cited to have our organic egg certification. We take the business of being organic egg farmers seriously, which means that our hens are treated humanely and all USDA guidelines are closely observed. If you’re in the market for delicious eggs, try us out today!</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n"}