{"title":"5 Secrets For The Perfect French Toast","slug":"5-secrets-for-the-perfect-french-toast","image":{"src":"/images/CVR_Blog_Thumbnail-3-374raivqwo61kzke49kem8.png"},"date":1647449342237,"author":"Chino Valley Ranchers","content":"<p>Making French Toast isn’t a science. It’s something most of us just slap together with some eggs, milk, and bread. Breakfast will likely turn out fine, and you’ll be on your way to work.</p><p></p><p>But if you woke up craving a mouthwatering, out-of-this-world french toast, then here are a few tips to try.</p><p></p><ol><li><p><strong>Choose a good quality bread.</strong></p></li></ol><p>Standard sandwich bread won’t hold thick custard very well. That’s why you should go for a higher quality bread, such as brioche or challah, French bread, Texas Toast, Cinnamon bread, or croissants for a lighter and crispier french toast.<br></p><ol start=\"2\"><li><p><strong>Get the custard done right.</strong></p></li></ol><p>Creamy custard will take your french toast to the next level. Skip the fat free milk, and opt for half-and-half, whole milk, or cream. Aim for ¼ cup dairy per whole egg.<br></p><p>Add sugar (or powdered sugar, honey, or maple syrup) and whisk until no egg whites or yolk are visible. Avoid soaking the bread for too long — dip both sides and remove.</p><p></p><ol start=\"3\"><li><p><strong>Add some flavor.</strong></p></li></ol><p>If you’d like an extra kick of flavor, consider adding spices like cinnamon, nutmeg, and cardamom, and extracts like vanilla or almond, fresh lemon or orange zest, or bourbon or rum.</p><p></p><ol start=\"4\"><li><p><strong>Use both butter and oil.</strong></p></li></ol><p>Use a neutral cooking oil like canola and butter to get the best of both worlds: golden edges with rich flavor. Canola oil is flavorless but has a high smoke point, while butter has flavor but a low burning temperature.</p><p></p><ol start=\"5\"><li><p><strong>Mind the heat.</strong></p></li></ol><p>Avoid overcooking or burning the French toast by preheating a non-stick skillet over low heat. Add butter and then the toast. Keep the temperature between low and medium-low.<br></p><p><strong>The Perfect French Toast Recipe</strong></p><p>To make the ultimate french toast, you’ll need eight slices of good quality bread, five Chino Valley Ranchers pasture raised eggs, ¼ cup half-and-half (or whole milk or cream), two tablespoons of sugar, one teaspoon ground cinnamon, two teaspoons vanilla extract and butter. To serve the french toast, you’ll need warm syrup, strawberries, and whipped cream.</p><p></p><p>View the full recipe <a href=\"https://www.thepioneerwoman.com/food-cooking/recipes/a32053545/how-to-make-french-toast/\">here</a>.<br></p>"}