{
  "title": "6 Fun Facts About Chickens",
  "slug": "6-fun-facts-about-chickens",
  "image": {
    "src": "/images/hero-home.jpg",
    "alt": "chickens"
  },
  "date": "2021-11-19T00:00:00Z",
  "author": "Chino Valley Ranchers",
  "content": "<p>Apart from reading and deciphering egg carton labels, most consumers don’t give much thought to how chickens are raised on farms across the country. But there are a few fun facts about chickens that may surprise you.<br></p><ol><li><p><strong>Some chicken breeds are nearly extinct.</strong></p></li></ol><p>Just like there are many dog breeds, there are also many chicken breeds. Unfortunately, certain species are nearing extinction because industrial farming favors breeds that produce an optimal number of eggs.</p><p></p><p>Maintaining a diverse gene pool and having a wide range of breeds is key for food safety. One breed may have natural resistance to pathogens that could potentially eliminate other&nbsp; breeds.</p><p></p><ol start=\"2\"><li><p><strong>Most chickens lay about one egg per day.</strong></p></li></ol><p>Regardless of how many roosters are in a flock, most chickens can only lay one egg a day. Only in the movies will you see hens laying half a dozen eggs per day.<br></p><ol start=\"3\"><li><p><strong>A chicken’s egg color can often be determined by its earlobe color.</strong></p></li></ol><p>Though egg yolk is tied to a chicken’s diet, the overall egg color may be related to the chicken’s earlobes. Different breeds of chickens lay different colored eggs. For example, the Rhode Island Reds, Buff Orpingtons, and Dominiques lay brown eggs, while Polish, Leghorns, and Anconas lay white eggs. Ameraucanas, on the other hand, lay green or blue-tinted eggs.</p><p></p><ol start=\"4\"><li><p><strong>Chickens slurp grass like spaghetti.</strong></p></li></ol><p>Pasture-raised chickens enjoy more sunshine than conventional chickens and lay eggs with higher amounts of vitamin D, beta-carotene, and vitamin A. They’re also lower in cholesterol and saturated fat.<br></p><ol start=\"5\"><li><p><strong>Chickens’ sounds have meaning.</strong></p></li></ol><p>You already know that toys and dogs speak to each other, but did you know that chickens also have a language? Spend a day with chickens and you’ll see that specific sounds are associated with particular actions. For example, the warning call of a hawk flying overhead is different from the “I’m about to lay an egg” announcement.</p><p></p><ol start=\"6\"><li><p><strong>Chickens prefer dust baths.</strong></p></li></ol><p>Digging a shallow pit, rolling around in the dust, and flapping dirt up through their wings is just what a chicken wants after a long day at work. Scientists believe chickens do this to maintain proper feather insulation and keep parasites away.<br></p>",
  "excerpt": "<p>Apart from reading and deciphering egg carton labels, most consumers don’t give much thought to how chickens are raised on farms across the country. But there are a few fun facts about chickens that may surprise you.</p>"
}