{"title":"A Healthy Egg and Farro Grain Salad to Kick-Start Your 2019","slug":"a-healthy-egg-and-farro-grain-salad-to-kick-start-your-2019","excerpt":"<p>The new year has begun and what better way to kick off your new year resolutions than with a salad bowl! This recipe has nutty farro grains, tossed with fresh greens in a delicious vinaigrette with thyme sprigs, chicken, and of course – Chino Valley Ranchers’ organic free-range eggs. Why farro, you ask? Farro is&#8230;</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","egg recipes","free range eggs","healthy","healthy food","healthy resolution","new year","recipes"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2019/01/blog_thumbnail.png","image":{"src":"/images/blog_thumbnail.png","alt":""},"date":"2019-01-05T00:14:09","author":"Chino Valley Ranchers","content":"<p>The new year has begun and what better way to kick off your new year resolutions than with a salad bowl! This recipe has nutty farro grains, tossed with fresh greens in a delicious vinaigrette with thyme sprigs, chicken, and of course – Chino Valley Ranchers’ organic free-range eggs.</p>\n<p><em>Why farro</em>, you ask? Farro is a great, healthy option to add whole grains, protein and fiber into your diet. It’s an ancient grain that can be added to a variety of your favorite dishes for a nutty flavor you may missing from grains like rice or pasta. With this bowl, you will be well on your way to fueling your body with the nutrients it needs to make it the strongest and healthiest it can be this year.<!--more--></p>\n<p><u>What You’ll Need: </u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Farro, 1 container</li>\n<li>Olive oil</li>\n<li>Sherry vinegar</li>\n<li>Salt</li>\n<li>Arugula</li>\n<li>Asparagus, 1 bunch</li>\n<li>Cherry tomatoes</li>\n<li>Boneless chicken thighs, 1 pound</li>\n<li>Black pepper</li>\n<li>Oregano, dried</li>\n<li>Thyme, fresh</li>\n</ul>\n<p>Start by preheating your oven to 400°F. Cook the farro by placing 1:2 parts farro to water in a pot and bringing it to a boil. Reduce the heat to low, cover and simmer for about 40 minutes or until the grains are tender and have absorbed all the liquid.</p>\n<p>While the farro cooks, put the asparagus, tomatoes and chicken on a large sheet and drizzle with a few tablespoons of olive oil. Toss with pepper, salt and oregano, and make sure everything is coated and laying evenly on the sheet. Place some thyme sprigs on top and roast for 20 to 25 minutes, or until the chicken registers at 165°F.</p>\n<p>In a large bowl, toss the cooked farro with a tablespoon olive oil, sherry vinegar, and a dash of salt. Mix in the arugula and set it aside. Meanwhile, cook your Chino Valley Ranchers’ eggs according to your favorite method – we recommend boiling! Allow your eggs to chill until it’s time to serve the grain bowl.</p>\n<p>It’s time to assemble your salad! Grab some bowls and distribute an even amount of the farro and arugula. Place the sliced chicken and asparagus on top and garnish with cherry tomatoes.</p>\n<p>There you have it! A healthy kick-start to your 2019. Make sure to use organic, grass-fed eggs from Chino Valley Ranchers – <a href=\"https://www.chinovalleyranchers.com/store-locator/\">located at a store near you</a>. To learn more about Chino Valley Ranchers’ eggs and products, <a href=\"https://www.chinovalleyranchers.com/store-locator\">contact us today</a>!</p>\n"}