{"title":"Almond Flour Pumpkin Muffins with Streusel Topping","slug":"almond-flour-pumpkin-muffins-with-streusel-topping","image":{"src":"/images/Flour Pumpkin Muffins.png"},"date":1697839246702,"author":"Chino Valley Ranchers","content":"<p>Almond flour pumpkin muffins with the best fluffy texture!&nbsp; With pumpkin spice flavors, a sweet and delicious streusel topping, and healthy nourishing ingredients, these gluten-free pumpkin muffins will become a fall staple for the whole family.<br></p><p><img src=\"https://lh7-us.googleusercontent.com/yIqEYfYeduGfmZvugTksDKTuzSEu3yTrtEDLk9-udfaknOkcIzdVB-PwBCX0ONa_9Up9sPJ6nT9e2cGWlVU1pCyhqKE4royqzCirWXdyFBP8G3QgSTSZUST96CcAL3E4cu0orV1lw51RXOtS__-qHWk\" width=\"401\" height=\"502\"><strong>Almond Flour Pumpkin Muffins with Streusel Topping:<br></strong></p><p>Our goal with all my muffin recipes is to make them delicious and nourishing. That's exactly what you get with these gluten-free almond flour-based muffins! These are no different. We're using pure pumpkin puree (not pumpkin pie filling which is sweetened already), almond flour, coconut sugar, eggs, and coconut oil to get a fluffy texture with loads of flavor. A must-have when baking with gluten-free flour is eggs.<br></p><p><strong>Why you'll love these muffins:</strong></p><p></p><p><strong>Easy to make</strong> - The batter is mixed in one bowl, which makes muffin making easy, and clean up quick!<br><br><strong>Fluffy moist texture </strong>- The combination of almond flour, pumpkin, and liquid eggs gives these muffins the perfect amount of structure, moisture, and fluffy texture.<br></p><p><strong>Perfect amount of sweetness</strong> - Coconut sugar is the sweetener we're using here in both the batter and streusel topping.&nbsp; It's the perfect amount of sweetness that makes these muffins great for breakfast, snack, or a treat!<br><br><strong>Pumpkin spice goodness </strong>- Thanks to the pumpkin spice mixture (which is cinnamon, allspice, clove, nutmeg, and ginger), you get the distinct spiced pumpkin pie flavors that scream fall.<br></p><p><strong>Simple ingredients you'll need:</strong></p><p></p><p>Scroll down to view the recipe card below for the full ingredients list, nutrition facts, and step-by-step instructions.<strong><br></strong></p><ul><li><p>1/2 cup + 1 tbsp <a href=\"https://www.chinovalleyranchers.com/productshttps://www.chinovalleyranchers.com/products\">Chino Valley Ranchers Pasture Raised Liquid Whole Eggs</a> (3 egg equivalent)</p></li><li><p>1/2 cup pumpkin puree</p></li><li><p>1 tbsp coconut oil, melted</p></li><li><p>2 tsp vanilla extract</p></li><li><p>3/4 tsp apple cider vinegar</p></li><li><p>1.5 cups almond flour</p></li><li><p>6 tbsp coconut sugar</p></li><li><p>3/4 tsp cinnamon</p></li><li><p>1/2 tsp pumpkin pie spice</p></li><li><p>1/2 tsp baking soda</p></li><li><p>1/8 tsp sea salt</p></li></ul><p><strong>Streusel Topping Ingredients</strong></p><ul><li><p>3 tbsp almond flour</p></li><li><p>2 tbsp rolled oats</p></li><li><p>1.5 tsp coconut sugar</p></li><li><p>2 tbsp coconut oil, melted<br><br><strong>How to make healthy pumpkin muffins:<br></strong></p></li><li><p>Preheat the oven to 350 degrees F.&nbsp; Line a muffin tin with 10 silicone liners or paper liners.</p></li><li><p>In a large bowl combine the eggs, pumpkin puree, oil, vanilla, and apple cider vinegar. Whisk well to combine the wet ingredients.<br><br><img src=\"https://lh7-us.googleusercontent.com/DtTM_mPF62FCo-RaMj04xw1RjqBbtUdKuzvqaG5P9d-K7bu_0TE8GlQRfzS2d4g38o-4hzBEO0DC2nIa0h2pi4sJ92035FieaMlJUejqnoNUxbSWAVg39MSM0EMyKkrkXxGnCgzO-MhocONEBb5gb_Q\" width=\"432\" height=\"539\"></p></li><li><p>In the same bowl, add the almond flour, sugar, spices, baking soda, and salt.&nbsp; Mix the dry ingredients together slightly, then fully whisk into the pumpkin mixture until just combined.</p></li><li><p>Using a measuring cup or cookie scoop, spoon the pumpkin muffin batter into the prepared muffin liners.<br><br><img src=\"https://lh7-us.googleusercontent.com/2_h4ZGuqvbu5b2VU1zAdM4FiCwAtCo4wtmd1yjxDIYlTOO50qMCWt2uBqFp2yXWLm-Ow3AUYT59lxLCwaG8hrtsLAslMZhHeE1m-oehMxUSdg6AnKRJovDpUnVTFoI2oTx3MnGbBtb3H85BJ8foQpiI\" width=\"427\" height=\"534\"></p></li><li><p>If you're making the streusel, mix the almond flour, oats, and coconut sugar together.&nbsp; Next, stir in the melted coconut oil.</p></li><li><p>Sprinkle the streusel mixture over the top of each muffin.</p></li><li><p>Bake for 22-24 minutes, or until a toothpick comes out clean when inserted into the center of the muffins.</p></li><li><p>Cool your fluffy almond flour muffins on a wire rack and then enjoy!</p></li></ul><p><img src=\"https://lh7-us.googleusercontent.com/ohrELMSestiK0yn1eA6aTOAK8SwUyurGSTy5AboVDogNbjNmyw3NLeuaRmcRHNJpFtjbTTZ3nROc8bXvMXfvZFqIpIWLJoIpuI-5jsD3TVMkun7Yv5nuDamOacY_HYymtlPoC_12Y2UFhbDswKSh9vo\" width=\"384\" height=\"481\"></p><p><strong>How to make these grain-free:<br></strong></p><p>Turn these muffins into paleo pumpkin muffins by switching the oats in the streusel mixture for pumpkin seeds, chopped almonds, or shredded coconut. All the other ingredients are already grain-free and made without refined sugar!</p><p></p><p><img src=\"https://lh7-us.googleusercontent.com/Pg5oVR7sfdykExiDY6Go_mTJ3mrpsXev1hNKQ-fNHXI6BeyO-opQo9QEiEXFmUGW-uvwbAfT9ieq-gX39lnIvbvsz67zTrf8DhhT8y9bBsYWMRydMOkc0U-NOwsV1p9d-UzHXkArzAoGY1hNZUuQgLo\" width=\"624\" height=\"499\"><br><strong>How to store almond flour pumpkin muffins:<br></strong></p><p>Once fully cooled to room temperature, these muffins store well on the counter or in the fridge. They also freeze really well! To store fresh, add to an airtight container or wrap in plastic wrap and keep on the counter or in the fridge for 5 days. To freeze, line a cutting board or baking sheet with parchment paper and add the cooled muffins onto it. Place in the freezer until the muffins are fully frozen. Once frozen, add to a freezer bag, label and date it, and keep frozen for up to 6 months.</p><p>Defrost individual muffins on the counter or in the fridge and enjoy fall flavors all year long!<br></p><p><img src=\"https://lh7-us.googleusercontent.com/QAaW9hRdBoqE9i5K9q455dOH1uPg5ci2MooZMqqW5LaocFEki5s18DJAkqwXeLgrI9nwaJiAi5P32Euizv7OsWC4f324bM_vAY8f541CxeS4N5MKvBVaKRkHjF6seMs5zoXuLEdmAV-47wCGdDoYmq0\" width=\"405\" height=\"507\"><br><strong>Substitutions:<br></strong></p><p>Below you’ll find a list of substitutions that will work well in this pumpkin spice goodness muffin recipe. If you try something different out, please leave a comment below letting us all know how it turned out!</p><p><strong><br>Eggs </strong>- An egg replacer like chia eggs or flax egg will not work very well in this recipe.&nbsp; Because the base is made of almond flour, 3 whole eggs or the liquid whole eggs in the recipe are a must.</p><p></p><p><strong>Pumpkin puree</strong> - Try this recipe with mashed butternut squash or sweet potato! If you make homemade pumpkin puree it works great in this recipe too!</p><p></p><p><strong>Coconut oil </strong>- Other oils like avocado oil or extra virgin olive oil will work in place of melted coconut oil.&nbsp; Melted butter or ghee will work too!</p><p></p><p><strong>Apple cider vinegar </strong>- Any vinegar will work in place of ACV to act as the acid that reacts with the baking soda to give these muffins a nice rise.&nbsp; Try distilled vinegar or rice vinegar.&nbsp; Lemon juice works here too!</p><p></p><p><strong>Almond flour </strong>- You can replace all or some of the fine almond flour with almond meal.&nbsp; For a nut-free option, try oat flour!&nbsp; A 1:1 replacement using coconut flour will not work here.</p><p></p><p><strong>Coconut sugar -</strong> Brown sugar, maple sugar, or natural cane sugar all work well in place of coconut sugar.</p><p></p><p><strong>Streusel Topping -</strong> Swap out the streusel topping and instead add dark chocolate chips, cinnamon sugar, or pumpkin seeds to the tops of the muffins.<br></p><p><img src=\"https://lh7-us.googleusercontent.com/8T7_xUsbr30dXI4YXG8UCJGuZRWRg83hqgvhQwNbslgxpLO62-AIb3n3voAJAO7HUnpt4EvfpLIPGqKi31_VsfXPfOQ9QM0MssukDkjksN_f1iTEHEJ2pXR-c1zyZFJrUyAERcQp5dqnB1zIo4G3F7o\" width=\"499\" height=\"399\"></p><p><br></p>"}