{"title":"An Egg a Day Keeps the Doctor Away","slug":"an-egg-a-day-keeps-the-doctor-away","excerpt":"<p>There’s always been an on-again, off-again discussion about cholesterol and egg consumption. Is it safe to eat? Will it increase cholesterol levels? Well, a new study published in the journal, Heart, has hopefully settled the debate.</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/07/CVR_Blog_Thumbnail.png","image":{"src":"/images/CVR_Blog_Thumbnail.png","alt":""},"date":"2018-07-19T20:58:59","author":"Chino Valley Ranchers","content":"<p>There’s always been an on-again, off-again discussion about cholesterol and egg consumption. Is it safe to eat? Will it increase cholesterol levels? Well, a new study published in the journal, <a href=\"https://heart.bmj.com/content/early/2018/04/17/heartjnl-2017-312651\"><em>Heart</em></a>, has hopefully settled the debate.<!--more--></p>\n<p>The study looked at more than half a million adults in China, who were asked about their egg consumption frequency. The participants were then followed for nine years, and scientists compared their egg consumption with disease and death reports. The results? Those who consumed eggs daily were at an 11 percent lower risk of developing heart disease than compared to people who didn’t consume eggs at all. The researchers concluded that consuming an egg a day was “significantly associated” with a lower risk of cardiovascular disease.</p>\n<p>This study adds to emerging evidence that dietary cholesterol from egg consumption is generally healthy for most Americans. Yes, eggs contain up to 200 milligrams of cholesterol per serving, and when compared to most other foods, that number seems outrageous. But just because food has high cholesterol does not always mean it will raise the bad levels of cholesterol in your system.</p>\n<p>It’s also safe to say that cholesterol is a very important compound in the body. It’s needed to make hormones, vitamin D, and certain substances that help you to digest your food. Your body makes cholesterol, but you also get a small amount from some of the foods you eat, like eggs. It once was thought that the cholesterol from your diet had a significant effect on the amount of cholesterol in your blood; however, researchers from this study suggest that this is no longer the case.</p>\n<p>At Chino Valley Ranchers, we understand that eggs are a staple for many healthy diets. That’s why we provide our hens with thriving environments to ensure that you receive nutrient-dense, organic eggs that taste delicious. To learn more about Chino Valley Ranchers’ eggs and where to find them, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us </a>today!</p>\n"}