{"title":"Bake a Goat Cheese Spinach Quiche for Mom this Mother’s Day","slug":"bake-a-goat-cheese-spinach-quiche-for-mom-this-mothers-day","excerpt":"<p>Mother’s Day is just around the corner, and your friends at Chino Valley Ranchers have a great brunch recipe that your mom will love! We’ve created a flavor-packed quiche using delicious Chino Valley Ranchers’ eggs, goat cheese, spinach and other tasty ingredients. Satisfy mom’s (and everyone else’s) appetite with this hearty goat cheese spinach quiche&#8230;</p>\n","keywords":["best eggs","Best Organic Eggs","cage-free eggs","cage-free organic eggs","Chino Valley Ranchers","Chino Valley Ranchers' organic omega-3 eggs","egg recipe","eggs","free range eggs","freshest eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/05/recipe-image-legacy-id-3570_11.jpg","image":{"src":"/images/recipe-image-legacy-id-3570_11.jpg","alt":""},"date":"2017-05-10T21:57:25","author":"Chino Valley Ranchers","content":"<p>Mother’s Day is just around the corner, and your friends at Chino Valley Ranchers have a great brunch recipe that your mom will love! We’ve created a flavor-packed quiche using delicious Chino Valley Ranchers’ eggs, goat cheese, spinach and other tasty ingredients. Satisfy mom’s (and everyone else’s) appetite with this hearty goat cheese spinach quiche recipe!</p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Pre-baked pie crust</li>\n<li>Olive oil</li>\n<li>Minced garlic</li>\n<li>Fresh spinach</li>\n<li>Whole milk</li>\n<li>Crumbled goat cheese</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt &amp; pepper</li>\n<li>Sun-dried tomatoes</li>\n</ul>\n<p><strong>1. Prepare your filling.<br />\n</strong>Preheat your oven to 350° Heat the olive oil, minced garlic and a handful of spinach in a skillet over medium heat. Once the spinach becomes wilted, turn off the heat and set your mixture aside.</p>\n<p>In a clean bowl, whisk equal parts of the whole milk with your Chino Valley Ranchers’ eggs. Stir in the crumbled goat cheese and sun-dried tomatoes. Add in the spinach-garlic mixture from earlier and sprinkle with salt and pepper for extra flavor!</p>\n<p><strong>2. Bake your quiche.</strong></p>\n<p>Place your pre-baked pie crust into a pie dish and pour in your filling mixture. Bake the quiche until the top is golden brown and the center is no longer jiggly. Allow it to cool for a few minutes before digging in.</p>\n<p><strong>3. Make ahead!</strong></p>\n<p>If you’re looking to save time, consider preparing your quiche in advance. Baked quiches freeze very well – up to 2 months! Reheating is easy; just make sure to thaw your quiche overnight and bake at 350°</p>\n<p>There you have it &#8211; a delicious Mother’s Day treat for mom! To learn more about our delicious products, please contact us today!</p>\n"}