{"title":"Brad Pitt Fights for Caged Hens","slug":"brad-pitt-fights-for-caged-hens","excerpt":"<p>Caged hens got some support from actor Brad Pitt recently. The movie megastar, who has starred in films such as Seven, Moneyball, and Ocean’s 11, wrote a scathing letter to big-box warehouse store back in July, urging them to make good on their promise to do away with eggs that come from caged hens. Pitt’s&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_chicken.jpg","image":{"src":"/images/rsz_chicken.jpg","alt":""},"date":"2015-09-17T11:07:20","author":"Chino Valley Ranchers","content":"<p>Caged hens got some support from actor Brad Pitt recently. The movie megastar, who has starred in films such as <em>Seven</em>, <em>Moneyball</em>, and <em>Ocean’s 11</em>, wrote a scathing letter to big-box warehouse store back in July, urging them to make good on their promise to do away with eggs that come from caged hens. Pitt’s letter raises awareness on the issue of caged hens, animal cruelty, and the importance of buying organic eggs.<!--more--></p>\n<p>Pitt reminded Costco that “nearly a decade ago, Costco indicated that its next step on this issue would be creating a timeline for getting those cages out of your egg supply, and yet today, you appear to have made no progress at all—even as you have set timelines for getting pigs and calves out of cages.” Pitt did note that he found Costco’s integrity on a range of issues to be admirable, but did not relent on the caged hen issue.</p>\n<p>He continued, “Imagine cramming five cats or dogs into tiny cages, hundreds of thousands in each shed, for their entire lives. That would warrant cruelty charges, of course. But when the egg industry does it to hens, it’s considered business as usual.” Pitt raises a good point. Shouldn’t hens be treated just as humanely as the typical house pet? Especially considering that studies show that hens raised in a cage-free environment produce healthier organic eggs, therefore making one of the most popular foods for Americans a nutrient-dense one.</p>\n<p>Other celebrities such as Bill Maher and Ryan Gosling have also weighed in on the debate. “When Brad Pitt, Ryan Gosling, and Bill Maher all weigh in to say that cages are horribly abusive of animals and should be banned, it’s time for Costco to listen,” said Bruce Friedrich, policy director of Farm Sanctuary, a nonprofit based in Watkins Glen, New York.</p>\n<p>At Chino Valley Ranchers, we couldn’t agree more with Brad Pitt and the other thousands of Americans who are demanding that their eggs come from healthy, cage-free hens. If you’re not sure how to help, you can start by purchasing only cage-free, organic eggs. Costco noted that its sales of organic and cage-free eggs have increased twentyfold throughout the last nine years. That speaks volumes! Purchasing your organic eggs from small farms such as Chino Valley Ranchers helps support the cage-free egg movement. We are so thankful for our loyal customers!</p>\n"}