{"title":"Celebrate Valentine’s Day with this Heart-Shaped Fried Egg Recipe","slug":"celebrate-valentines-day-with-this-heart-shaped-fried-egg-recipe","excerpt":"<p>Valentine’s Day is a day of celebrating love and friendship. Since eggs are so healthy and delicious, what better way than to show your love than with heart-shaped eggs for breakfast? We at Chino Valley Ranchers are happy to share a delicious heart-shaped fried egg recipe. Try it for yourself and let us know what&#8230;</p>\n","keywords":["best eggs","Best Organic Eggs","cage-free eggs","cage-free organic eggs","Chino Valley Ranchers","egg recipe","freshest eggs","organic egg producers","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/02/2768022494_d36dc91f52_b.jpg","image":{"src":"/images/2768022494_d36dc91f52_b.jpg","alt":""},"date":"2017-02-01T10:28:35","author":"Chino Valley Ranchers","content":"<p>Valentine’s Day is a day of celebrating love and friendship. Since eggs are so healthy and delicious, what better way than to show your love than with heart-shaped eggs for breakfast? We at Chino Valley Ranchers are happy to share a delicious heart-shaped fried egg recipe. Try it for yourself and let us know what you think!<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Finely chopped carrots</li>\n<li>Finely chopped green onion</li>\n<li>Vegetable oil</li>\n<li>Sharp knife</li>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<p><strong>1. Prepare your egg mixture.<br />\n</strong>Break the eggs and mix finely chopped carrots and green onions together in a mixing bowl. Blend them using a hand blender or a whisk. Add salt and pepper for additional flavor.</p>\n<p><strong>2. Prepare your nonstick pan.</strong></p>\n<p>Grease a nonstick pan with a small amount of vegetable oil. Allow this to heat before adding the egg mixture.</p>\n<p><strong>3. Fry your eggs.</strong></p>\n<p>Pour a portion of the mixture onto the pan and fry it. Start to roll the mixture into a cylinder when one side is heated.</p>\n<p><strong>4. Create a rolled omelet.</strong></p>\n<p>Pour another portion of the mixture that’s of equal measure onto the pan as well, carefully not pouring it on the previous portion that is becoming an omelet. As the new portion cooks, add that to the rolled omelet. Repeat this process until there is not more egg mixture.</p>\n<p><strong>5. Create a heart-shape.</strong></p>\n<p>Allow this rolled omelet to cool for about five minutes, and then begin cutting it in equal-sized portions. With these slices of the rolled omelet, cut each piece diagonally and put them together to form a heart-shape.</p>\n<p><strong>6. Fry your eggs (again)</strong>.</p>\n<p>Carefully put the heart-shaped egg in the previously greased frying pan, and fry the pieces until they turn golden brown. When one side is done, flip it so the other side can cook.</p>\n<p>And just like that, you have a delicious Valentine’s Day treat to give your loved ones! When purchasing your eggs, be sure to buy from Chino Valley Ranchers, as we produce high quality eggs that taste great. To learn more about our products, contact us today!</p>\n"}