{"title":"Chino Valley Ranchers Recognized by Assembly Member Eloise Gomez-Reyes","slug":"chino-valley-ranchers-recognized-by-assembly-member-eloise-gomez-reyes","image":{"src":"/images/CVR_Eloise Gomez-Reyes.png"},"date":1680279693187,"author":"Chino Valley Ranchers","content":"<p>Assembly Member Eloise Gomez-Reyes has recently honored Chris Nichols and his mother, Kathy Nichols, from Chino Valley Ranchers for their philanthropic efforts in supporting the Immaculate Conception Church Dinner Hour Ministry. Maha Rizvi, a Representative from the Assembly Member's office, presented the recognition to Chris Nichols and Kathy Nichols at their Chino Valley Ranchers facility in Colton on Thursday, March 16.</p><p></p><p>The presentation was attended by Eloy Sanchez, Coordinator of the Dinner Hour Ministry, Father Max from Immaculate Conception Church, Dinner Hour Ministry leaders, and several volunteers. The purpose of the presentation was to formally recognize the Nichols family's generous donation of 33,300 eggs over the last year to the Dinner Hour Program, which has been the main component of the program's food distribution. Father Max stated, \"This generous donation is the main part of our Dinner Hour Ministry, and without it, the program would not be the same.\" Eloy Sanchez added, \"Their donation of eggs on a weekly basis means a lot to people in need. People gather 3 hours early to be able to get this valuable food commodity.\"<br></p><p>Chris Nichols and his family have operated Chino Valley Ranchers for many years, and their industrial giant has been a mainstay in North Colton and the surrounding region. The family's commitment to innovative and humane farming practices, including the cage-free approach to raising chickens, has made them a leader in the industry. Chris Nichols and Kathy Nichols are often busy running the day-to-day operation of the ranch, with their goal being to offer the best in egg products that are always available at local grocery stores.<br></p><p>Chino Valley Ranchers has also supported other community organizations, including little league baseball, the City of Colton Birthday Celebration, and the Colton Firefighter's pancake breakfast. Assembly Member Eloise Gomez-Reyes has been a strong advocate for the Colton community, and she recognized the Nichols family for their contribution to the Dinner Hour Program. When asked about their future plans, Chris Nichols said, \"We'll continue to expand the product line of our company, as well as maintain our commitment to supporting local community organizations.\"</p><p></p><p>The recognition of the Nichols family's generosity and community outreach is well-deserved, and their commitment to sustainable farming practices and community support continues to be a driving force in the Colton community.</p><p></p><p><em>Photo Credit: Dr. Luis González</em></p>"}