{"title":"Chino Valley Ranchers Organic Eggs Featured in a Ravioli Recipe by Chef Joe Sasto","slug":"chino-valley-ranchers-organic-eggs-featured-in-a-ravioli-recipe-by-chef-joe-sasto","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2019/11/Screen-Shot-2019-11-04-at-4.40.08-PM.png","image":{"src":"/images/Screen-Shot-2019-11-04-at-4.40.08-PM.png","alt":""},"date":"2019-11-05T00:41:14","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">Chino Valley Ranchers organic eggs were recently featured in an Instagram post by Chef Joe Sasto on his profile @chef.joe.sasto, which has over 35,000 followers. </span><!--more--></p>\n<p><span style=\"font-weight: 400;\">In the Instagram post, Sasto writes</span><span style=\"font-weight: 400;\">, </span><span style=\"font-weight: 400;\">“You are only as good as the ingredients you use.” Sasto has experience working as a chef at high-end restaurants in San Francisco like Lazy Bear, RN74 and Quince. Sasto is recognized for his strengths in handmade pasta and authentic cuisine.</span></p>\n<p><span style=\"font-weight: 400;\">Speaking of the Instagram post, Vice President of Chino Valley Ranchers Chris Nichols says, “I can only imagine that creating fine dishes requires only the finest ingredients. We are thrilled that Chef Joe Sasto has chosen Chino Valley Ranchers eggs for his hand-crafted ravioli recipe.”</span></p>\n<p><span style=\"font-weight: 400;\">Chino Valley Ranchers hens are fed organic feed and have access to fresh air and sunlight on a daily basis, weather permitting. In addition, hens do not consume antibiotics, growth hormones, or any animal by-products. Chino Valley Ranchers is committed to organic and the highest level of quality, ensuring the nutritious value of each egg produced.</span></p>\n<p><span style=\"font-weight: 400;\">On Sasto’s website, visitors can learn more about his background and interests. </span><span style=\"font-weight: 400;\">“</span><span style=\"font-weight: 400;\">When not in the kitchen, he can be found foraging along the nearby coast, rolling out pasta ‘fatto-a-mano’, fine tuning his moustache, or sharpening his winning skills on such competition shows.”</span></p>\n<p><span style=\"font-weight: 400;\">To view the full Instagram post, visit </span><a href=\"https://www.instagram.com/p/B1PubsSBsHj/\"><span style=\"font-weight: 400;\">https://www.instagram.com/p/B1PubsSBsHj/</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">To learn more about Joe Sasto, visit </span><a href=\"https://www.joesasto.com\"><span style=\"font-weight: 400;\">https://www.joesasto.com</span></a><span style=\"font-weight: 400;\"> .</span></p>\n"}