{"title":"Chino Valley Ranchers Introduces a Half Dozen Soy-Free and Pastured Eggs","slug":"chino-valley-ranchers-introduces-a-half-dozen-soy-free-and-pastured-eggs","excerpt":"<p>Chino Valley Ranchers is egg-cited to announce our latest product: Cartons of a half dozen soy-free and pastured eggs are now available in stores! That’s two egg-cellent options for our loyal customers! These new product offerings are perfect for single folks, small families, or those wanting to try different types of specialized eggs.</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_dollarphotoclub_80475349.jpg","image":{"src":"/images/rsz_dollarphotoclub_80475349.jpg","alt":""},"date":"2015-07-20T10:21:33","author":"Chino Valley Ranchers","content":"<p>Chino Valley Ranchers is <em>egg-cited</em> to announce our latest product: Cartons of a half dozen soy-free <em>and</em> pastured eggs are now available in stores! That’s two <em>egg-cellent</em> options for our loyal customers! These new product offerings are perfect for single folks, small families, or those wanting to try different types of specialized eggs.<!--more--></p>\n<p>Why is this so exciting? Because pastured eggs and soy-free eggs offer many benefits to consumers. Pasture-raised hens are offered 108 square feet of outdoor living space and they’re fed an all-organic diet. For more information, you can visit our <a href=\"http://chinovalleyranchers.com/blog/chino-valley-ranchers-an-exciting-new-product-pastured-eggs/\">blog post</a> about it.</p>\n<p>Our soy-free organic eggs come from hens with a specially formulated diet that is free from soy. These eggs are the perfect solution for people who want to avoid soy or who have a soy allergy. Under the close direction of our nutritionist, we hand selected grains and seeds that replace the nutritional content of the soy. In addition, we added flaxseed to boost the omega-3 fatty acid content to 225 mg per egg. The best part is that these eggs still taste just as great as our other organic omega-3 eggs! To verify that our soy-free eggs are indeed soy free, we hired a third party laboratory to test them. The results were conclusive: our eggs are indeed soy free. (For a copy of the letter sent to us by the laboratory, visit our <a href=\"http://www.chinovalleyranchers.com/our_eggs_soy_free_organic.php\">soy-free egg page</a>. The link is at the end of the paragraph).</p>\n<p>We are a small but mighty family-run farm and have been for 3 generations. We believe that happy, healthy hens lay nutrient-dense eggs and so we only feed them the purest feed and allow them plenty of space to roam. If you have any questions about our pastured or soy-free eggs, please contact Chino Valley Ranchers today.</p>\n"}