{"title":"Chino Valley Rancher’s Egg Dish Terminology Guide","slug":"chino-valley-ranchers-egg-dish-terminology-guide","image":{"src":"/images/5.jpeg"},"date":1657053938769,"author":"Chino Valley Ranchers","content":"<p>There are so many ways to prepare eggs, the terminology in recipes can seem overwhelming. We’ve created a simple list of egg terms and their definitions to make things easier for you next time you’re searching for egg recipes.</p><p></p><p><strong>Scrambled eggs</strong></p><p>Beat egg yolks and whites together and cook them in a skillet or pan, and you’ve got scrambled eggs.<br></p><p><strong>Sunny side up eggs</strong></p><p>If you slow cook eggs in a frying pan until the egg white is set but the yolk is still runny, then you’ve got sunny side up eggs. The runny orange yolk resembles the sun.</p><p></p><p><strong>Basted eggs</strong></p><p>If you’d like basted eggs, then spoon warm butter or oil over the top of the yolk to cook it.</p><p></p><p><strong>Poached eggs</strong></p><p>Cook an egg without its shell in simmering water and the egg white will wrap around the yolk as it cooks to create a soft center.</p><p></p><p><strong>Hard boiled eggs</strong></p><p>Cook the entire egg, in its shell, in boiling water and both the yolk and egg white will be set.</p><p></p><p><strong>Over easy eggs</strong></p><p>An egg is cooked in a frying pan until the white is set, and then flipped over to cook the yolk side.</p><p><br><strong>Over hard eggs</strong></p><p>Cooked the same way as over easy eggs, over hard eggs have a fully cooked yolk, rather than a runny one.</p><p><br><strong>Fried eggs</strong></p><p>Use butter or grease to cook fried eggs. Make them over easy, over medium, over hard, or sunny side up.</p><p><br><strong>Baked eggs</strong></p><p>Baked eggs are baked in a flat dish or a muffin pan and then topped with cheese, herbs, or vegetables.</p><p><br><strong>Deviled eggs</strong></p><p>To make deviled eggs, remove the cooked yolk from a hard boiled egg and mix the yolk with mayonnaise and mustard. Then, scoop the yolk mixture back into the egg white.</p><p><br><strong>Frittata</strong></p><p>This baked dish is made with eggs, herbs, meat, cheese, and vegetables. Enjoy a frittata from breakfast or brunch.</p><p><br><strong>Pickled eggs</strong></p><p>Hard boiled eggs are pickled in a mixture of vinegar and pickling spice or brine.</p><p><br><strong>Scotch eggs</strong></p><p>Soft boil eggs and wrap them in sausage and breadcrumbs, and then deep fry or bake them to create scotch eggs.</p><p><br><strong>Baked egg custard</strong></p><p>Baked egg custard is made with vanilla, sugar, milk, and nutmeg.</p><p><br><strong>Frozen egg custard</strong></p><p>Create this sweet, frozen egg dish with egg yolks for a creamy texture.</p>"}