{"title":"Chino Valley Ranchers Eggs A Social Media Sensation in Egg Salad Sandwich","slug":"chino-valley-ranchers-eggs-a-social-media-sensation-in-egg-salad-sandwich","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/12/CVR_Blog_Thumbnail-1.png","image":{"src":"/images/CVR_Blog_Thumbnail-1.png","alt":""},"date":"2019-03-26T20:17:32","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">Using Chino Valley Ranchers eggs, Japanese restaurant Konbi has created an Egg Salad sandwich that has earned praise from </span><i><span style=\"font-weight: 400;\">The New York Times</span></i><span style=\"font-weight: 400;\"> California restaurant critic Tejal Rao and </span><i><span style=\"font-weight: 400;\">Air Jordan</span></i><span style=\"font-weight: 400;\"> food podcast Writer and Host Jordan Okun. Also reviewed by the </span><i><span style=\"font-weight: 400;\">Los Angeles Times </span></i><span style=\"font-weight: 400;\">and</span><i><span style=\"font-weight: 400;\"> Grub Street</span></i><span style=\"font-weight: 400;\">, Konbi’s Egg Salad sandwich has gained attention for its Instagram-worthy visual appeal and has been called a “culinary magic trick.” </span><!--more--></p>\n<p><span style=\"font-weight: 400;\">The restaurant’s chefs and co-owners Nick Montgomery and Akira Akuto considered more than 15 egg farms before deciding to use Chino Valley Ranchers eggs in their Japanese-inspired egg sandwich. In a </span><i><span style=\"font-weight: 400;\">Grub Street</span></i><span style=\"font-weight: 400;\"> article, Akuto is quoted saying, “The yolk in the middle is a textural counterpoint to the salad,” that also creates a visually-arresting color contrast. </span></p>\n<p><span style=\"font-weight: 400;\">Montgomery and Akuto have said none of their menu items were designed for Instagram; however, the bright orange color of the egg yolk has turned the Egg Salad sandwich into a social media success.</span></p>\n<p><span style=\"font-weight: 400;\">“Our eggs, once cooked, are not only visually appealing — they’re healthy,” says Chris Nichols, Vice President of Chino Valley Ranchers. “The bright yolk color is a natural result, or outward sign, of our dedication to humane and quality feed practices.” </span></p>\n<p><span style=\"font-weight: 400;\">Chino Valley Ranchers eggs’ bright yolk color is achieved by a precision feed formulation that has been optimized over the course of many decades. Depending on the egg variety, organic feed formulations can include corn, soybean, alfalfa, flax seed, limestone meal and other select seeds. Konbi’s decision to use Chino Valley Ranchers eggs in its Egg Salad sandwich further solidifies Chino Valley Ranchers’ reputation as Southern California’s most trusted egg grower. </span></p>\n<p><i><span style=\"font-weight: 400;\">Read the </span></i><a href=\"https://www.latimes.com/food/dailydish/la-fo-re-konbi-20181119-story.html\"><i><span style=\"font-weight: 400;\">Los Angeles Times</span></i></a><i><span style=\"font-weight: 400;\"> review or </span></i><a href=\"https://www.nytimes.com/2019/01/28/dining/konbi-egg-salad-sandwich-instagram.html\"><i><span style=\"font-weight: 400;\">The New York Times</span></i></a><i><span style=\"font-weight: 400;\"> review for more information on how the sandwich is constructed.</span></i></p>\n<p><b>Konbi</b><span style=\"font-weight: 400;\"> is located in Echo Park and serves Japanese-style sandwiches, vegetable dishes, tea, coffee, and pastries. </span></p>\n"}