{"title":"Classic Key Lime Pie Recipe","slug":"classic-key-lime-pie-recipe","image":{"src":"/images/key-lime-pie.png","alt":"Key Lime Pie"},"date":1688666699643,"author":"Chino Valley Ranchers","content":"<p>This homemade key lime pie recipe from our friend <a href=\"\" title=\"\">Breanna @ Knead The Recipe</a> is the perfect balance of creamy, tart and sweet! The homemade graham cracker crust combined with the silky smooth key lime filling, will transport you straight to the Florida Keys after your first bite! See below!</p><p></p><h2 class=\"wp-block-heading\">Key Lime Pie Origin</h2><p class=\"has-large-font-size\">Key lime pie is the state pie of Florida, and rightfully so! This classic recipe dates back to the 1800’s in Key West Florida. This area did not get fresh milk deliveries and were not accustomed to refrigeration until the 1930’s. This is why condensed milk is a key ingredient in traditional key lime pie recipes. Key limes are another staple ingredient which are smaller and less tart than regular limes which make them perfect for this recipe! I’ve created an easy key lime pie recipe that has classic flavors but also a unique twist to give it an extra creamy consistency! An authentic key lime pie recipe uses egg yolks only but I find that using whole eggs gives this pie a lighter texture and reduces food waste! How many of us actually ever use the egg whites after we separate them for a recipe? I am guilty of forgetting about them!</p><p></p><p><img src=\"https://i0.wp.com/www.kneadtherecipe.com/wp-content/uploads/2023/05/IMG_9137.png?resize=812%2C1083&amp;ssl=1\" alt=\"Inside of key lime pie\"></p><h2 class=\"wp-block-heading\">Ingredients for Classic Key Lime Pie Recipe</h2><ul><li><p><strong>Whole Eggs:&nbsp;</strong>I use&nbsp;<a href=\"\" title=\"\"><strong>Chino Valley Ranchers Liquid Whole Eggs</strong></a>&nbsp;to make this pie extra rich and creamy. The eggs come from pasture raised chickens who have 108 square feet of land to roam in! They are perfectly convenient for making this pie recipe in a time crunch because you don’t even need to crack any eggs! While authentic key lime pie usually uses only yolks, I find that incorporating the whites and the yolks together creates a beautifully rich flavor that also has a light texture too!</p></li><li><p><img src=\"https://i0.wp.com/www.kneadtherecipe.com/wp-content/uploads/2023/05/IMG_9071.png?resize=767%2C1073&amp;ssl=1\" alt=\"Pour shot of liquid whole eggs\"><strong>Key limes</strong>: I recommend using fresh key limes for this recipe! Bottled key lime juice will not give you as good of a flavor! I know it takes a while to squeeze these tiny limes, but the end result is worth the extra effort!</p></li></ul><p></p><ul><li><p><strong>Sweetened condensed milk:&nbsp;</strong>We’ll be using 14 oz cans of sweetened condensed milk for that classic key lime pie texture and to help sweeten the filling!</p></li></ul><p></p><ul><li><p><strong>Graham cracker crumbs:</strong>&nbsp;I prefer using graham cracker to make my pie crust but feel free to use whatever crackers you have on hand! Making this buttery graham cracker crust from scratch will really take your pie to the next level!</p></li></ul><p></p><ul><li><p><strong>Butter:</strong>&nbsp;To help bind the crust together and add richness to the recipe.</p></li></ul><p></p><ul><li><p><strong>Granulated sugar:&nbsp;</strong>I used a small amount for the homemade pie crust tp help balance the tartness from the pie filling.</p></li></ul><p></p><ul><li><p><strong>Fresh whipped cream:</strong>&nbsp;This is a great addition to your key lime pie and it makes this dessert even more creamy and refreshing! All you need is heavy cream and some powdered sugar!</p></li></ul><p></p><ul><li><p><strong>Vanilla extract:&nbsp;</strong>This is totally optional but I believe the vanilla adds a nice aroma to this pie!</p></li></ul><p><img src=\"https://i0.wp.com/www.kneadtherecipe.com/wp-content/uploads/2023/05/IMG_8954-2.png?resize=768%2C1024&amp;ssl=1\" alt=\"key lime pie ingrdients\" width=\"768\" height=\"1024\"></p><h2 class=\"wp-block-heading\">How to make Key Lime Pie</h2><ol><li><p><strong>Make the graham cracker crust:</strong></p><ul><li><p>In a blender or food processor, pulse the crackers until they turn into fine crumbs. Add the melted butter and sugar and pulse a few more times until well combined.</p></li></ul></li><li><p><strong>Bake your crust:</strong></p><ul><li><p>Press the crust into your 9-inch pie pan and bake at 350 F for 8-10 minutes. This helps the pie crust set before adding the filling.</p></li></ul></li><li><p><strong>Prepare your pie filling:</strong></p><ul><li><p>In a large bowl, whisk the eggs, sweetened condensed milk, vanilla extract, and key lime juice and zest until the mixture becomes thick and well combined.</p></li></ul></li><li><p><strong>Bake the pie:</strong></p><ul><li><p>Bake pie for 15 minutes at 350 F. You know when it’s done when you touch the edge and it feels set without any residue getting on your finger. When you shake the pan, the middle should be slightly jiggly. It will set completely as it cools.</p></li></ul></li><li><p><strong>Let cool then chill before enjoying:</strong></p><ul><li><p>For best results, let the pie cool completely before storing in the fridge for at least 2 hours. Chilling longer and overnight helps deepen the flavors of this pie even more! Top pie with whipped cream, extra lime zest and lime slices and serve!</p></li></ul></li></ol><p><img src=\"https://i0.wp.com/www.kneadtherecipe.com/wp-content/uploads/2023/05/Untitled-design-1.png?resize=1024%2C819&amp;ssl=1\" alt=\"Pouring filling into pie crust\" width=\"1024\" height=\"819\"></p><h3 class=\"wp-block-heading\">Substitutions for Classic Key Lime Pie</h3><ul><li><p>Swap the graham crackers for Nilla wafers, biscoff cookies, or chocolate graham crackers!</p></li></ul><p></p><ul><li><p>Instead of whipped cream, try a meringue topping or add your favorite fruit garnish!</p></li></ul><p></p><ul><li><p>Swap liquid whole eggs for regular eggs. You will need 3 for this recipe!</p></li></ul><p></p><ul><li><p>Pick up a ready-made pie crust from your local grocery store if you are in a time crunch!</p></li></ul><p></p><ul><li><p>Use brown sugar instead of white for a warmer flavor!</p></li></ul><p><img src=\"https://i0.wp.com/www.kneadtherecipe.com/wp-content/uploads/2023/05/key-lime-egg-close.png?resize=768%2C1024&amp;ssl=1\" alt=\"Key Lime Pie with Whole Eggs\" width=\"768\" height=\"1024\"></p><h3 class=\"wp-block-heading\">How long does Key Lime Pie last?</h3><p class=\"has-large-font-size\">You can keep this pie in your refrigerator for up to 4 days after you make it. Just warning you, there might not be leftovers from this one!&nbsp;</p><h3 class=\"wp-block-heading\">How to freeze Key Lime Pie</h3><p class=\"has-large-font-size\">You can make this pie in advance then freeze it after cooled. I would recommend adding whipped cream after it is out of the freezer! Freeze for at least six hours or up to 24 hours. Let the pie thaw before serving and enjoy in the same day for the best texture!</p><p><img src=\"https://i0.wp.com/www.kneadtherecipe.com/wp-content/uploads/2023/05/Key-Lime-SLice.png?resize=768%2C1024&amp;ssl=1\" alt=\"Eating a Key Lime Pie\" width=\"768\" height=\"1024\"><br></p><h3 class=\"wprm-recipe-header wprm-recipe-ingredients-header wprm-block-text-bold wprm-align-left wprm-header-decoration-none\">INGREDIENTS</h3><h4 class=\"wprm-recipe-group-name wprm-recipe-ingredient-group-name wprm-block-text-bold\">KEY LIME PIE FILLING</h4><ul><li><p>9&nbsp;tbsp&nbsp;Chino Valley Rancher's Liquid Whole Eggs&nbsp;(or 3 whole eggs)</p></li><li><p>28&nbsp;oz&nbsp;sweetened condensed milk</p></li><li><p>2&nbsp;tbsp&nbsp;key lime zest</p></li><li><p>2/3&nbsp;cup&nbsp;key lime juice&nbsp;freshly squeezed</p></li><li><p>1/2&nbsp;tbsp&nbsp;vanilla extract&nbsp;optional</p></li></ul><h4 class=\"wprm-recipe-group-name wprm-recipe-ingredient-group-name wprm-block-text-bold\">PIE CRUST</h4><ul><li><p>10-12&nbsp;sheets&nbsp;graham crackers&nbsp;(depending on how thick or thin you like your crust!)</p></li><li><p>2&nbsp;tbsp&nbsp;granulated sugar</p></li><li><p>1/3&nbsp;cup&nbsp;melted butter</p></li></ul><h3 class=\"wprm-recipe-header wprm-recipe-instructions-header wprm-block-text-bold wprm-align-left wprm-header-decoration-none\">INSTRUCTIONS</h3><ul><li><p><strong>Make the graham cracker crust:&nbsp;</strong>In a blender or food processor, pulse the crackers until they turn into fine crumbs. Add the melted butter and sugar and pulse a few more times until well combined.10-12 sheets graham crackers2 tbsp granulated sugar1/3 cup melted butter</p></li><li><p><strong>Bake your crust:&nbsp;</strong>Press the crust into your pie dish and bake at 350 F for 8-10 minutes. This helps the pie crust set before adding the filling.</p></li><li><p><strong>Prepare your pie filling:&nbsp;</strong>Whisk the eggs, sweetened condensed milk, vanilla extract, and key lime juice and zest until the mixture becomes thick and well combined.9 tbsp Chino Valley Rancher's liquid whole eggs28 oz sweetened condensed milk2 tbsp key lime zest2/3 cup key lime juice1/2 tbsp vanilla extract</p></li><li><p><strong>Bake the pie:&nbsp;</strong>Bake the pie for 15 minutes at 350 F. You know when it's done when you touch the edge and it feels set without any residue getting on your finger. When you shake the pan, the middle should be slightly jiggly. It will set completely as it cools.</p></li><li><p><strong>Let cool then chill before enjoying:&nbsp;</strong>Let the pie cool completely before storing int he fridge for at least 2 hours. Chilling longer and overnight helps deepen the flavors of this pie even more! Garnish with whipped cream and lime slices and serve!<br></p></li></ul>"}