{"title":"Classic Key Lime Pie Recipe","slug":"classic-key-lime-pie-recipe","image":{"src":"/images/key-lime-pie.png","alt":"Key Lime Pie"},"date":1688665628769,"author":"Chino Valley Ranchers","content":"<p>This homemade key lime pie recipe from our friend <a href=\"https://www.instagram.com/kneadtherecipe/?utm_source=ig_embed&amp;ig_rid=4fe93bc9-bb3a-4fc0-a57d-5b9c149233ab\">Breanna @ Knead The Recipe</a> is the perfect balance of creamy, tart and sweet! The homemade graham cracker crust combined with the silky smooth key lime filling, will transport you straight to the Florida Keys after your first bite! See below!</p><p></p><h2 class=\"wp-block-heading\">Key Lime Pie Origin</h2><p class=\"has-large-font-size\">Key lime pie is the state pie of Florida, and rightfully so! This classic recipe dates back to the 1800’s in Key West Florida. This area did not get fresh milk deliveries and were not accustomed to refrigeration until the 1930’s. This is why condensed milk is a key ingredient in traditional key lime pie recipes. Key limes are another staple ingredient which are smaller and less tart than regular limes which make them perfect for this recipe! I’ve created an easy key lime pie recipe that has classic flavors but also a unique twist to give it an extra creamy consistency! An authentic key lime pie recipe uses egg yolks only but I find that using whole eggs gives this pie a lighter texture and reduces food waste! How many of us actually ever use the egg whites after we separate them for a recipe? I am guilty of forgetting about them!</p><p></p><h2 class=\"wp-block-heading\">Ingredients for Classic Key Lime Pie Recipe</h2><ul><li><p><strong>Whole Eggs:&nbsp;</strong>I use&nbsp;<a href=\"\" title=\"\">Chino Valley Ranchers Liquid Whole Eggs</a>&nbsp;to make this pie extra rich and creamy. The eggs come from pasture raised chickens who have 108 square feet of land to roam in! They are perfectly convenient for making this pie recipe in a time crunch because you don’t even need to crack any eggs! While authentic key lime pie usually uses only yolks, I find that incorporating the whites and the yolks together creates a beautifully rich flavor that also has a light texture too!</p></li></ul>"}