{"title":"Crack into the History of Chino Valley Ranchers","slug":"crack-into-the-history-of-chino-valley-ranchers","excerpt":"<p>For almost 70 years, Chino Valley Ranchers has been a family-owned company dedicated to bringing the freshest and best-tasting eggs to your table. For three generations now, our ranches have expanded to house thousands of birds, with our headquarters being close to 90 acres in size. So how did we get here?</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","egg producer","eggs","organic eggs","quality eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/08/ChinoValleyRanchers-61.jpg","image":{"src":"/images/ChinoValleyRanchers-61.jpg","alt":""},"date":"2017-08-10T17:43:03","author":"Chino Valley Ranchers","content":"<p>For almost 70 years, Chino Valley Ranchers has been a family-owned company dedicated to bringing the freshest and best-tasting eggs to your table. For three generations now, our ranches have expanded to house thousands of birds, with our headquarters being close to 90 acres in size. So how did we get here?<!--more--></p>\n<p>From the very beginning, consistent quality has been our hallmark and egg ranching has been our sole focus. In the early 1950s, Chino Valley Ranchers’ Founder Charles Burton Nichols worked out an arrangement with Southern California farmers to sell their fresh eggs to local grocery stores. He used the family truck for deliveries, which eventually sparked the idea of establishing a farm. In 1959, the Chino Valley Rancher’s business was born.</p>\n<p><strong>Innovating the Egg Industry</strong></p>\n<p>At the start of the company, Charles and his family were constantly seeking out opportunities to grow the business. Many of these initiatives revolved around the quality of care for the chickens. One of these steps involved taking the chickens out of their cages, allowing the birds to walk around on their own. This marked the early beginnings of the “cage free” approach to raising chickens, which has become a standard in humane treatment within the industry. After all, happy and healthy hens are productive hens!</p>\n<p>As the family business grew and chicken farming methods were further refined, the request for organic eggs began to popularize. The challenge was to find feed suppliers with organic grains, which was a rare product in those days. However, our company was producing organic eggs regularly – even prior to the official start of the current USDA Organic program. Today, we not only make our own organic feed, but we operate Southern California’s only organic feed mill for poultry.</p>\n<p><strong>Continued Family Growth</strong></p>\n<p>Here at Chino Valley Ranchers, our family extends to more than just our kin. Our employees, staff members, and surrounding communities have helped shape our culture and make a difference in our company.</p>\n<p>But we also couldn’t do what we do without our feathered friends. That’s why we ensure that our chickens are happy by providing free roaming environments with access to sunlight, premium grain feeds and plenty of fresh air and water. Through these commitments, our collective family effort helps provide the highest quality eggs possible across many generations to come.</p>\n<p>For more information about our company and products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact</a> Chino Valley Ranchers today!</p>\n"}