{"title":"Drizzle It Up: Oils that Add Flavor to Your Eggs","slug":"drizzle-it-up-oils-that-add-flavor-to-your-eggs","excerpt":"<p>At Chino Valley Ranchers, we don’t discriminate when it comes to how we enjoy our eggs. But if you are frying them, we believe there are certain oils that make our eggs taste the best. We’re mostly talking about oils with a relatively high smoke point—that is, oils that can get pretty hot without burning—and&#8230;</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","egg recipes","free range eggs","recipes"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_kitchen_egg.jpg","image":{"src":"/images/rsz_kitchen_egg.jpg","alt":""},"date":"2018-05-18T16:41:10","author":"Chino Valley Ranchers","content":"<p>At Chino Valley Ranchers, we don’t discriminate when it comes to how we enjoy our eggs. But if you are frying them, we believe there are certain oils that make our eggs taste the best. We’re mostly talking about oils with a relatively high smoke point—that is, oils that can get pretty hot without burning—and a flavor that goes happily with our eggs. So, which oils are they? Before you fry, read on.<!--more--></p>\n<p>1. Olive Oil<br />\nFlavorful while still being fairly neutral, olive oil performs well at higher heats. This means that if you’re looking for a crispy-edged fried egg, olive oil is your friend indeed. Be fairly generous with the oil, get your pan extremely hot, and crack open your egg; if it’s sizzling when it hits the pan, you’ve done it right.</p>\n<p><strong>2. Butter</strong></p>\n<p>Unlike olive oil, butter can’t tolerate high heat very well due to the dairy content. But, when used in cooking, butter serves to maximize flavor and makes for a low and slow fry. Plus, who doesn’t love the smell of warm butter on a skillet?</p>\n<p><strong>3. Coconut oil</strong></p>\n<p>If you want a nice, nutty flavor, coconut oil is your go-to cooking oil. It’s good with high heat – even better than olive oil – and it’s one of the more nutritious oils. Health-conscious folks, rejoice!</p>\n<p><strong>4. Bacon fat</strong></p>\n<p>It’s no surprise that bacon and eggs go well with each other, so if you happen to be cooking some strips of bacon, make sure to reuse the grease! Bacon fat tolerates heat very well, so don’t be afraid to add some heat.</p>\n<p>Whether you prefer crispy or soft, Chino Valley Ranchers eggs taste great no matter what oil is used. To learn more about our products and where you can buy Chino Valley Ranchers eggs, visit our <a href=\"http://www.chinovalleyranchers.com/store-locator/\">store locator</a> or <a href=\"http://www.chinovalleyranchers.com/chinovalleyranchers/store-locator/\">contact us</a> today!</p>\n<p>&nbsp;</p>\n"}