{"title":"Dunkin’ Donuts Commits to Cage-Free Eggs","slug":"dunkin-donuts-commits-to-cage-free-eggs","excerpt":"<p>Falling in line behind chain restaurants like McDonald’s, Burger King, and Starbucks, Dunkin’ Donuts announced in December their plans to go cage-free over the next 10 years.</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/08/eggs.jpg","image":{"src":"/images/eggs.jpg","alt":""},"date":"2016-01-11T11:59:20","author":"Chino Valley Ranchers","content":"<p>Falling in line behind chain restaurants like McDonald’s, Burger King, and Starbucks, Dunkin’ Donuts announced in December their plans to go cage-free over the next 10 years.<!--more--></p>\n<p>The Massachusetts-based chain’s senior director of corporate social responsibility Christine Riley said in a statement, “We have a responsibility to ensure the humane treatment of animals, an issue we know is also important to both our franchisee community and our loyal guests.”</p>\n<p>According to the Humane Society of the United States, the switch will affect about 1.4 <em>million</em> egg-laying hens per year.</p>\n<p>Josh Balk, who is the senior food policy director for the Humane Society, told the <a href=\"http://www.huffingtonpost.com/entry/dunkin-donuts-cage-free-eggs_5665d8a8e4b072e9d1c6ed48\">Huffington Post</a> that though the timeline seems long, it’s still important. Dunkin’ Donuts is “one of the most iconic restaurant brands in the country, and a major user of eggs,” making December’s announcement “a bombshell…felt throughout the egg industry that we’ve reached a tipping point on the issue of caging egg-laying hens.”</p>\n<p>In recent years the web has been abuzz about the living conditions of caged hens. Confined in small cages with several other hens, the birds are crammed together so tightly that they can barely even move, let alone spread their wings. They literally have less space than a sheet of notebook paper. Sometimes their feet or heads get trapped between the bars, making it impossible for them to get food or water. They often die of dehydration, starvation, or disease.</p>\n<p>This is why the recent announcements of companies such as Dunkin’ Donuts, McDonald’s, Burger King, Taco Bell, and Panera is so important. As humans, we have a responsibility to see that the animals that feed us are treated humanely.</p>\n<p>If you have any questions about how the hens at Chino Valley Ranchers are raised (<em>hint: they’re treated like royalty</em>), feel free to contact us. Otherwise, know that your dollars speak. Buy cage-free. It’s for the hens.</p>\n"}