{"title":"Easy-to-Peel Cage-Free Eggs from the Pioneer Woman","slug":"easy-to-peel-cage-free-eggs-from-the-pioneer-woman","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_dollarphotoclub_71714215.jpg","image":{"src":"/images/rsz_dollarphotoclub_71714215.jpg","alt":""},"date":"2015-11-05T10:37:58","author":"Chino Valley Ranchers","content":"<p>Sometimes when cage-free eggs are hard boiled, they’re <em>eggs-tremely</em> difficult to peel. Chunks and pieces of the egg white get stuck to the shell and are removed along with it, which is frustrating. <!--more-->Today we’ll walk you through the best way to peel cage-free eggs, compliments of The Pioneer Woman (<a href=\"http://www.thepioneerwoman.com\">www.thepioneerwoman.com</a>).</p>\n<p>For easy-to-peel cage-free eggs:</p>\n<ol>\n<li>Give ‘em a hot start. This just means that the eggs should be added to the water once it’s already hot. Many people think that a cold start is the way to go, but a hot start provides for an easier peel down the road.</li>\n<li>Bring water to a boil, and then carefully lower the eggs into the water. You can use a wire basket, a spoon, whatever works.</li>\n<li>Once all eggs are immersed in water, lower the heat so that the water is gently simmering. Cook for roughly 13 minutes.</li>\n<li>When they’re done, drop them into an ice bath for 5 minutes. This is essential.</li>\n<li>After 5 minutes, the eggs should be cool to the touch. If they’re not, give them a few more minutes, and then tap them several times against the countertop. Make sure to gently crack the entire shell.</li>\n<li>Peel away. This method will give you large pieces of shell that slide right off.</li>\n<li>Eggs should be stored in the refrigerator for up to 5 days after peeling.</li>\n<li>Enjoy them with salt and pepper, in an egg salad, or on top of a green salad. Hard-boiled cage-free eggs are so versatile!</li>\n</ol>\n<p>At Chino Valley Ranchers, we take pride in our cage-free eggs. We believe that the animals from which we get our food should be treated humanely, so that’s why our laying hens are raised with the utmost care and respect.</p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/are-cage-free-eggs-safer-than-others/\">Are Cage Free Eggs Safer than Others?</a></p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/sustainable-composting-practices-from-a-cage-free-egg-producer/\">Sustainable Composting Practices from a Cage Free Egg Producer</a></p>\n<p>If you have any questions about our cage-free eggs or our humane harvest practices, contact us today!</p>\n"}