{"title":"Egg News: The 2017 Debate Between Cage-Free and Conventional Eggs","slug":"egg-news-the-2017-debate-between-cage-free-and-conventional-eggs","excerpt":"<p>According to New Food Economy, most consumers aren’t fully aware of the differences between caged and cage-free chickens. Though the word “cage-free” has a sliding-scale meaning, to Chino Valley Ranchers it means one thing: humane treatment of our chickens.</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","conventional eggs","egg farmer","egg products","eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/04/rsz_chinovalleyranchers-125-624x416.jpg","image":{"src":"/images/rsz_chinovalleyranchers-125-624x416.jpg","alt":""},"date":"2017-07-28T20:24:59","author":"Chino Valley Ranchers","content":"<p>According to <a href=\"http://newfoodeconomy.com/egg-prices-record-low-nobodys-buying-cage-free/\">New Food Economy</a>, most consumers aren’t fully aware of the differences between caged and cage-free chickens. Though the word “cage-free” has a sliding-scale meaning, to Chino Valley Ranchers it means one thing: humane treatment of our chickens. <!--more-->We raise our hens to freely roam in sunlight, with access to premium grain feeds and plenty of fresh air and water. We also believe that “cage free” means more than just letting birds out of cages, which is why we raise our birds in smaller flock sizes and never use aviaries. By doing this, we raise happy, healthy birds who provide quality eggs and egg products for our communities.</p>\n<p>The debate between cage-free eggs and conventional eggs has been floating around for many years now. Specifically, it started with the 2015 bird flu outbreak that sparked a nationwide focus on the matter. The bird flu compromised the health of millions of birds and forced farmers around the country to get rid of about <a href=\"https://www.bloomberg.com/news/articles/2017-06-28/bring-on-the-omelets-bigger-flocks-send-egg-price-to-decade-low\">47 million chickens</a>. This turn of events had a two-fold effect: the egg supply depleted and egg prices surged.</p>\n<p>In response to this, farmers, manufacturers, and major retailers – including McDonald&#8217;s, Dunkin Donuts, and Panera Bread – made a promise to switch to “cage-free” over the next few years in hopes to improve the egg supply.</p>\n<p>This brings us to where we are today: an oversupply of eggs. Consumers are not buying enough of both conventional and cage-free eggs, which is why the prices for eggs are relatively cheap at the moment. What’s more concerning is that since conventional eggs are even cheaper than cage-free eggs, “90 percent of consumers stand in front of the egg case, and they pick conventional caged eggs because they’re economical,” said Chad Gregory, CEO of United Egg Producers.</p>\n<p>So why choose cage-free? The next time you visit the grocery store, understand that your dollar goes towards benefitting local farmers, improving sustainability and supporting the humane treatment of chickens. Plus, you’ll get one great tasting omelet, and no one can argue with that!</p>\n<p>If you have questions about cage-free eggs or any of our other products, please <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today!</p>\n"}