{"title":"Egg-citing Recipes: Poached Eggs","slug":"egg-citing-recipes-poached-eggs","excerpt":"<p>Struggling to find the best way to cook your egg? We’re ready to help you bring the sunny-side up to your breakfast: those hard times will be over easy! A poached egg can be a healthy way to spruce up the first meal of the day, since it does not require any added fat like&#8230;</p>\n","keywords":["how to make a poached egg"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_dollarphotoclub_25537261.jpg","image":{"src":"/images/rsz_dollarphotoclub_25537261.jpg","alt":""},"date":"2015-03-02T10:01:23","author":"Chino Valley Ranchers","content":"<p>Struggling to find the best way to cook your egg? We’re ready to help you bring the <em>sunny-side up</em> to your breakfast: those hard times will be <em>over easy</em>! A poached egg can be a healthy way to spruce up the first meal of the day, since it does not require any added fat like milk, cheese, or oil to cook. Put it over some whole wheat toast and you have yourself a healthy treat!<!--more--></p>\n<p>Here’s our recommended recipe for cooking the perfect poached egg. All you need is a pan, some water, a fine metal sieve, and one or two of our eggs!</p>\n<ol>\n<li><strong>Fill the saucepan with a little water. </strong>A couple inches of water will do fine. Heat the water until it starts to simmer and there are little bubbles on the bottom of the pan.</li>\n<li><strong>Strain your egg.</strong> Take the metal sieve and crack your egg into it over a bowl. The thin parts of the egg will fall through and your egg will stay together better when you put it in the water.</li>\n<li><strong>Carefully pour the egg(s) into the water.</strong> Try and keep the egg whites as close to the yolk as possible, using a spoon if you need to. If you have more than one egg, keep the eggs far apart in the water.</li>\n<li><strong>Turn off the heat and cover the pan.</strong> Set a timer for 4 minutes. This will make sure your egg white is cooked all the way through while still having a runny yolk. If you have extra large eggs or prefer your yolk to be firmer, cook it a little longer.</li>\n<li><strong>Remove the eggs with a spoon.</strong> When the time is up, take out each egg and place it either on a plate, on your toast, or however you prefer to eat your egg. Enjoy!</li>\n</ol>\n<p>We hope this egg recipe was as <em>eggs-ellent</em> for you as it was for us! At Chino Valley Ranchers, we strive to provide you with the highest quality eggs and egg recipes. For more, visit our website, and if you have any questions give us a call!</p>\n"}