{
  "title": "Egg Mayo — A Revered French Dish",
  "slug": "egg-mayo-a-revered-french-dish",
  "image": {
    "src": "/images/4.jpeg",
    "alt": "EGG MAYO — A REVERED FRENCH DISH"
  },
  "date": 1634010507734,
  "author": "Chino Valley Ranchers",
  "content": "<p>French mayonnaise — called œuf mayo — was a ubiquitous dish at Parisian bistros, until the cholesterol- and fat-averse decided the egg had to go. To prevent the outright extinction of œuf mayo, the late food critic Claude Lebey stepped in to launch the Association de sauvegarde de l’œuf mayonnaise (ASOM), or the Association to Safeguard Egg Mayonnaise. With friend and journalist Jacques Pessis, Lebey set out to give the dish the gravitas it deserved and enshrine its preparation process.</p><p><br></p><p>According to ASOM, œuf mayo had to be prepared using large eggs, slathered on liberally, and served with vegetables or crisp lettuce.</p><p><br></p><p>The duo even introduced annual awards, handing out certificates to Parisian establishments that followed the tradition of œuf mayo. Once the dish was restored to its proper place in Parisian dining, Lebey retired and disbanded the society in 2013.</p><p><br></p><p>However, after his death in 2017, a group of critics and industry experts decided to revive the organization in his memory and launched the very first Championnat du monde de l’œuf mayonnaise, or World Championship of Egg Mayonnaise.</p><p><br></p><p><strong>How to make œuf mayo</strong></p><p>To prepare the French dish, you’ll need one Chino Valley Ranchers egg yolk, a pinch of salt, a pinch of pepper, a few drops of white vinegar, one generous teaspoon of French Dijon mustard, and 150 ml of vegetable or sunflower oil (but don’t use olive oil).</p><p><br></p><p>Start by whisking together the egg yolk, salt, peper, vinegar, and Dijon mustard. Next, pour oil into the bowl while whisking continuously. As soon as the oil integrates, add more. Continue adding oil and stirring until the oil is used up. By now, the mixture should be thick like mayonnaise.</p><p><br></p><p>You could also add garlic and a hint of lemon juice to create a French Aioli (a garlic sauce). Or, you could add capers, onions, parsley, gherkins, and tarragon to turn it into tartar sauce.</p><p><br></p><p>French œuf mayo is typically served alongside cold meats, such as beef and chicken, and frequently added to tomato and tuna sandwiches.</p><p><br><br></p><p>Sources:</p><p><a href=\"https://www.instructables.com/Recipe-of-the-TRUE-French-Mayonnaise/\" title=\"https://www.instructables.com/Recipe-of-the-TRUE-French-Mayonnaise/\">https://www.instructables.com/Recipe-of-the-TRUE-French-Mayonnaise/</a>&nbsp;</p><p><a href=\"https://www.francetoday.com/food-drink/oeuf-mayonnaise-all-its-cracked-up-to-be/\" title=\"https://www.francetoday.com/food-drink/oeuf-mayonnaise-all-its-cracked-up-to-be/\">https://www.francetoday.com/food-drink/oeuf-mayonnaise-all-its-cracked-up-to-be/</a>&nbsp;</p><p><br></p>"
}