{"title":"Eggnog 5 Different Ways","slug":"eggnog-5-different-ways","image":{"src":"/images/CVR_Eggnog.png"},"date":1670621979568,"author":"Chino Valley Ranchers","content":"<p>If you love eggnog the traditional way, we’ve got a few recipes that will put a new twist on the Christmas classic. And if you’re still refining your traditional eggnog recipe, we’ve got a recipe that will get you closer to perfection.<br></p><p><strong>1. Traditional Eggnog</strong></p><p>If you’re not a big fan of eggnog, this one is made with brandy and dark rum to give it a bolder and richer flavor. You’ll need six eggs, one cup white sugar, ½ teaspoon vanilla extract, ½ teaspoon ground nutmeg, two cups whipping cream, two cups milk, ¾ cup brandy, and ⅓ cup spiced rum.</p><p></p><p>Begin by beating the eggs for two to three minutes until frothy, and gradually add the sugar, vanilla extract, and ¼ teaspoon nutmeg. Then, stir in cream, brandy, milk, and rum. Cover and chill the eggnog before serving.</p><p></p><p>View the full <a href=\"https://www.allrecipes.com/recipe/269416/traditional-eggnog/\">recipe</a>.</p><p></p><p><strong>2. Chocolate Eggnog Milkshake</strong></p><p>This recipe is kid-friendly, but you can also turn it into an adult beverage by adding vodka, a shot of Kailua, rum, or Irish cream. To make this milkshake, you’ll need 1 ½ cups low-fat vanilla ice cream, ¾ cup low-fat eggnog, two tablespoons chocolate syrup, whipped cream, and your favorite toppings.<br></p><p>View the full <a href=\"https://www.allrecipes.com/recipe/8503936/chocolate-eggnog-milkshake/\">recipe</a>.</p><p></p><p><strong>3. Eggless Eggnog</strong></p><p>If you love eggnog but don’t love drinking raw eggs, this recipe is for you. This eggless eggnog is made with five cups milk, ½ cup white sugar, one package of instant vanilla pudding mix, 1 ½ teaspoon rum-flavored extract, ¼ teaspoon ground nutmeg, ¼ teaspoon ground allspice, and ¼ teaspoon ground ginger.</p><p></p><p>View the full <a href=\"https://www.allrecipes.com/recipe/240728/egg-not-eggless-eggnog/\">recipe</a>.</p><p></p><p><strong>4. Mexican Eggnog</strong></p><p>Add some international flavor to your favorite Christmas drink with this Mexican eggnog. You’ll need three pints whole milk, 2 ½ cups white sugar, two cinnamon sticks, 15 egg yolks, and one cup rum,</p><p></p><p>View the full <a href=\"https://www.allrecipes.com/recipe/260832/rompope-mexican-eggnog/\">recipe</a>.</p><p><br><strong>5.</strong> <strong>Pumpkin Pie Eggnog</strong></p><p>Infuse the flavors of pumpkin pie into your Christmas eggnog. To make this variation, you’ll need one dozen egg yolks, two cups heavy whipping cream, ½ teaspoon vanilla extract, one can of pumpkin puree, ½ cup light brown sugar, ½ cup white sugar, ¼ cup maple syrup, ¼ cup evaporated milk, one teaspoon pumpkin pie spice, ¼ teaspoon ground cinnamon, one pinch salt, two cups milk, and one tablespoon brandy.</p><p></p><p>View the full <a href=\"https://www.allrecipes.com/recipe/269204/pumpkin-pie-eggnog/\">recipe</a>.</p>"}