{"title":"Eggs and Cholesterol: Fact or Fiction?","slug":"eggs-and-cholesterol-fact-or-fiction","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/11/rsz_eggs-624x416.jpg","image":{"src":"/images/rsz_eggs-624x416.jpg","alt":""},"date":"2018-06-15T17:23:28","author":"Chino Valley Ranchers","content":"<p>Throughout the years, eggs have been a subject of discussion due to their high cholesterol content and potential association with heart disease. Despite how tasty and nutritious they are, many Americans have been afraid to eat “too many” eggs for fear of increasing dietary cholesterol. But how many eggs are “too many”? And, is egg consumption directly linked with heart disease?<!--more--></p>\n<p>First, let’s take a look at the role of cholesterol. Cholesterol is an important compound for making hormones, vitamin D and other substances that help you to digest your food. Your body makes cholesterol, but you also get a small amount from some of the foods you eat. It was previously thought that dietary cholesterol had a significant effect on the amount of cholesterol in your blood; however, it has been proven that this is no longer the case.</p>\n<p>With consistent data showing a minimal connection between dietary and plasma cholesterol, the long-standing limit on cholesterol intake was lifted with the release of the <a href=\"https://health.gov/dietaryguidelines/2015/guidelines/\">2015-2020 Dietary Guidelines for Americans</a>. In 2016, the Dietary Guidelines for Americans stated that it no longer considers cholesterol to be a nutrient of concern. In addition, nutrition data from the United States Department of Agriculture (USDA) suggested that eggs are <a href=\"https://www.ars.usda.gov/northeast-area/beltsville-md-bhnrc/beltsville-human-nutrition-research-center/nutrient-data-laboratory/\">lower in cholesterol</a> than previously recorded. The results showed the average amount of cholesterol in one large egg has decreased by 14 percent, going from 215 mg to 185 mg.</p>\n<p>According to <a href=\"https://www.health.harvard.edu/heart-health/are-eggs-risky-for-heart-health\">an article</a> by Harvard Medical School, consuming one, two or even three eggs per day is consistent with a healthy diet and is unlikely to have any significant impact on the risk of developing cardiovascular disease. In addition to organizations in the U.S., several other international health promotion organizations – including Health Canada, the Canadian Heart and Stroke Foundation, the Australian Heart Foundation and the Irish Heart Foundation – promote eggs as part of a heart-healthy diet.</p>\n<p>At Chino Valley Ranchers, we understand that eggs make up many healthy diets, which is why we provide our hens with thriving environments to ensure that you receive nutrient-dense, organic eggs that taste delicious. To learn more about Chino Valley Ranchers’ eggs and where to find them, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us </a>today!</p>\n<p>&nbsp;</p>\n"}