{"title":"Fitness Influencer Eric Leija Sizzles In Chino Valley Ranchers' Punchy New Ad Campaign","slug":"fitness-influencer-eric-leija-sizzles-in-chino-valley-ranchers-punchy-new-ad-campaign","image":{},"date":1638389145035,"author":"Chino Valley Ranchers","content":"<p>In&nbsp;<a href=\"https://www.chinovalleyranchers.com/\">Chino Valley Ranchers'</a>&nbsp;latest ad - unprecedented in the egg industry - Leija appears as a boxer mid-fight, wearing trunks featuring \"CVR Boxing Club, Can't Beat Em!\" on the waistband. As a battered Leija takes his corner, two hardboiled coaches step in to egg him on: \"Scramble 'em up, poach 'em up good! Take this bum and serve him up over hard!\" This entertaining segment wraps with a special surprise ending.<br><br><strong>See the full ad at:&nbsp;</strong><a href=\"https://youtu.be/RtAomjuOTOs\" title=\"https://youtu.be/RtAomjuOTOs\"><strong>https://youtu.be/RtAomjuOTOs</strong></a><strong>&nbsp;(OR EMBED THE VIDEO)</strong></p><p class=\"MsoNormal\">As a leading provider of organic, free-range and pasture-raised eggs for more than 30 years,&nbsp;<a href=\"https://www.chinovalleyranchers.com/\">Chino Valley Ranchers</a>&nbsp;has long been an innovator in the industry. It is not shy about mixing it up in the egg world, and it has done so once again with branded content that is both original and entertaining.</p><p class=\"MsoNormal\">The concept was written and produced by Alex Ribble of Big Chief Creative Media (<a href=\"http://bigchiefcreative.com\" title=\"http://bigchiefcreative.com\">http://bigchiefcreative.com</a>) and produced and directed by Tyler Wolff of WOLFFHAUS Studio &amp; Creative (<a href=\"http://wolffhauscreative.com\" title=\"http://wolffhauscreative.com\">http://wolffhauscreative.com</a>).</p><p class=\"MsoNormal\">Leija specializes in kettlebell training courses. He is one of the fastest-rising fitness influencers on the web, with nearly 1 million followers on Instagram (@primal.swoledier). Leija is now launching a workout program branded by Men's Health.</p>"}