{"title":"Four Hacks For Peeling Hard Boiled Eggs","slug":"four-hacks-for-peeling-hard-boiled-eggs","image":{"src":"/images/1.png"},"date":1654720599240,"author":"Chino Valley Ranchers","content":"<p>If you dread peeling hard boiled eggs, then you’re doing it all wrong. The following four hacks will crack open the secret to easy egg peeling.</p><p></p><p><strong>1. Baking Soda</strong></p><p>Did you ever think you’d be adding baking soda to a pot of boiling water? Well, that’s exactly what you need to do for easy peeling once the eggs have been boiled.<br></p><p>The alkaline in the baking soda will loosen the egg whites from the shell and make peeling a breeze. And don’t worry, the eggs won’t taste like baking soda.</p><p></p><p><strong>2. Ice Bath</strong></p><p>You’ve probably heard of this one before, and it’s definitely a hack to use. Regardless of how you’ve boiled the eggs, the post-boil ice bath is a must.</p><p></p><p>Fill a large bowl or unused pot with cold water and ice — and we mean LOTS of ice. More than you think you need. Place the eggs in the ice bath and let them soak for a few minutes. The shock of ice cold water will help the egg whites detach from the shell and make peeling an easy process. It will also stop the cooking process, ensuring the eggs aren’t overboiled.</p><p></p><p><strong>3. Crack Hack</strong></p><p>Before placing eggs in boiling water, gently tap them on the counter or bowl to create a small crack in the shell. Just be careful not to let any egg whites spill out. Boil the eggs as usual and place them in a cold water bath, one at a time. Close the lid on the container filled halfway with water, and shake it like a Polaroid picture. While you’re shaking the container, the shell will peel away from the egg white.</p><p><br>4. <strong>Older Eggs</strong></p><p>No need to wait until the carton of eggs is expired. Just one or two weeks after purchasing your carton of Chino Valley Ranchers eggs is enough. Over time, eggs lose moisture through the pores of their shell, causing the egg to shrink and pulling the membrane away from the shell. When you peel fresh eggs, chunks of egg white are more likely to come off because its layers are firm and tight.</p>"}