{"title":"Fun Facts About Chickens And Hens","slug":"fun-facts-about-chickens-and-hens","image":{"src":"/images/CVR_hens.png"},"date":1671827041234,"author":"Chino Valley Ranchers","content":"<p>You probably eat eggs and poultry on a regular basis, but how much do you know about chickens and hens? Here are a few fun facts that will shed some light on our feathered friends.</p><p><br><strong>1.</strong> <strong>Chickens are omnivores.</strong></p><p>You might think that chickens only eat seeds, grass, and grain, but in fact, they also eat insects, field mice, toads, and lizards!</p><p><br><strong>2.</strong> <strong>Chickens can recognize over 100 faces.</strong></p><p>Though you might struggle to tell chickens apart, rest assured they can recognize the faces of people around them. They can also recognize different animals, like cats and dogs.</p><p><br><strong>3.</strong> <strong>Chickens have better color vision than humans.</strong></p><p>Contrary to popular belief, chickens aren’t colorblind. In fact, they have five types of light receptors in the eye that allow them to see many different colors.</p><p><br><strong>4.</strong> <strong>Chickens have REM sleep.</strong></p><p>Like humans, chickens see dreams during the REM (rapid eye movement) phase of sleeping. But they also go through a sleep phase called unihemispheric slow-wave sleep (USWS) in which half of the brain sleeps while the other half is awake. This literally means they can sleep with one eye open.</p><p><br><strong>5.</strong> <strong>Chickens have advanced communication skills.</strong></p><p>What sounds like meaningless clucks is actually a language of more than 30 different vocalizations that is used to communicate.</p><p><br><strong>6.</strong> <strong>Genetics determines egg color.</strong></p><p>Did you know you can determine a chicken’s egg shell color by its earlobe color? A hen’s breed is another indicator of what color egg she will produce.</p><p><br><strong>7.</strong> <strong>Chickens are descended from dinosaurs.</strong></p><p>Can you imagine chickens the size of dinosaurs? The truth is, chickens are descended from T. Rex dinosaurs.</p><p><br><strong>8.</strong> <strong>Chickens outnumber humans four to one.</strong></p><p>In case you’re wondering, there are more than 25 billion chickens in the world. So a chicken invasion might be more plausible than an alien invasion. Statistically speaking.</p><p><br><strong>9.</strong> <strong>Chickens are smarter than they look.</strong></p><p>Don’t underestimate a chicken’s intelligence! They have strong problem-solving skills and have super-sensory powers, like telescopic eyesight.</p><p><br><strong>10.</strong> <strong>Chickens are followers.</strong></p><p>Chicken keepers know that if they can get one chicken to obey their commands, then the rest will follow.</p><p><br><strong>11.</strong> <strong>Chickens can fly and run.</strong></p><p>Though they can’t fly very far, they can fly over a fence or get up high in a tree. They’re also able to turn on a dime to get away from predators.</p>"}