{
  "title": "Helping Neighbors in Need During California’s Severe Weather",
  "slug": "helping-neighbors-in-need-during-californias-severe-weather",
  "image": {
    "src": "/images/CVR_Blog-Post-Image-AprilGoodwins-V3.jpg"
  },
  "date": "2023-03-20T00:00:00Z",
  "author": "Chino Valley Ranchers",
  "content": "<p>Following California’s recent severe storms, residents in many communities have faced life-threatening conditions and an inability to obtain basic necessities. Crestline, a small, scenic town of 10,000 located in the San Bernardino Mountains, experienced a total white out in early March when a series of precedented winter storms dropped more than 100 inches of snow. Authorities managed to clear primary roads to allow emergency services to get through, but local streets remained under feet of snow, and desperate residents were forced to hike out from their homes in search of needed supplies.&nbsp;</p><p></p><p>Like many buildings in the area, the town’s only grocery store, Goodwin &amp; Son’s Market, was destroyed in a roof collapse caused by excessive snow. This family-owned business has served the community since 1946 and is the lifeline for residents during severe weather.&nbsp;<br></p><p>But the roof collapse didn’t stop Goodwin &amp; Sons and its partners from getting crucial supplies to their neighbors in need. The market’s North Shore Lake parking lot became an emergency supply station, where staples and ready-to-eat meals were distributed. Chino Valley Ranchers answered the call by loading up the 4-wheel drive and donating 900 cartons and 60 cases of organic eggs to the relief effort.&nbsp;<br></p><p>A Goodwin Organics spokesperson posted: “We are so grateful for businesses like Chino Valley Ranch who step up to support their local community in times of need. It's heartwarming to see the community come together to help each other out during challenging times. Thank you, Chino Valley Ranch, for your incredible contribution to the Crestline Community! #communitysupport #gratitude #localheroes #goodwinsorganics”</p><p></p><p>Chino Valley Ranchers is a family-owned enterprise with deep roots in Southern California. For three generations, we have made it our business to support the health and well-being of our community, not just by farming our nutritious, pasture-raised eggs, but through acts of service to our neighbors.&nbsp;<br></p><p>As the snow abates, residents and businesses in Crestline will be rebuilding damaged structures and resuming their way of life. Goodwin &amp; Son’s Market remains closed for the time being as repairs are underway. While everyone is eager for a return to normalcy, this historic event has been a heartwarming reminder of the power of community.&nbsp;<br></p><p>Family-owned and operated since the 1950s, Chino Valley Ranchers is dedicated to bringing the freshest, healthiest and best-tasting eggs to your table. As an accredited California Certified Organic Farmers (CCOF) organic provider, Chino Valley Ranchers’ hens are fed the finest organic, non-GMO grains and seeds from certified pesticide-free fields. Chickens are pasture-raised and free to roam in and out of doors with unlimited access to fresh food and water. Chino Valley Ranchers eggs are certified by American Humane and carry the American Humane Certified seal.</p>"
}