{"title":"How to Cook a Basic Omelet","slug":"how-to-cook-a-basic-omelet","excerpt":"<p>We at Chino Valley Ranchers know how busy our customers are. With work, family, friends and so much more, it might feel like there’s not enough time in the day to even think about making a proper breakfast. Fortunately, we understand this. That’s why we are happy to share a simple yet delicious breakfast dish&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/07/rsz_img_6867.jpg","image":{"src":"/images/rsz_img_6867.jpg","alt":""},"date":"2016-07-26T15:05:13","author":"Chino Valley Ranchers","content":"<p>We at Chino Valley Ranchers know how busy our customers are. With work, family, friends and so much more, it might feel like there’s not enough time in the day to even think about making a proper breakfast. Fortunately, we understand this. That’s why we are happy to share a simple yet delicious breakfast dish with you – the classic omelet. The dish has all of the nutrients you need and doesn’t take very long to prepare. Enjoy this tasty recipe on how to make a basic omelet.<!--more--></p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Milk or water</li>\n<li>Butter</li>\n<li>Your choice of filling: cheese, ham, vegetables, etc.</li>\n</ul>\n<p>1. Prepare your eggs.</p>\n<p>Begin by cracking your eggs into a bowl along with your choice of milk or water. Beat the mixture until it is fully blended. As you do this, feel free to add salt and pepper for flavoring.</p>\n<p>2. Heat up the skillet.</p>\n<p>Place butter on a nonstick pan or skillet on high heat until the bottom is coated with butter. Then, pour your egg mixture into the skillet. Be sure to tilt the skillet and spread the eggs around evenly. After a few minutes of cooking, the edges should be firm and the middle should be a little bit runny, but cooked all the way through</p>\n<p>3. Add your filling.</p>\n<p>While the middle is runny, add your choice of cheese, ham, vegetables or whatever else you’d like to add to the omelet. Then take a spatula and fold the circular dish in half.</p>\n<p>And in no time at all, you have yourself a delicious yet simple egg omelet! To ensure that your omelet turns out superb, be sure to use an egg farmer and egg distributer like Chino Valley Ranchers that only produces high quality eggs. For more information, contact Chino Valley Ranchers today!</p>\n"}