{"title":"How to Make Coddled Eggs","slug":"how-to-make-coddled-eggs","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/05/egg-1265735_960_720.jpg","image":{"src":"/images/egg-1265735_960_720.jpg","alt":""},"date":"2016-08-24T14:04:08","author":"Chino Valley Ranchers","content":"<p>Are you looking for a new and unique way to make your eggs? Well look no further! Chino Valley Ranchers is serving up a delicious egg recipe: coddled eggs. While coddled eggs are not necessarily a new way to serve your eggs, it is definitely a preparation that we do not see very often.<!--more--></p>\n<p>Take a look at what a coddled egg is, try the recipe out for yourself and let us know what you think!</p>\n<p><u>What is a Coddled Egg?</u></p>\n<p>Coddling an egg is a cooking method that creates a soft and tenderly prepared egg. These eggs pair well with toast or any other breakfast meal. Want to give coddled eggs a try? See our recipe below!</p>\n<p><u>Coddled Egg Recipe &#8211; What You’ll Need: </u></p>\n<ul>\n<li>Chino Valley Ranchers Eggs</li>\n<li>Egg Coddler</li>\n<li>Butter</li>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Cream (optional)</li>\n</ul>\n<p><strong>1. Prepare the egg coddler. </strong></p>\n<p>For those that do not know, an egg coddler is a cup typically made out of porcelain to cook coddled eggs in. If you don’t have a coddler, you can always use a cup or ramekin that is heat resistant. Crack your Chino Valley Ranchers eggs into each individual coddler. Add salt, pepper and cream for extra flavor.</p>\n<p><strong>2. Have your pan ready.</strong></p>\n<p>As you fill the coddlers, pour a sauté pan with about an inch or two of water and let it get to a boil.</p>\n<p><strong>3. Place the egg coddlers in the pan.</strong></p>\n<p>Once your eggs and water are ready, put the egg coddlers directly in the pan, put heat on a simmer and cover it with a lid. Let them cook for about three to six minutes. Once the egg is done to your liking, gently remove the egg from the coddler and place it on a serving dish.</p>\n<p>In three easy steps you have yourself some coddled eggs! To make sure the dish tastes its best, it is important to buy the best quality of eggs – like those from Chino Valley Ranchers. Our eggs are fresh and always taste great. For more information about our eggs, contact us today!</p>\n"}