{"title":"How to Make a Heart-Shaped Hard-Boiled Egg this Valentine’s Day","slug":"how-to-make-a-heart-shaped-hard-boiled-egg-this-valentines-day","excerpt":"<p>Valentine’s Day is a day to show your loved ones how much they mean to you. But just because you want to show them your love, doesn’t mean you have to break the bank while doing so.</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/Bacon-and-Eggs.jpg","image":{"src":"/images/Bacon-and-Eggs.jpg","alt":""},"date":"2016-02-05T17:00:55","author":"Chino Valley Ranchers","content":"<p>Valentine’s Day is a day to show your loved ones how much they mean to you. But just because you want to show them your love, doesn’t mean you have to break the bank while doing so.<!--more--> Oftentimes it’s the small, personal touches that leave the biggest impact. One way to start the holiday off right is with a personalized, delicious breakfast. To do that, Chino Valley Ranchers is excited to share a great and easy heart-shaped hard-boiled egg recipe for you to try this Valentine’s Day. Read the instructions below or watch a video <a href=\"https://www.youtube.com/watch?v=LWX4Hk4_O7A\">here</a>!</p>\n<p><strong>What You’ll Need: </strong></p>\n<p>&#8211; Chino Valley Rancher Eggs</p>\n<p>&#8211; 1 clean, empty cardboard juice carton</p>\n<p>&#8211; 2 rubber bands</p>\n<p>&#8211; 1 pen or set of chopsticks</p>\n<ol>\n<li>Place an egg in a pan of boiling water for 5-10 minutes.</li>\n<li>After it is boiled, run the pan under cold water and let it cool down.</li>\n<li>While the eggs are cooling, take a clean and empty juice carton and cut off the top and the base of the carton. This will leave you with a cuboid shape. Then choose one of the four corners and measure about one to two inches out. At that one to two-inch mark, cut that corner out of the cuboid shape, leaving enough room for the egg to rest in that corner. Throw away the rest of the carton.</li>\n<li>Peel the egg and sit it long ways on the cut out juice carton.</li>\n<li>Place a pen or a chopstick on top of the egg and hold it in place with one rubber band on each side of the egg.</li>\n<li>Let it sit for ten minutes, as it molds into the heart shape. Then remove the bands and take the egg out.</li>\n<li>Chop the egg in half and you now have two heart-shaped eggs!</li>\n</ol>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/3-organic-egg-breakfasts-for-christmas-morning/\">3 Organic Egg Breakfasts for Christmas Morning</a></p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/how-to-make-delicious-scrambled-eggs/\">How to Make Delicious Scrambled Eggs</a></p>\n<p>Making this personalized breakfast for your loved one will make all the difference this Valentine’s Day. To make an even better breakfast, be sure to choose the best quality eggs from Chino Valley Ranchers. Enjoy and Happy Valentine’s Day!</p>\n"}