{"title":"How to Make Tasty Huevos Rancheros","slug":"how-to-make-tasty-huevos-rancheros","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/01/26585638603_ed63fe79f6_b.jpg","image":{"src":"/images/26585638603_ed63fe79f6_b.jpg","alt":""},"date":"2017-01-05T15:46:30","author":"Chino Valley Ranchers","content":"<p>Do you want to add some extra spice to your morning breakfast? Huevos rancheros can be a delicious alternative to your simple bacon and eggs combo. Not sure how to make this yummy dish? <!--more-->No worries! Chino Valley Ranchers is excited to share with you a fun and tasty huevos rancheros recipe. To learn how to make this dish for yourself, continue reading!</p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers Eggs</li>\n<li>Black beans (rinsed)</li>\n<li>Lime juice</li>\n<li>Ground cumin</li>\n<li>Olive oil</li>\n</ul>\n<p><u>Optional Ingredients:</u></p>\n<ul>\n<li>Sliced avocado</li>\n<li>Queso fresco, cheddar, jack or feta cheese</li>\n<li>Salsa</li>\n<li>Cilantro</li>\n<li>Corn tortillas for serving</li>\n</ul>\n<p><strong>1. Get your oven ready.</strong><br />\nBefore working on anything else, be sure to preheat the oven to 400° F.</p>\n<p><strong>2. Combine the ingredients.</strong></p>\n<p>Lightly mix together the beans, lime juice, cumin and olive oil in a medium-sized bowl.</p>\n<p><strong>3. Prepare the tortillas (optional).</strong></p>\n<p>If using tortillas for serving, brush each tortilla on both sides with olive oil and place them on a rimmed baking sheet. Then, bake the tortillas for 8-10 minutes.</p>\n<p><strong>4. Cook the eggs.</strong></p>\n<p>Put a tablespoon of olive oil in a large nonstick skillet on medium heat. Crack the eggs into the pan, then cover the pan and cook them to your desired doneness. (Tip: if you want somewhat runny sunny-side-up eggs, 2-4 minutes is the recommended cook time.)</p>\n<p><strong>5. Garnish the eggs.</strong></p>\n<p>Place the cooked eggs on a plate or directly onto the warmed tortillas, and then top the eggs with the bean mixture. Add salsa, cheese, cilantro and/or avocado slices to your liking.</p>\n<p>With just a little prep and cooking time, your yummy huevos rancheros are ready to eat! Of course, the key ingredient to this Mexican-inspired dish is the eggs. You’ll want to use only the highest quality eggs, so be sure and get yours from Chino Valley Ranchers. Our eggs and egg products are fresh, delicious and nutritious. They’ll make your huevos rancheros or any egg dish you prepare that much better!</p>\n<p>For more information on our eggs, contact Chino Valley Ranchers today.</p>\n"}