{"title":"How to Make the Perfect Ramen Egg!","slug":"how-to-make-the-perfect-ramen-egg","excerpt":"<p>Over the years, ramen has been sweeping the U.S. and people are swooning over the comforting flavors of warm broth, springy noodles, and fresh veggies. But amongst all of the jam-packed ingredients, there is one that stands out from the rest: the ramen egg.</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","egg","egg producer","egg recipes","organic eggs","ramen egg","recipes"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/09/Untitled-design.jpg","image":{"src":"/images/Untitled-design.jpg","alt":""},"date":"2017-09-22T19:53:56","author":"Chino Valley Ranchers","content":"<p>Over the years, ramen has been sweeping the U.S. and people are swooning over the comforting flavors of warm broth, springy noodles, and fresh veggies. But amongst all of the jam-packed ingredients, there is one that stands out from the rest: the ramen egg.<!--more--></p>\n<p>What are ramen eggs, you ask? Also known for its Japanese counter-name, <em>Ajitsuke Tamago,</em> a ramen egg is soft-boiled and marinated in a soy sauce mixture, providing a tangy pop of flavor upon each bite. Even though the name implies that they should be eaten in ramen, these eggs can also be enjoyed as a side dish or snack.</p>\n<p>This week, your friends at Chino Valley Ranchers have cracked down the basics to make the perfect ramen egg!</p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers eggs</li>\n<li>Soy sauce</li>\n<li>Mirin</li>\n</ul>\n<p>To get started, bring a pot of water to a rolling boil and gently add your Chino Valley Ranchers eggs in with a slotted spoon. We’ve found that a perfect ramen egg takes six minutes to boil to a custard-like texture. There is no need to bring your eggs to room temperature; you can start cooking them straight from the fridge. The water should naturally reduce to a simmer, due to the addition of cold eggs, but make sure to maintain the simmer for six minutes.</p>\n<p>Once the six minutes are up, remove the eggs from the hot water with the slotted spoon and immediately plunge them into a bowl full of ice to stop them from cooking. As your eggs cool down, mix together equal parts of soy sauce and mirin in a separate bowl. Peel and dry the eggs and place them in the marinade for a minimum of one hour. For a more flavorful egg, cover and marinade your eggs for up to a day in the fridge. When you’re ready to eat, remove your ramen eggs from the mixture, and enjoy!</p>\n<p>There you have it – a Chino Valley Ranchers’ breakdown of how to perfect the ramen egg! If you liked this recipe, give it a share and be sure to check out other Chino Valley Rancher recipes on our blog! If you have questions about our products, please <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today!</p>\n"}