{"title":"How Chino Valley Ranchers Promotes Sustainability to Local Communities","slug":"how-chino-valley-ranchers-promotes-sustainability-to-local-communities","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/11/manure-sustainability-2.jpg","image":{"src":"/images/manure-sustainability-2.jpg","alt":""},"date":"2017-07-12T22:05:10","author":"Chino Valley Ranchers","content":"<p>Since the early 1950s, Chino Valley Ranches has been dedicated to providing locally produced fresh eggs to its customers. With footprints in counties like Riverside, San Diego, and San Bernardino, we believe in promoting sustainability in all aspects of our practice throughout these communities. <!--more-->From our packaging to our composting strategies, Chino Valley Ranchers strives to promote economic growth and reduce our carbon footprint. Take a look at some of the ways we do this:</p>\n<p><strong>1. Recycling</strong></p>\n<p>Chino Valley Ranchers promotes recycling in all areas of our manufacturing. Our labels, cartons, corrugated boxes and plastic containers are all made from recyclable material. In addition, we filter and treat 100% of our water that’s generated after processing and use it for landscaping purposes.</p>\n<p><strong> 2. </strong><strong>Sustainable Forestry Initiative</strong></p>\n<p>All of our liquid egg cartons bear the Sustainable Forestry Initiative (SFI) symbol, which lets our customers know that our paper materials are produced from a certified North American forest. This label helps promote sustainable forest management, water quality and the conservation of wildlife habitat.</p>\n<p><strong> 3. </strong><strong>Composting</strong></p>\n<p>On average, about <a href=\"https://www.epa.gov/smm/advancing-sustainable-materials-management-facts-and-figures\">50 percent</a> of compostable material is sent to landfills. Additionally, food and plant waste that isn’t allowed to decompose produces methane, a greenhouse gas that’s a huge contributor to climate change. At Chino Valley Ranchers, we work to decrease the greenhouse gas effect by composting.</p>\n<p>First, we take the manure from our chickens, mix it with green waste from our farms and create a beautiful thing: fertilizer. This fertilizer then goes directly to organic farms in neighboring communities. In addition, all of the paper-based egg cartons we use are compostable, giving our customers the hand-off to continue our sustainability efforts.</p>\n<p>At Chino Valley Ranchers, we believe that sustainability is crucial for protecting our environment and offsetting the natural resources we use daily. The well-being of our chickens, land and farm are important to us, so we take many steps to ensure that proper management practices are in place. By doing so, we are able to produce high-quality eggs while putting back into the earth what we take out.</p>\n<p>Want to learn more about our products and sustainability efforts? <a href=\"http://www.chinovalleyranchers.com/store-locator/\">Contact</a> Chino Valley Ranchers today!</p>\n"}