{"title":"Jump into the Holiday Spirit with This Festive Eggnog Recipe","slug":"jump-into-the-holiday-spirit-with-this-festive-eggnog-recipe","excerpt":"<p>Celebrate the holidays with a Chino Valley Ranchers eggnog treat! We’ve put together a homemade recipe that your guests will absolutely love. The eggs in our eggnog recipe are gently cooked to kill any potential bacteria, so no need to fear raw eggs! Plus, this treat is non-alcoholic, so guests of all ages can enjoy&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/12/egg-nog-day1-e1419159371546.jpg","image":{"src":"/images/egg-nog-day1-e1419159371546.jpg","alt":""},"date":"2017-12-22T19:06:10","author":"Chino Valley Ranchers","content":"<p>Celebrate the holidays with a Chino Valley Ranchers eggnog treat! We’ve put together a homemade recipe that your guests will absolutely love. The eggs in our eggnog recipe are gently cooked to kill any potential bacteria, so no need to fear raw eggs! Plus, this treat is non-alcoholic, so guests of all ages can enjoy it.<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>6 Chino Valley Ranchers’ eggs, plus 2 yolks</li>\n<li>½ cup sugar</li>\n<li>Salt</li>\n<li>4 cups whole milk</li>\n<li>Vanilla extract</li>\n<li>Ground nutmeg</li>\n<li>Ground cinnamon</li>\n<li>¼ cup heavy cream</li>\n<li>Candy thermometer</li>\n</ul>\n<p>1. Whisk together your Chino Valley Ranchers eggs, egg yolks, sugar and a pinch of salt in a medium bowl. Then, in a medium-sized saucepan, heat the milk over medium heat until the liquid starts to steam. Once that happens, immediately remove your mixture from the heat.</p>\n<p>2. Whisk about one cup of the hot milk mixture into the egg mixture, then pour the milk-egg combo back into the saucepan. This process is called tempering, which cooks the eggs, but keeps them from curdling from the high heat. Return the saucepan to medium heat, stirring constantly with a wooden spoon. The mixture will be ready in about five minutes, or when it’s thick enough to coat the back of the spoon and a thermometer reads 165°</p>\n<p>3. Remove the saucepan from the heat, and stir in the vanilla, a pinch of nutmeg and cinnamon. Strain the liquid through a fine-mesh strainer into a medium bowl, and let it cool at room temperature for about an hour or until it is no longer hot. Then, place your milk-egg mixture into the refrigerator for at least two hours.</p>\n<p>4. When you’re ready to serve your treat, whip the heavy cream in a large bowl with an electric mixer until it forms soft peaks. Then, while whisking, slowly pour in the cold milk-egg mixture. Serve your finished eggnog with a sprinkle of nutmeg and enjoy!</p>\n<p>We hope this Chino Valley Ranchers eggnog recipe brings you joy this holiday season! Be sure to check out our other recipes on our website and on our <a href=\"https://www.youtube.com/channel/UCfpxQ8Bri4ZVNE__73DD36A\">YouTube channel</a>. If you have questions about our products, please contact us today!</p>\n"}