{"title":"One Egg Per Day Associated with 12 Percent Reduced Risk of Stroke","slug":"one-egg-per-day-associated-with-12-percent-reduced-risk-of-stroke","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/11/encstroke-624x624.jpg","image":{"src":"/images/encstroke-624x624.jpg","alt":""},"date":"2016-11-04T12:25:40","author":"Chino Valley Ranchers","content":"<p><strong><em>Protein and antioxidants found in eggs named as potential nutritional factors</em></strong></p>\n<p>On the heels of the 2015 Dietary Guidelines for Americans that placed no daily limit on dietary cholesterol and noted eggs are an affordable, accessible, nutrient-rich source of high quality protein, new research shows eggs are associated with a 12 percent reduction in the risk of stroke, the 5th leading cause of death in the United States.<!--more--></p>\n<p>The study is published in the Journal of the American College of Nutrition (1). Researchers report that consumption of up to one egg per day had no association with coronary heart disease (CHD) and a 12 percent reduction of stroke risk. These findings come from a systematic review and meta-analysis of studies dating back between 1982 and 2015, which evaluated relationships between egg intake and coronary heart disease (total of 276,000 subjects) and stroke (total of 308,000 subjects).</p>\n<p>Principal Investigator on this study, Dr. Dominik Alexander of the EpidStat Institute, Ann Arbor, MI, notes that mechanistic work is needed to understand the connection between egg consumption and stroke risk. However, he theorizes that, &#8220;Eggs do have many positive nutritional attributes, including antioxidants, which have been shown to reduce oxidative stress and inflammation. They are also an excellent source of protein, which has been related to lower blood pressure.&#8221;</p>\n<p>One large egg boasts 6 grams of high-quality protein and antioxidants lutein and zeaxanthin, found within the egg yolk, as well as vitamins E, D, and A.</p>\n<p>Alexander&#8217;s research lends further support to changes in the recently-released 2015 Dietary Guidelines for Americans, which have eliminated dietary cholesterol limits, and now include regular consumption of eggs among lean protein choices (2). It also builds on a 2015 meta-analysis in which dietary cholesterol was shown to have no association with cardiovascular diseases, including coronary artery disease and stroke (3). &#8220;This systematic review and meta-analysis underscores prior research, showing the lack of a relationship between eggs and heart disease and now suggests a possible beneficial effect of eating eggs on risk of stroke,&#8221; Tia M. Rains, PhD, Interim Executive Director of the Egg Nutrition Center, the scientific research arm of the American Egg Board.</p>\n<p><em><a href=\"http://www.foodmarket.com/images/encstroke.jpg\">Via: www.foodmarket.com</a></em></p>\n"}