{"title":"Organic Egg Costumes for Kids? Oh Yes, they Exist","slug":"organic-egg-costumes-for-kids-oh-yes-they-exist","excerpt":"<p>The official start of fall means only one thing: the holidays are rapidly approaching. First up: Halloween. From picking out the perfect costume, to attending parties and trick-or-treating, this holiday is very egg-citing for children and adults alike. May we suggest some egg-cellent organic egg themed costumes for you? Here they are, in no particular&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/10/rsz_dollarphotoclub_63259665-e1425670669510.jpg","image":{"src":"/images/rsz_dollarphotoclub_63259665-e1425670669510.jpg","alt":""},"date":"2015-10-02T11:00:43","author":"Chino Valley Ranchers","content":"<p>The official start of fall means only one thing: the holidays are rapidly approaching. First up: Halloween. From picking out the perfect costume, to attending parties and trick-or-treating, this holiday is very <em>egg-citing</em> for children and adults alike. May we suggest some <em>egg-cellent</em> organic egg themed costumes for you? Here they are, in no particular order.</p>\n<ul>\n<li>Eggs and bacon. This one isn’t all that off-beat. One person dresses up as eggs, the other as bacon. Pretty straightforward.</li>\n<li>Deviled egg. Buy a boiled egg costume and add horns and a tail. Boom. You’re a deviled egg. Many costume stores sell this as a set. If the budget is tight, it’s pretty easy to make. Just make a cardboard cutout for the boiled egg, attach a string to it, and hang it around your neck. Add the horns and tail and you’ve got a funny, budget-friendly costume.</li>\n<li>Humpty Dumpty. This one is cute and classic. Who wouldn’t think a toddler, well, toddling around in a puffy Humpty Dumpty costume was cute?</li>\n<li>“Eggs” from the movie <em>The Boxtrolls</em>. This is a pretty easy DIY costume. All you need is a box, aviator goggles, and some good Pinterest search skills.</li>\n<li>“Sam” from Dr. Suess’s <em>Green Eggs and Ham</em>. This one is great for the young child and it’s <em>super</em> easy to make! All you need is a red hat, yellow shirt, white plate, and green and white Play-Doh. Mold the Play-Doh into your ham and eggs and allow it to dry, then glue to the white plate. Make a sign that says “Sam I Am” and you’re good to go.</li>\n<li>The chicken or the egg. This is really fun if you have twins or kids close in age. One is the chicken and one is the egg. Easy peasy.</li>\n</ul>\n<p>We think these costumes are <em>egg-cellent!</em> We love eggs (obviously!), so it’s always exciting for us to see adults and children alike dressed up in our favorite food for Halloween. Need more ideas or like one of these and want to DIY? Take a look at <a href=\"https://www.pinterest.com/search/pins/?q=egg%20halloween%20costume&amp;term_meta%5B%5D=egg%7Ctyped&amp;term_meta%5B%5D=halloween%7Ctyped&amp;term_meta%5B%5D=costume%7Ctyped\">Pinterest</a>.</p>\n<p>If you have any questions about our organic eggs, laying hens, or our farming practices, please contact us today!</p>\n<p>&nbsp;</p>\n"}