{"title":"Organic vs. Free-Range: What’s the Difference?","slug":"organic-vs-free-range-whats-the-difference","excerpt":"<p>The egg section at the grocery store can be overwhelming. Grade AA, A, or B, size Jumbo, XL, Large, Medium, Small, Peewee, organic, vegetarian, free-range, brown, white? What does it all mean, and what eggs are the best? We’ve talked before about the difference between white and brown, and the sizes are pretty self-explanatory. As&#8230;</p>\n","keywords":["free range eggs","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/02/rsz_organic_natural.jpg","image":{"src":"/images/rsz_organic_natural.jpg","alt":""},"date":"2015-02-16T10:45:39","author":"Chino Valley Ranchers","content":"<p>The egg section at the grocery store can be overwhelming. Grade AA, A, or B, size Jumbo, XL, Large, Medium, Small, Peewee, organic, vegetarian, free-range, brown, white? What does it all mean, and what eggs are the best?</p>\n<p>We’ve talked before about the difference between white and brown, and the sizes are pretty self-explanatory. As for grade, the USDA grades each egg by measuring the appearance and quality of the three parts: the eggshell, the yolk and the egg white. AA is the highest quality; B is the lowest.</p>\n<p>Organic and free-range require a little more explanation.</p>\n<ul>\n<li><strong>Organic eggs:</strong> Organic eggs have the most stipulations for meeting the USDA organic egg requirements and are, in our opinion, the best eggs.\n<ul>\n<li><strong>Organic feed:</strong> The chickens can only be fed an organic feed. This means no pesticides, no chemicals and no animal by-products.</li>\n<li><strong>No antibiotics:</strong> The chickens are also only allowed to receive antibiotics when they are sick, versus commercial chickens who are given antibiotics regularly.</li>\n<li><strong>No hormones:</strong> Obviously, no growth hormones or any other kinds of drugs may be used on the chickens to help them produce more eggs.</li>\n<li><strong>Molting:</strong> Only natural molting may be used. Commercial farmers often induce molting so the hens have a longer laying life, but this isn’t allowed in organic foods.</li>\n<li><strong>Outdoor space:</strong> The chickens must be cage-free and have plenty of access to the outdoors. Pens are allowed, but used only to protect the chickens from natural predators.</li>\n</ul>\n</li>\n<li><strong>Free-range eggs: </strong>Free-range eggs are not the same as organic. Free-range eggs must come from chickens that have access to a small patch of cement, but many times this area is not used. There are also no restrictions on the feed and they can be given antibiotics and other hormones.</li>\n</ul>\n<p>Eggs come in many different shapes and sizes. If you have any questions about the types of eggs we sell at Chino Valley Ranchers, give us a call and we’d be happy to tell you about our happy organic chickens!</p>\n"}