{"title":"Our Soy Free Egg Story: Why We Provide Soy Free Egg Products","slug":"our-soy-free-egg-story-why-we-provide-soy-free-egg-products","excerpt":"<p>Over the last 50 years, soy has become a staple in the American diet. From cookies to cheese, soy can be found in many of the foods we consume. But humans aren’t the only beings who consume soy. Due to its widespread availability and low cost of production, soy makes up a large portion of&#8230;</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","eggs","organic eggs","soy free eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/12/15027978_1347216411964303_7537167603606404656_n-1.png","image":{"src":"/images/15027978_1347216411964303_7537167603606404656_n-1.png","alt":""},"date":"2017-08-18T21:12:48","author":"Chino Valley Ranchers","content":"<p>Over the last 50 years, soy has become a staple in the American diet. From cookies to cheese, soy can be found in many of the foods we consume. But humans aren’t the only beings who consume soy. Due to its widespread availability and low cost of production, soy makes up a large portion of animal feeds. However, some folks have opted for consuming soy-free products. So what’s the deal?<!--more--></p>\n<p><strong>The Demand Increases for Soy-Free Eggs</strong><br />\nEver since the introduction of soy to American diets, the prevalence of soy-related allergies has risen. Nowadays, soy allergies rarely have life-threatening symptoms, but people who have it can experience very uncomfortable side effects. With increasing incidences of soy allergies, Chino Valley Ranchers received many requests from consumers to provide soy free eggs. For us, this meant creating a soy-free animal feed that wouldn’t sacrifice the health of our hens.</p>\n<p><strong>The Road to Soy-Free</strong><br />\nThe production of a soy-free, healthy – and tasty – animal feed proved to be more challenging than we thought. In terms of nutritional content for our laying hens, the challenge for us was the fact that there were not many certified organic products that could replace soy. Chino Valley Ranchers stands firm on our standards when it comes to what we feed our chickens, and we could not waver in this commitment. Working closely with our nutritionist, we began testing new seeds and grains that were certified organic. After many trials, we finally created a sunflower seed blend and our chickens approved!</p>\n<p>Once the feed was adequately and consistently consumed by our chickens, the eggs were sent to a third-party laboratory for to test their soy-free profile. We at Chino Valley Ranchers were happy with the results: the eggs contained no soy protein! In addition, the nutritional content of the eggs showed to be high in both omega-3 fatty acids and vitamin E.</p>\n<p><strong>Our Soy-Free Promise</strong><br />\nWhen you buy soy free eggs from Chino Valley Ranchers, you can rest assured that you are buying a superior product. These eggs boast the same rich yellow yolk and excellent taste as our other organic eggs—the only thing missing is the soy!</p>\n<p>For information about our soy free eggs or any of our other organic egg products, contact us today.</p>\n"}