{"title":"Reducing Our Environmental Footprint Through Egg Production","slug":"reducing-our-environmental-footprint-through-egg-production","excerpt":"<p>Global Warming is a hot topic in today’s world. It’s super important to preserve our environment not just for us, but for future generations. At Chino Valley Ranchers, we decided to go green a long time ago. All of our delicious eggs are produced organically and in environmentally-friendly ways.</p>\n","keywords":["carbon footprint","Chino Valley Ranchers","Chino Valley Ranchers' organic omega-3 eggs","Chino Valley Ranchers’ Humane Harvest eggs","environmental footprint","freshest eggs","organic egg producers","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/11/egg-inspection.png","image":{"src":"/images/egg-inspection.png","alt":""},"date":"2018-09-28T19:53:40","author":"Chino Valley Ranchers","content":"<p>Global Warming is a hot topic in today’s world. It’s super important to preserve our environment not just for us, but for future generations. At Chino Valley Ranchers, we decided to go green a long time ago. All of our delicious eggs are produced organically and in environmentally-friendly ways.<!--more--></p>\n<p>Recently, the <a href=\"https://www.aeb.org/farmers-and-marketers/reducing-our-environmental-footprint\">American Egg Board (AEB) released research</a> that shows egg production has significantly decreased its environmental footprint between 1960 and 2010. Thanks to modern technology, the egg industry’s environmental footprint in 2010 was 63 percent lower than it was in 1960, something that we at Chino Valley Ranchers have done and are working on improving every day.</p>\n<p>More eggs than ever before were produced in 2010, yet only a small number of hens were required. Had the same number of eggs been produced in the 1960s, 78 million more hens, 1.3 additional acres of corn and 1.8 million extra acres of soybeans would have been required.</p>\n<p>The world is also facing a water crisis, and according to the AEB, the production of eggs now requires 32 percent less water than it did in 1960. Today, our Chino Valley Ranchers’ farmers are also able to feed 72 percent more people than egg farmers could in 1960.</p>\n<p>As an added bonus, today’s hens are living longer, better lives due to new technology and regulations. The hens have more ideal living conditions, better nutrition and overall better health.</p>\n<p>Our mission statement at Chino Valley Ranchers is to produce the freshest and highest quality eggs at the best price, treat all our hens with kindness and respect through personalized care and put back into the earth what we take out of it. We work every day to decrease our environmental footprint, produce delicious, organic eggs, and make sure our hens are living their best lives. To find a Chino Valley Ranchers distributor near you, visit our <a href=\"http://www.chinovalleyranchers.com/store-locator/\">store locator</a>.</p>\n"}