{"title":"Sustainable Composting Practices from a Cage Free Egg Producer","slug":"sustainable-composting-practices-from-a-cage-free-egg-producer","excerpt":"<p>Chino Valley Ranchers is a small, family-owned farm recognized as one of the best cage free egg producers around. We pride ourselves on our organic, cage-free eggs, the health of our laying hens, and the way we care for the environment. One of the steps we have taken to lessen our carbon footprint is to&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/07/rsz_dollarphotoclub_84273337.jpg","image":{"src":"/images/rsz_dollarphotoclub_84273337.jpg","alt":""},"date":"2015-09-25T14:22:19","author":"Chino Valley Ranchers","content":"<p>Chino Valley Ranchers is a small, family-owned farm recognized as one of the best cage free egg producers around. We pride ourselves on our organic, cage-free eggs, the health of our laying hens, and the way we care for the environment. One of the steps we have taken to lessen our carbon footprint is to make compost. How do we do that?</p>\n<ol>\n<li>We take all the manure from our chickens. Gross, right? It’s kind of smelly, but it has to go somewhere.</li>\n<li>Next, we mix it with green waste from our farms. This includes grass clippings, plant trimmings, fruit or veggie peels, or anything that will naturally decompose on its own.</li>\n<li>After it’s all mixed up, we take it to local farmers so that they can use it to fertilize their land.</li>\n</ol>\n<p>It’s really easy to compost on your own. Basically, instead of throwing green waste into the trash can, you throw it into the composting bin. Some people keep these in their kitchens, some in their garages, and some outside (so long as no critters can get in and make a mess of things).</p>\n<p>Maybe you’re asking yourself, “Why would I compost if I can just buy fertilizer?” There are many good reasons for composting.</p>\n<ul>\n<li>It’s good for the earth. Instead of taking up space at a landfill, green waste in your compost bin stays in your compost bin and then eventually ends up in your garden.</li>\n<li>Composting saves money, both directly and indirectly. Not only do you not have to buy fertilizer, but less waste in our landfills means less resources needed to sort through it. Can you imagine if every home in America had a composting bin? Our landfills would be less full and our trash bills would be lower.</li>\n<li>It’s self-sustaining. When you give your friends and family fresh produce from your garden, you can tell them that the fertilizer was composted right in your home, so you know exactly what went into it. No chemicals, pesticides, or other harmful ingredients. It’s kind of like our mantra about how we feed our chickens: put good in, get good out. Healthy chickens lay healthy eggs and healthy soil produces healthy produce.</li>\n</ul>\n<p>Chino Valley Ranchers, a committed cage free egg producer, has been composting for many years, so if you have any questions about the process or how you can start your own composting bin, contact us today!</p>\n"}