{"title":"The Benefits of Flax in Soy-Free Omega-3 Eggs","slug":"the-benefits-of-flax-in-soy-free-omega-3-eggs","excerpt":"<p>When our customers requested a soy-free organic egg, we began hatching a plan to feed our soy-free hens the best diet possible. With the help of our nutritionist, we scrambled up a blend of organic grains and seeds to replace the nutritional content of the soy. In addition, we added organic flaxseed to boost the&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_eggs.jpg","image":{"src":"/images/rsz_eggs.jpg","alt":""},"date":"2015-07-27T16:38:24","author":"Chino Valley Ranchers","content":"<p>When our customers requested a soy-free organic egg, we began <em>hatching</em> a plan to feed our soy-free hens the best diet possible. With the help of our nutritionist, we <em>scrambled</em> up a blend of organic grains and seeds to replace the nutritional content of the soy. In addition, we added organic flaxseed to boost the omega-3 fatty acid content in the eggs. Why is flaxseed such an excellent supplement in the diet of hens? Below are some reasons why.<!--more--></p>\n<p><strong>Healthy Fat:</strong> Alpha-linolenic acid (ALA) is the main element of flax. All of the omega-3 fatty acids contribute to overall health in infants and adults, but ALA leads the pack. In addition, once ingested by humans, ALA splits into two other omega-3 fatty acids: eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA). Thus, eating just one omega-3 enriched egg raises the levels of three omega-3 fatty acids in the body.</p>\n<p><strong>Healthy Heart:</strong> Research has shown that the consumption of omega-3 fatty acids from eggs reduces blood pressure and serum triglycerides in humans. Furthermore, researchers found that omega-3’s decrease platelet activity in the blood. A build up of platelets can contribute to plaque build up in the arteries, which leads to coronary artery disease.</p>\n<p><strong>Healthy Population:</strong> Currently, the average American does not consume enough omega-3 fatty acids. In fact, the presence of omega-3’s is at a historically low rate compared to the presence of omega-6’s (studies show that these omegas should be consumed at a ratio of 1:1). Keeping the ratio of these in balance helps the body convert ALA to DHA and EPA. In addition, a diet rich in omega-3’s can lead to healthy eyes and decreased risk of dementia.</p>\n<p>At Chino Valley Ranchers, we take the health of our hens and our customers very seriously. That’s why we only feed our egg-laying hens an organic diet that is free of antibiotics, steroids, and hormones. Contact us today for more information about our soy free, omega-3 enriched eggs.</p>\n<p>&nbsp;</p>\n"}