{"title":"The History of the Easter Egg","slug":"the-history-of-the-easter-egg","excerpt":"<p>This Sunday, dying eggs, getting a basket of candy from the Easter Bunny and searching for eggs at an Easter egg hunt are some of the activities that will be celebrated in the spirit of Easter. But, why are eggs and bunnies so prominent in the celebration of Easter? This week, Chino Valley Ranchers dives&#8230;</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","Easter","eggs","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/03/Untitled-design-2.png","image":{"src":"/images/Untitled-design-2.png","alt":""},"date":"2018-03-30T21:01:18","author":"Chino Valley Ranchers","content":"<p>This Sunday, dying eggs, getting a basket of candy from the Easter Bunny and searching for eggs at an Easter egg hunt are some of the activities that will be celebrated in the spirit of Easter. But, why are eggs and bunnies so prominent in the celebration of Easter? This week, Chino Valley Ranchers dives in to find out!<!--more--></p>\n<p><strong>Osterhase, The Easter Bunny</strong></p>\n<p>Back in the 1700s, German immigrants in America would wait for <a href=\"https://www.history.com/topics/holidays/easter-symbols\">Osterhase</a>, the German Easter Bunny who could lay eggs, to visit their home on Easter morning. Every Easter Eve, Children would make nests for Osterhase in hopes of waking up to the beautifully-decorated eggs the next morning. As time went on, this German custom spread across America, eventually becoming a popular Easter tradition.</p>\n<p><strong>Easter Eggs in Today’s Society</strong></p>\n<p>As a Christian holiday that usually occurs towards the beginning of spring, Easter tradition involves dying eggs as part of its tradition. However, this tradition of painting hard-boiled eggs during springtime pre-dates Christianity. In many cultures around the world, the egg is a symbol of new life, fertility, and rebirth.</p>\n<p>Nowadays, Easter egg hunts, egg rolling and egg decorating are just some of the popular Easter-related traditions. Eggs are rolled as a symbolic re-enactment of the rolling away of the stone from Christ’s tomb. Even the White House puts on an <a href=\"https://www.whitehouse.gov/eastereggroll/\">Easter Egg Roll</a> event on the South Lawn every Monday after Easter.</p>\n<p>As for egg hunts, they didn&#8217;t become popular until the <a href=\"https://www.history.com/topics/holidays/easter-symbols\">20th century</a>. During this time, the nests turned into baskets and eggs were hidden in gardens for children to find. This treasure hunt &#8211; or Easter egg hunt as we know it &#8211; has turned into a family favorite.</p>\n<p>Whether you’re helping your kids during an Easter egg hunt or decorating eggs to display, Chino Valley Ranchers wants to celebrate this Easter with you. Visit our <a href=\"http://www.chinovalleyranchers.com/store-locator/\">store locator</a> to check out where you can purchase our products. Happy Easter!</p>\n"}