{"title":"The Great Poultry Heist of 2015","slug":"the-great-poultry-heist-of-2015","excerpt":"<p>It may sound like a joke, but when 200 hens go missing from a Northern California farm just before Easter, it is serious business. What’s even worse: the stolen hens were a specific variety of hen called Easter Eggers that lay multicolored eggs. These pastel-colored eggs are very popular around Easter, which results in over&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_chicken.jpg","image":{"src":"/images/rsz_chicken.jpg","alt":""},"date":"2015-04-16T14:38:22","author":"Chino Valley Ranchers","content":"<p>It may sound like a joke, but when 200 hens go missing from a Northern California farm just before Easter, it is serious business. What’s even worse: the stolen hens were a specific variety of hen called Easter Eggers that lay multicolored eggs. These pastel-colored eggs are very popular around Easter, which results in over $22,000 in losses.<!--more--></p>\n<p>The farmer cares less about the financial loss, but more about the health and safety of the hens, who he has raised since they were chicks. He is offering a reward for anyone with information leading to the recovery of his precious hens.</p>\n<p>What do you know about the hens laying your eggs? Check out these top three most popular hens for egg laying.</p>\n<p><strong>• Black Sexlink Chicks:</strong> Black Sexlink hens are a cross between Barred Rock hens and a Rhode Island Red chicken. They turn out about 250 large brown eggs per year. These are one of the most popular types of hens for brown egg laying because of their gentle nature, but they are not as efficient as some of the other breeds.</p>\n<p><strong>• Red Sexlink Chicks:</strong> Where the Black Sexlink hens fall short is where the Red Sexlink hens are strong. They may not have the same gentle manner of the Black Sexlink, but they are efficient in their food intake and they produce higher-quality, higher-quantity eggs. They are also good in all weather environments.</p>\n<p><strong>• White Leghorn Chicks:</strong> White Leghorns have the best heritage when it comes to egg laying. They are a single comb, clean-legged chicken that originates from Italy. They are not recommended for colder areas and can be a little flighty, but are a non-broody breed.</p>\n<p>If you have any questions about the breeds of hens we use in our egg manufacturing, call Chino Valley Ranchers today! Additionally, if you know any information about 200 stolen hens, contact us for the farm’s information.</p>\n"}