{"title":"Treat Your Valentine to Heart-Shaped Eggs","slug":"treat-your-valentine-to-heart-shaped-eggs","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/02/2768022494_d36dc91f52_b.jpg","image":{"src":"/images/2768022494_d36dc91f52_b.jpg","alt":""},"date":"2018-02-08T22:55:12","author":"Chino Valley Ranchers","content":"<p>The old saying still rings true: the way to someone’s heart is through their stomach. That’s why this Valentine’s Day, Chino Valley Ranchers is sharing with you a delicious heart-shaped fried egg recipe! The best part is, you don’t have to be a skilled chef to whip up this special meal. Plus, it’s healthy and won’t take you much time at all! That means less time in the kitchen and more time spent with your loved one. <!--more-->Put a smile on your Valentine’s face with our recipe below.</p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers eggs</li>\n<li>1 clean, empty cardboard juice carton</li>\n<li>2 rubber bands</li>\n<li>1 pen or set of chopsticks</li>\n</ul>\n<p>Bring a pot of water to a boil and place your Chino Valley Ranchers eggs in the pot. Boil for about 10 minutes. Once it’s finished boiling, dunk your eggs into an ice bath to stop them from cooking.</p>\n<p>While the eggs are cooling, take a clean and empty juice carton and cut off the top and the base. This will leave you with a cuboid shape. Then, choose one of the four corners and measure about one to two inches out. At that one- to two-inch mark, cut that corner out of the cuboid shape. You should be left with a long ‘v’ cut-out, which will be used to create the ‘v’ part of the heart on the egg. Discard the rest of the carton.</p>\n<p>Then, peel your egg and sit it length-wise on the cut-out juice carton. Place a pen or a chopstick on top of the egg and hold it in place with one rubber band on each side of the egg. Let this sit for ten minutes as it molds into the heart shape. Then, remove the bands and take the egg out. Chop the egg in half and you now have two heart-shaped eggs! Serve this with a salad, some toast or simply by itself on a nice plate.</p>\n<p>And just like that, you have a simple and delicious Valentine’s Day treat to give your loved ones! Be sure to use Chino Valley Ranchers eggs for high-quality, nutritious eggs that taste great. To learn more about our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us today</a>!</p>\n"}