{"title":"Try This Tasty Eggs Benedict Casserole","slug":"try-this-tasty-eggs-benedict-casserole","excerpt":"<p>Eggs Benedict is a delicious American breakfast and brunch dish that brings together some of breakfast’s favorite foods: eggs, English muffin and ham, topped with Hollandaise sauce. While there are many variations on the classic, today we at Chino Valley Ranchers have a recipe for an Eggs Benedict casserole that you will love!</p>\n","keywords":["best eggs","Best Organic Eggs","cage-free eggs","cage-free organic eggs","Chino Valley Ranchers","egg recipe","eggs","organic egg producers","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/01/IMG_9276.jpg","image":{"src":"/images/IMG_9276.jpg","alt":""},"date":"2017-02-28T18:05:51","author":"Chino Valley Ranchers","content":"<p>Eggs Benedict is a delicious American breakfast and brunch dish that brings together some of breakfast’s favorite foods: eggs, English muffin and ham, topped with Hollandaise sauce. While there are many variations on the classic, today we at Chino Valley Ranchers have a recipe for an Eggs Benedict casserole that you will love!<!--more--></p>\n<p><u>What You’ll Need: </u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Chopped ham</li>\n<li>English muffins</li>\n<li>Milk</li>\n<li>Pinch of salts</li>\n<li>Dried mustard</li>\n<li>Paprika</li>\n<li>Ground pepper</li>\n<li>Hot sauce</li>\n<li>Lemon juice</li>\n<li>Salted butter</li>\n</ul>\n<p><strong>1. Prepare your pans. </strong></p>\n<p>Grease a baking pan with butter and place a portion of the ham at the bottom of the dish. Then, add enough English muffins to cover the ham and place the rest of the ham over the muffins.</p>\n<p><strong>2. Whisk together and pour your casserole.</strong><br />\nIn a separate bowl, whisk together Chino Valley Ranchers’ eggs with milk, dry mustard, paprika and pepper. Add a pinch of salt for some extra flavor. Then, pour the mixture over the English muffins and ham in the baking pan.</p>\n<p><strong>3. Bake the benedict.</strong><br />\nIn a preheated oven set at 350°F, bake the casserole until a tester fork comes out clean. This usually takes approximately an hour, depending on the size of the pan.</p>\n<p><strong>4. Make the Hollandaise sauce. </strong><br />\nWhile the casserole is cooking, use a blender to mix Chino Valley Ranchers’ egg yolks, dry mustard, hot sauce and lemon juice. While the blender is still running, slowly pour butter. Blend until thickened, which usually takes less than ten seconds. If the sauce is too thick, you can thin it by adding a tablespoon of hot water.</p>\n<p><strong>5. Serve to perfection. </strong><br />\nDrizzle the Hollandaise sauce over the casserole and sprinkle with a touch of paprika, if desired.</p>\n<p>And there you have it! An Eggs Benedict in a casserole form, easy to make and share with those you love. At Chino Valley Ranchers, we want our customers to have the freshest ingredients for the best recipes. Contact us today to learn about more about our products!</p>\n"}