{"title":"Try Our Baked Egg &#038; Portobello Mushrooms!","slug":"try-our-baked-egg-portobello-mushrooms","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/02/Baked-Eggs-in-Portobello-Mushrooms-Blog-785x520.jpg","image":{"src":"/images/Baked-Eggs-in-Portobello-Mushrooms-Blog-785x520.jpg","alt":""},"date":"2018-02-23T23:23:40","author":"Chino Valley Ranchers","content":"<p>This week, Chino Valley Ranchers brings you a simple yet tasty breakfast meal: baked eggs and Portobello mushrooms. If you&#8217;re always rushing in the morning, you&#8217;ll be glad to learn this recipe requires just a few ingredients and little prep time. Just pop it in the oven and go! Beyond the heart-healthy fatty acids, jam-packed minerals and high protein count, this low-sugar breakfast will kick-start your day on a healthy note.<!--more--></p>\n<p>Ready to get cooking? Keep reading for this tasty Paleo-friendly breakfast.</p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers eggs</li>\n<li>Portobello mushrooms</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Garlic powder</li>\n<li>Fresh thyme</li>\n<li>Chopped chives</li>\n</ul>\n<p>Begin by preheating your broiler to high. While your oven preheats, start removing the stems from your Portobello mushrooms. Carefully scrape out the gills with a spoon so as to not break the edges of the mushrooms. You’ll want to make enough room for the egg to fit comfortably in without overflowing.</p>\n<p>Next, place your mushrooms on a foil-lined baking sheet. Brush around each mushroom with olive oil and season with salt, pepper and garlic powder. Broil the mushrooms for a few minutes on each side, or until they are slightly tender. Remove them from the oven and let them stand until they’re cool enough to handle. Then, using a paper towel, pat each mushroom dry to rid them of excess liquid.</p>\n<p>Get your oven ready by preheating it to 400° F. Crack a Chino Valley Rancher’s egg into each mushroom cap. Try your best to crack the yolk in first, then let the egg whites spill in to fill up the rest of the mushroom. Sprinkle with thyme.</p>\n<p>Place your Portobello mushroom eggs into the oven and bake for 15 to 20 minutes. The cooking time will depend on the size of your mushrooms and eggs. Once the time is up, remove your mushroom eggs from the oven and let them sit for a bit, just to make sure that the egg whites have had enough time to set. Garnish with chives and enjoy!</p>\n<p>There you have it &#8211; A Chino Valley Ranchers breakfast favorite! If you enjoyed this recipe, be sure to check out our other recipes <a href=\"http://www.chinovalleyranchers.com/category/recipes/\">here</a>. For more information on our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us today</a>!</p>\n"}