{"title":"Try This Deviled Egg Recipe for Easter","slug":"try-this-deviled-egg-recipe-for-easter","excerpt":"<p>The Easter Bunny isn’t the only one who can bring eggs this Easter. Here’s a fun recipe from your friends at Chino Valley Ranchers that will be a great spring treat and a surprise to whichever celebration you bring them to. With just a little food coloring – and Chino Valley Ranchers’ eggs, of course!&#8230;</p>\n","keywords":["Best Organic Eggs","egg recipe","eggs","organic egg producers"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/04/home-cooking-1670403_960_720.jpg","image":{"src":"/images/home-cooking-1670403_960_720.jpg","alt":""},"date":"2017-04-13T22:21:15","author":"Chino Valley Ranchers","content":"<p>The Easter Bunny isn’t the only one who can bring eggs this Easter. Here’s a fun recipe from your friends at Chino Valley Ranchers that will be a great spring treat and a surprise to whichever celebration you bring them to. With just a little food coloring – and Chino Valley Ranchers’ eggs, of course! – you can amaze your friends with a festive dish that everyone can enjoy.<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Creamy salad dressing</li>\n<li>Hot sauce</li>\n<li>Dry mustard</li>\n<li>Red, green and blue food coloring</li>\n<li>Water</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<p><strong>1. Hard-boil the eggs.<br />\n</strong>Place your Chino Valley Ranchers’ eggs into a large saucepan, cover them with cold water and bring the water to a boil. Allow the eggs to boil for three minutes. Turn off the heat, cover the pot and allow the eggs to continue to cook in hot water for at least twenty minutes. Then, drain the eggs and cover them in cold water. When they are completely cooled, peel the eggs.</p>\n<p><strong>2. Prepare the yolks.</strong></p>\n<p>Cut the hard-boiled eggs in half, length-wise. Remove the yolks and place them in a bowl with some creamy salad dressing, salt, pepper, hot sauce and dry mustard until the mixture is smooth.</p>\n<p><strong>3. Add some color.</strong></p>\n<p>Add a few drops of food coloring into separate bowls, filled with one cup of water. Place the egg halves in each bowl, allowing the eggs to tint to pastel pink, green and blue. If the color is not vibrant enough, add a drop or two more of coloring into the bowl and dye the egg again. When the egg is the proper color, drain the egg whites on a paper towel.</p>\n<p><strong>4. Devil the eggs.</strong></p>\n<p>Using piping or a spoon, fill the egg yolk mixture into the colored egg white halves. Cover and chill them for at least a half hour before serving and enjoying them.</p>\n<p>There you have it! A simple and quick treat for the holiday! For more recipes, visit Chino Valley Ranchers’ YouTube channel. We have quick and easy egg recipes for you and your family to try. To learn more about our egg products, contact Chino Valley Ranchers today!</p>\n"}