{"title":"Try Our Turkey Kale Frittata Recipe","slug":"try-our-turkey-kale-frittata-recipe","excerpt":"<p>If you’re looking for a great Sunday brunch recipe for the family, look no further. Our healthy turkey kale frittata recipe will give you a jumpstart to your morning! To complement your favorite Chino Valley Ranchers’ eggs, this frittata is packed with protein, fiber, and antioxidants. It’s delicious, easy to make and will keep you&#8230;</p>\n","keywords":["best eggs","Best Organic Eggs","cage-free eggs","cage-free organic eggs","Chino Valley Ranchers","Chino Valley Ranchers' organic omega-3 eggs","egg recipe","eggs","free range eggs","freshest eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/11/whisk-eggs.jpg","image":{"src":"/images/whisk-eggs.jpg","alt":""},"date":"2017-06-01T21:34:53","author":"Chino Valley Ranchers","content":"<p>If you’re looking for a great Sunday brunch recipe for the family, look no further. Our healthy turkey kale frittata recipe will give you a jumpstart to your morning! To complement your favorite Chino Valley Ranchers’ eggs, this frittata is packed with protein, fiber, and antioxidants. It’s delicious, easy to make and will keep you full for hours!<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Olive oil</li>\n<li>Diced sweet potato</li>\n<li>Crumbled turkey sausage</li>\n<li>Thinly sliced red potatoes</li>\n<li>Chopped kale</li>\n<li>Cherry tomatoes, halved</li>\n<li>Crushed garlic</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt &amp; pepper</li>\n<li>Chopped oregano</li>\n</ul>\n<p><strong>1. Brown the sausage.</strong></p>\n<p>Preheat your oven to 375°F. In a large, oven-safe skillet, heat the olive oil over medium-high temperature. Add the crumbled turkey sausage and cook it until it’s brown, making sure to stir occasionally. Transfer your sausage onto a plate and set it aside.</p>\n<p><strong>2. Prepare the filling.</strong></p>\n<p>In the same skillet, add more olive oil and reduce the temperature to medium heat. Place your thinly sliced red potatoes in the skillet and cook, covered, until they are tender but firm. This should take about 10 minutes. Add the chopped kale, cherry tomatoes, and crushed garlic, and continue cooking until the kale is wilted.</p>\n<p><strong>3. Swirl and set the frittata.</strong></p>\n<p>Whisk together your Chino Valley Ranchers’ eggs with salt, pepper, and chopped oregano. Keeping the skillet on medium heat, add your egg mixture and turkey sausage and swirl to distribute. Transfer your skillet to the oven and bake it until it’s set, which usually takes about 15 minutes.</p>\n<p>Once it’s done, remove your frittata from the oven and let it cool for a few minutes. Cut it into four generous wedges and serve right away.</p>\n<p>We hope you enjoy this healthy scramble! Be sure to check out other Chino Valley Ranchers’ recipes on our <a href=\"http://www.chinovalleyranchers.com/category/recipes/\">website</a>. If you have questions about our products, please contact us today!</p>\n"}