{"title":"Try This California Egg and Cheese Wrap","slug":"try-this-california-egg-and-cheese-wrap","excerpt":"<p>If you’re looking for a delicious and healthy breakfast, look no further than this tasty California egg and cheese wrap. Add a little flavor to your morning routine with this simple five-minute recipe from Chino Valley Ranchers. It’s a great meal any time of year. Take a look!</p>\n","keywords":["best eggs","Best Organic Eggs","brown eggs","cage-free eggs","cage-free organic eggs","Chino Valley Ranchers","Chino Valley Ranchers' organic omega-3 eggs","egg recipe","eggs","free range eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/01/IMG_6241.jpg","image":{"src":"/images/IMG_6241.jpg","alt":""},"date":"2017-01-11T15:37:36","author":"Chino Valley Ranchers","content":"<p>If you’re looking for a delicious and healthy breakfast, look no further than this tasty California egg and cheese wrap. Add a little flavor to your morning routine with this simple five-minute recipe from Chino Valley Ranchers. It’s a great meal any time of year. Take a look!<!--more--></p>\n<p>What You’ll Need:<br />\n&#8211; Chino Valley Ranchers’ eggs<br />\n&#8211; Whole wheat tortillas<br />\n&#8211; Your choice of cheese<br />\n&#8211; Avocado<br />\n&#8211; Pico de gallo (tomato, onion and cilantro chopped and mixed)</p>\n<p>Optional Ingredients:<br />\n&#8211; Baby spinach<br />\n&#8211; Chopped fresh dill leaves<br />\n&#8211; Sour cream</p>\n<p>1. Prepare the toppings.<br />\nCut your avocado into slices (two thin slices are recommended for each wrap). Chop any veggies you want to add and prepare your pico de gallo by chopping up tomato, onion and cilantro. You can pre-mix your pico de gallo in a medium bowl or add the individual ingredients separately at the end.</p>\n<p>2. Cook the eggs.<br />\nOne egg per wrap will suffice, so cook and scramble the eggs in a nonstick skillet on medium heat for 2-3 minutes. Be sure to stir frequently.</p>\n<p>3. Prepare the tortillas.<br />\nPlace each tortilla on a microwave-safe plate. If you want your cheese melted, place the cheese on top of the tortilla and microwave for 15-30 seconds (or until it is melted to your liking). If you prefer to add the cheese later, place a damp paper towel over the plain tortilla and microwave it for 30 seconds.</p>\n<p>4. Make your wraps.<br />\nPlace the cooked egg(s) on the warmed tortilla(s) and top it off with sliced avocado and pico de gallo. Feel free to add fresh spinach, cheese, dill leaves and/or sour cream if you like. Leave room around the edges of the tortilla so you can then wrap it up like a burrito.</p>\n<p>And there you have it! Delicious California egg and cheese wraps that are easy to make and something that everyone in the family will enjoy. When you pick your eggs, you’ll want to have eggs that are of the best quality, and we at Chino Valley Ranchers are known for our fresh and healthy eggs. To learn where you can buy Chino Valley Ranchers eggs near you, contact us today!</p>\n"}