{"title":"Turn Up the Heat with These Egg-Stuffed Bell Peppers!","slug":"turn-up-the-heat-with-these-egg-stuffed-bell-peppers","excerpt":"<p>Although summer is drawing to a close, we at Chino Valley Ranchers have the perfect egg recipe to end the season with a bang! Whether it’s a light snack after a long day of work or a delicious appetizer at an end-of-summer party, our stuffed bell peppers are healthy, packed with protein and quick to&#8230;</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","Chino Valley Ranchers eggs","egg recipes","Organic","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/08/blog_thumbnail-1.png","image":{"src":"/images/blog_thumbnail-1.png","alt":""},"date":"2018-08-30T22:16:37","author":"Chino Valley Ranchers","content":"<p>Although summer is drawing to a close, we at Chino Valley Ranchers have the perfect egg recipe to end the season with a bang! Whether it’s a light snack after a long day of work or a delicious appetizer at an end-of-summer party, our stuffed bell peppers are healthy, packed with protein and quick to prepare. Try them for yourself by following the recipe below:<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Olive oil</li>\n<li>Onion, chopped</li>\n<li>Eggplant, chopped</li>\n<li>Garlic, minced</li>\n<li>Paprika</li>\n<li>Dried oregano</li>\n<li>Tomato paste</li>\n<li>Tomatoes, chopped</li>\n<li>Cooked quinoa</li>\n<li>Fresh parsley, chopped</li>\n<li>Red bell peppers, cut in half</li>\n<li>Fat- free feta cheese</li>\n</ul>\n<p><u>Optional Ingredients </u></p>\n<ul>\n<li>Pepper</li>\n<li>Salt</li>\n</ul>\n<p><u>Instructions</u></p>\n<p>Start by pre-heating your oven to 400°F.</p>\n<p>Coat a skillet with olive oil and place it on the stove over medium-high heat. Cook the onion, eggplant, garlic, oregano and paprika for about five minutes or until the eggplant starts to soften. Add some tomato paste and chopped tomatoes, thoroughly mixing until the eggplant and tomatoes are tender. Remove the skillet from the heat and stir in the cooked quinoa, some chopped parsley and add salt and pepper to your liking.</p>\n<p>Cut the peppers in half and place them on a greased baking pan. Spoon the healthy mixture evenly into each pepper half. Cover with foil and bake for 15-20 minutes or until the peppers are tender and crisp. Take the peppers out of the oven and carefully crack a Chino Valley Ranchers egg into each half. Sprinkle each half with feta cheese and return back to the oven, baking uncovered until the egg whites have cooked to your liking. Sprinkle the dish with more parsley, serve and enjoy!</p>\n<p>When you use Chino Valley Ranchers’ eggs to prepare this savory dish, it’s sure to be a hit! Check out more of our delicious Chino Valley Ranchers recipes on our <a href=\"http://www.chinovalleyranchers.com/news/\">blog</a> and visit our <a href=\"http://www.chinovalleyranchers.com/store-locator/\">store locator</a> to find a Chino Valley Ranchers distributor near you!</p>\n"}