{
  "title": "Viral Ad Featuring Chicken Love Ballad Brings a Second MUSE Creative Award Home to Chino Valley",
  "slug": "viral-ad-featuring-chicken-love-ballad-brings-a-second-muse-creative-award-home-to-chino-valley",
  "image": {
    "src": "/images/CVR_Blog-Post-Image-AprilMuse-Award_v2.jpg"
  },
  "date": "2023-04-06T00:00:00Z",
  "author": "Chino Valley Ranchers",
  "content": "<p>The results are in for the 2023 MUSE Creative Awards, Season 1, and once again, Chino Valley Ranchers has won the Platinum for our fresh approach to advertising.&nbsp;<br></p><p>The MUSE Awards are a series of competitions hosted by the International Awards Associate (IAA), an organization that continuously strives to honor creatives and designers for excellence. For its first competitive season in 2023, the competition received over 6,300 entries. Leading industry professionals from around the globe serve as the competition’s jury, upholding IAA’s uncompromising standards of merit and impartiality.</p><p></p><p>Thomas Brandt, spokesperson of IAA, said, “It is humbling to see the level of craft displayed in the submitted works. Our most sincere commendations go out to those behind said works and for setting such a high standard for excellence for all to follow.”<br></p><p>The winning ad, titled <em>Chicken Scratch</em>, is presented in a music-video format and features a lovelorn rancher jilted by his favorite chicken who has flown the coop for Chino Valley. A string of puns delivered in convincing country heartbreak style culminate in the tagline, “The Grass Is Greener at Chino Valley.” (<a href=\"\" title=\"\">View the ad here.</a>)</p><p></p><p>The song was written and performed by Nathan Kenyon at Anthem Entertainment/BMI, with supplemental lyrics composed by Alex Ribble, founder of Big Chief Creative Media — the agency behind the ad. Additional credits go to the ad’s Writer/Director&nbsp;Tyler Wolff, Director of Photography Keith Leman, Editor/VFX&nbsp;A.J. Rickert-Epstein, and Music Producer Gabe Foust.&nbsp;</p><p></p><p>Ticking up to a million views on YouTube alone, the catchy ditty has all the makings of a smash hit. Nate Kenyon’s performance is irresistible, and viewers hope the ad will run again just so they can learn the words and sing along.</p><p></p><p><em>Chorus</em></p><p>“Over in Chino Valley,&nbsp;</p><p>Grazin' on greener&nbsp;grass,&nbsp;</p><p>She's free, free ranging,&nbsp;</p><p>Yea she's staying,&nbsp;</p><p>Wild in them pasture lands I see.&nbsp;</p><p>Over in Chino Valley,&nbsp;</p><p>And she ain't coming back to me,&nbsp;</p><p>I guess this good old boy he finally knows,&nbsp;</p><p>Why the chicken crossed the road.”&nbsp;<br></p><p>Lately, we have been stirring up the food industry with a series of comedic internet ads designed to entertain viewers. A previous ad, <em>Special Delivery</em>, features a package delivery driver who wanders into a gender reveal party right at the climax, only to hilariously say the absolute wrong thing at the wrong time. <em>Special Delivery</em> also took home the Platinum in the 2022 MUSE Creative Awards, Season 2. (<a href=\"https://youtu.be/kDgO22nhVEQ\">View the ad here.</a>)<br></p><p>We haven’t run out of original egg ideas yet. More creative ads are in the works for 2023.&nbsp;</p><p></p><p>Family-owned and operated since the 1950s, Chino Valley Ranchers is dedicated to bringing the freshest, healthiest and best-tasting eggs to your table. As an accredited California Certified Organic Farmers (CCOF) organic provider, Chino Valley Ranchers’ hens are fed the finest organic, non-GMO grains and seeds from certified pesticide-free fields. Chino Valley Ranchers eggs are certified by American Humane and carry the American Humane Certified seal.</p>"
}