{"title":"Watch Us Cook Up a Tasty Asparagus and Mushroom Frittata","slug":"watch-us-cook-up-a-tasty-asparagus-and-mushroom-frittata","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/09/Screen-Shot-2016-09-13-at-10.21.39-AM.png","image":{"src":"/images/Screen-Shot-2016-09-13-at-10.21.39-AM.png","alt":""},"date":"2016-09-13T10:30:19","author":"Chino Valley Ranchers","content":"<p>Are you looking for a delicious recipe to serve for breakfast? Well then look no further, because we at Chino Valley Ranchers have a fun and yummy frittata recipe that we know you will love! Read on to learn how to make Chino Valley Ranchers’ asparagus and mushroom frittata. To see this recipe come to life, <a href=\"https://www.youtube.com/watch?v=8bwlPZ8FfBs\">watch our video</a> on how to make this tasty dish.</p>\n<p><u>What You’ll Need</u>:</p>\n<ul>\n<li>Chino Valley Ranchers’ Eggs</li>\n<li>Olive Oil</li>\n<li>Mushrooms</li>\n<li>Asparagus</li>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Monterey Jack cheese</li>\n</ul>\n<p><strong>1. Cook your vegetables. </strong></p>\n<p>Get started by pouring one tablespoon of olive oil into a skillet or pan. Then, cook your mushrooms and asparagus together until they are fully done. For some extra flavor, add salt and pepper along the way. Finally, take the cooked vegetables and pour them into a greased, heatproof bowl.</p>\n<p><strong>2. Scramble your eggs. </strong></p>\n<p>Crack and whisk 12 Chino Valley Ranchers’ eggs. Add salt and pepper to the eggs and then pour them on top of the cooked vegetables in the same heatproof bowl. Finish the dish off with a half-cup of Monterey Jack cheese sprinkled on top.</p>\n<p><strong>3. Get your oven ready.</strong></p>\n<p>Heat your oven to 350° Fahrenheit and cook the dish for 35-40 minutes. Once it’s cooked to your liking, take it out of the oven and let it cool for a few minutes. It will then be ready for your friends and family to eat!</p>\n<p>In just a few simple steps, you can have a delicious frittata ready to go. To make this dish taste its absolute best, be sure to use Chino Valley Ranchers’ eggs. We are dedicated to producing the highest quality of eggs that are healthy and tasty, too!</p>\n<p>For more information on our eggs, contact Chino Valley Ranchers today.</p>\n<p><iframe src=\"https://www.youtube.com/embed/8bwlPZ8FfBs\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n"}