{"title":"What You Won’t Find in an Organic Egg","slug":"what-you-wont-find-in-an-organic-egg","excerpt":"<p>You know that organic eggs are healthier than conventional eggs. But what exactly is the difference between the two types of eggs? We’re glad you asked.</p>\n","keywords":["cage free","Chino Valley Ranchers","eggs","organic egg producer","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2019/04/justine_eats_blog_thumbnail.png","image":{"src":"/images/justine_eats_blog_thumbnail.png","alt":""},"date":"2019-10-14T23:19:48","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">You know that organic eggs are healthier than conventional eggs. But what exactly is the difference between the two types of eggs? We’re glad you asked.</span><!--more--></p>\n<p><b>The Origin of Livestock</b></p>\n<p><span style=\"font-weight: 400;\">The U.S. Department of Agriculture’s organic regulations have specific requirements pertaining to the origin of livestock. Organic eggs may be produced by day old chicks that have been purchased from a conventional hatchery. If poultry is over one day old, they can only be purchased from certified organic sources to qualify for the USDA Organic seal. </span></p>\n<p><b>Livestock Feed</b></p>\n<p><span style=\"font-weight: 400;\">What a chicken is fed will impact the quality of the eggs produced. The USDA requires that certified animals receive 100% organic feed and the pastures must also be certified organic.  </span></p>\n<p><b>A List of “No-no’s”</b></p>\n<p><span style=\"font-weight: 400;\">The USDA prohibits the following from being included in livestock feed:</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Animal drugs, including hormones, to promote growth.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Urea or manure added to feed or in feed formulas.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Direct fed mammalian or poultry by-products such as animal fats and rendered products (does not include fishmeal).</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Feed supplements or additives in amounts over what is needed by the livestock for nutrition and health.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Kitchen and garden scraps that are not certified organic.</span></li>\n</ul>\n<p><b>The Truth About Antibiotics</b></p>\n<p><span style=\"font-weight: 400;\">According to an article by </span><a href=\"https://www.npr.org/sections/thesalt/2017/11/02/561584723/big-chicken-connects-poultry-farming-to-antibiotic-resistant-bacteria\"><span style=\"font-weight: 400;\">NPR</span></a><span style=\"font-weight: 400;\">, “feeding antibiotics to chickens can lead to antibiotic-resistant foodborne infections in humans.” For example, consuming chickens with antibiotic-resistant bacteria can lead to urinary tract infections (UTIs) in women. A UTI that is immune to antibiotics can lead to a kidney infection, a bloodstream infection, infections in other organ systems and even septic shock. With an estimated 10% of UTIs being foodborne, approximately 600,000 to 800,000 cases each year are due to antibiotic-resistant bacteria used by farms. </span></p>\n<p><b>Our Commitment to Organic </b></p>\n<p><span style=\"font-weight: 400;\">For us, the decision to only produce organic products is a no-brainer. We refuse to produce anything less than healthy and nutritious simply because we won’t consume inorganic products ourselves. Organic is in our DNA and we wouldn’t be Chino Valley Ranchers if that ever changed. </span></p>\n"}