{"title":"What’s for Lunch? Creative Organic Egg Recipes","slug":"whats-for-lunch-creative-organic-egg-recipes","excerpt":"<p>Long considered a bregg-fast staple and occasionally thrown into the mix for supper a la “bregg-fast for dinner,” eggs are actually quite versatile when it comes to lunch as well. We’re not talkin’ about your run-of-the-mill hard-boiled egg, either. Don’t get us wrong—there’s a lot that’s right about our tried-and-true hard-boiled friend: he’s easy to&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_dollarphotoclub_72560963.jpg","image":{"src":"/images/rsz_dollarphotoclub_72560963.jpg","alt":""},"date":"2015-05-26T14:38:34","author":"Chino Valley Ranchers","content":"<p>Long considered a <em>bregg-fast</em> staple and occasionally thrown into the mix for supper <em>a la</em> “<em>bregg-fast</em> for dinner,” eggs are actually quite versatile when it comes to lunch as well. We’re not talkin’ about your run-of-the-mill hard-boiled egg, either. Don’t get us wrong—there’s a lot that’s right about our tried-and-true hard-boiled friend: he’s easy to pack, healthy, and full of protein. But if you’re in the market for something a bit more <em>egg-citing</em> than a hard-boiled egg, we’ve got some <em>egg-cellent</em> organic egg recipes for you!<!--more--></p>\n<ul>\n<li><strong>Fabulous Fried</strong>: This one’s super easy. Fry up an egg so that the white is completely done but the yolk is still runny. Place it over a rice or grain bowl (including vegetables makes it extra healthy), cover, and head to work. When lunchtime rolls around, reheat for two minutes or until the egg is warm but the yolk is not set. Yummy!</li>\n</ul>\n<ul>\n<li><strong>Simply Soft-Boiled</strong>: Making a soft-boiled egg is not as difficult as it sounds. Bring water to a boil and gently drop your egg into the pan (or eggs, if you want to make enough for the week). Allow the egg to gently boil for 6 minutes, and then dip it into an ice bath to halt the cooking process. When lunchtime comes, use the office K-cup machine to fill a coffee mug with hot water. Place the egg in the hot water for 2 minutes, peel, and place over a favorite salad or rice bowl.</li>\n</ul>\n<ul>\n<li><strong>Perfectly Pickled</strong>: Ever heard of a pickled egg? It’s definitely <em>different</em>, but in a good way. To make them, hard boil eggs as normal. Once they are completely cooled off, the pickling can begin! Submerge the eggs in pickling liquid (we recommend starting <a href=\"http://www.bonappetit.com/recipe/pickled-egg-salad-crostini-with-serrano-ham\">here</a> to get the measurements right), cover, and let them baste in the fridge for 2-3 days. Pickled eggs can be used in a simple egg salad, chopped and placed as a garnish or another salad, or all by themselves.</li>\n</ul>\n<ul>\n<li><strong>Fancy Frittata’d</strong>: We all know that frittatas serve as a delicious, all-in-one meal. Veggies, potatoes, bacon, cheese, and eggs: what could make a better meal? To make the week go smoother, make the frittata over the weekend. When Monday rolls around, slice off a piece and layer it on a thick piece of bread with mixed greens, fresh veggies, and condiments.</li>\n</ul>\n<p>At Chino Valley Ranchers, we know that our customers are always on the hunt for delicious organic egg recipes. Because we think eggs are so great, we want you to have recipe options for breakfast, lunch, and dinner (or snacktime)! If you have any questions about our eggs or would like more organic egg recipes, give us a call. We’re happy to help in any way we can.</p>\n"}