{"title":"What is Salmonella and How to Prevent it","slug":"what-is-salmonella-and-how-to-prevent-it","imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/03/rsz_eggs.jpg","image":{"src":"/images/rsz_eggs.jpg","alt":""},"date":"2015-03-06T11:18:21","author":"Chino Valley Ranchers","content":"<p>It is no yolk: fresh eggs contain the potential to carry foodborne illnesses. But before chickening out, do not fret. Eating eggs is still perfectly healthy! Just take extra caution with how they are handled. Even if the egg is clean, the very small possibility still exists that the egg contains a specific bacteria called Salmonella.<!--more--></p>\n<p><strong>What is Salmonella?</strong></p>\n<p>Despite the name, Salmonella and salmon have nothing in common! In fact, the name comes from the scientist who discovered it, Daniel Salmon. A known illness for over 100 years, affected people endure some terrible symptoms: fever, abdominal cramps, vomiting, and diarrhea, to name just a few. If the bacteria grow too severe and spread to the blood stream, it can even lead to hospitalization. Pregnant women, children, elderly people, and anyone with a weakened immune system tend to be more susceptible to these severe side effects.</p>\n<p><strong>How can it be prevented?</strong></p>\n<p>This leads to the important question: How can Salmonella be prevented? Take care to follow some of these steps before consuming any egg.</p>\n<p>• Retail right. Make sure to buy eggs from the refrigerated section of the grocery store, and put them directly into the fridge for proper storage when returning home. Bacteria grow between 40 and 140 degrees Fahrenheit, so keep the eggs away from that danger zone.<br />\n• Keep it clean. Eggs, hands, all surfaces and utensils that touch the egg—they all need cleaning. Without proper disinfecting, the bacteria multiplies and causes harm when cross-contamination comes into play.<br />\n• Serve safe. As stated before, store the eggs below 40 degrees Fahrenheit and cook them above 140 degrees Fahrenheit before serving. Even when serving your eggs in a cold dish like deviled eggs, ensure that the egg has been cooked to at least 140 degrees before chilling them back down to 40.</p>\n<p>At Chino Valley Ranchers, we take Salmonella seriously. Our eggs move directly from the chicken to a refrigerated area. From there, we transfer them only in refrigerated trucks. We do our part, so help us keep the eggs safe after they leave our control! That way the eggs and the egg recipes stay eggs-iting!</p>\n"}