{"title":"Where Eggs Come From: Interesting Facts About Hens","slug":"where-eggs-come-from-interesting-facts-about-hens","excerpt":"<p>In order to find a delicious egg, it’s important to know where it comes from. It’s a well-known fact that eggs can come from chickens, specifically hens. But we at Chino Valley Ranchers have found that there are some interesting facts about hens pertaining to their eggs that not many people know about. We are&#8230;</p>\n","keywords":[],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2015/04/rsz_chicken.jpg","image":{"src":"/images/rsz_chicken.jpg","alt":""},"date":"2016-04-27T11:58:08","author":"Chino Valley Ranchers","content":"<p>In order to find a delicious egg, it’s important to know where it comes from. It’s a well-known fact that eggs can come from chickens, specifically hens. But we at Chino Valley Ranchers have found that there are some interesting facts about hens pertaining to their eggs that not many people know about. We are happy to share those facts with you today!<!--more--></p>\n<p><strong>1. Chickens are omnivores. </strong></p>\n<p>Ever wonder what chickens eat? Their typical diet includes seeds, bugs and grain. They also might snack on lizards or mice every once in awhile.</p>\n<p><strong>2. It takes a lot of feed to make an egg. </strong></p>\n<p>In order to produce a dozen eggs, a hen has to eat about four pounds of feed.</p>\n<p><strong>3. Lighting can affect the strength of the egg. </strong></p>\n<p>Hens go by light to determine when it’s time to lay an egg. It typically takes about 25 hours to lay a normal egg. But, if you can manipulate the lighting to make the hen think a day is 28 hours instead of 24, they will lay bigger and stronger eggs.</p>\n<p><strong>4. There are lots of different chicken breeds. </strong></p>\n<p>According to the American Poultry Association, there are about 65 different breeds of chickens that are recognized. However, the Leghorn chicken is one of the most common breeds known for raising edible eggs.</p>\n<p><strong>5. Chickens can fly. </strong></p>\n<p>Well, kind of. Chickens actually can’t fly long distances like other birds, but they can fly long enough to fly over a fence or other similar barriers. In fact, that’s where the phrase “fly the coop” comes from!</p>\n<p><strong>6. There are about 280 million active producing hens in the United States. </strong></p>\n<p>We’ve done the math: if there are 280 million active hens, that means that they produce around 50 billion eggs every year!</p>\n<p>The key to a healthy egg is a healthy hen. We at Chino Valley Ranchers are known for taking care of our hens and providing a great environment for them. For more information on our hens or eggs, contact us today!</p>\n"}