{"title":"Why Olivia (Olive.Eeeats) Switched to Soy-Free, Cage-Free, Organic Eggs","slug":"why-olivia-olive-eeeats-switched-to-soy-free-cage-free-organic-eggs","excerpt":"<p>I’ve always eaten eggs. It’s that simple. When my brother and I were kids we would wake up every Sunday morning to the smell of my dad scrambling eggs for us downstairs. It’s a form of nostalgia for me to eat eggs in the morning.</p>\n","keywords":["cage-free eggs","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2018/08/Screen-Shot-2018-08-08-at-3.12.45-PM.png","image":{"src":"/images/Screen-Shot-2018-08-08-at-3.12.45-PM.png","alt":""},"date":"2018-08-08T22:24:06","author":"Chino Valley Ranchers","content":"<p>I’ve always eaten eggs. It’s that simple. When my brother and I were kids we would wake up every Sunday morning to the smell of my dad scrambling eggs for us downstairs. It’s a form of nostalgia for me to eat eggs in the morning.<!--more--></p>\n<p>I’ve gone through my vegan and vegetarian phases, and while I have really loved many aspects of these lifestyles, I’m always brought back to a diet that includes meat and eggs. Before starting olive.eeeats, I was buying eggs from the grocery store that were CHEAP. I couldn’t fathom how one company could sell a dozen eggs for 1.49, whereas other companies were selling a dozen for $7! I was obviously NOT going to buy them. So, I didn’t.</p>\n<p>I continued to eat “regular” eggs up until about 2 years ago when I learned about the absolutely inhumane ways that hens and chickens are treated when producing eggs for us to eat. A few months ago, I saw about 1k hens in the back of a truck on a freeway and almost lost my mind. I’ve always loved animals, and while I do eat them, it’s important for me to make sure that what I am eating comes from ethical means.</p>\n<p>So, when Chino Valley Ranchers asked me to partner with them, I had to do my research. What I found was overwhelming (in a good way). They’re a family business that has been making eggs since the 1950’s, and have been moving along with the trends ever since. In summary, they worked tirelessly to take better care of their hens and have always had a “cage-free” approach to making eggs. Furthermore, they went *orgggaaanic* in the FREAKIN 90’s! That means that the eggs you’re eating are: laid by cage-free, free-roaming hens that are raised on certified organic feed and have access to the outdoors, hens are given only feed that’s grown WITHOUT synthetic pesticides, fungicides, herbicides or fertilizers, AND 100% of the feed’s agricultural ingredients must be certified ORGANIC. Antibiotics and growth hormones?? NOT HERE!</p>\n<p>THE BEST PART: Most companies have a difficult time creating a product that is organic + soy free. There&#8217;s a large number of people in our world suffering from soy allergies currently, and because most eggs include remnants of soybeans (due to their nutritional value), these people will eliminate eggs from their diet. Chino Valley has actually found a way to make specialty eggs (in this case, soy free) while STILL feeding their hens an organic diet. So, if you&#8217;ve got a soy allergy &#8211; you can STILL eat these eggs that have just as much nutritional value than your regular organic egg.</p>\n<p>Not to mention, the way they package their eggs is unbelievably sustainable &#8212; ALL RECYCLABLE MATERIALS!</p>\n<p>I am going to link you to their website at the bottom of this page so that you can check out more information/details regarding their eggs and why they’re so DANG good for ya. I’ve started buying Chino Valley Rancher’s eggs at my local grocery store because now every time I crack an egg and eat it, I feel GOOD. Even though I&#8217;m spending the few extra bucks. For me, it’s simple. We are what we eat. We are only as healthy as the animals we consume. If I am going to eat an egg, it better be from a hen that had a ZEN LIFE before laying it.</p>\n<p>This post originally appeared on <a href=\"https://www.oliveeeeats.com/blog/\">Olivia&#8217;s blog</a>.</p>\n"}