{"title":"Why Soy Free Eggs?","slug":"why-soy-free-eggs","excerpt":"<p>Over the last 50 years, soy has become a staple of the American diet. Over that time, more and more people, especially children, are experiencing allergic reactions to soy based foods of every variety, from soy milk to meats produced with soy based feed. This can come as quite a revelation to some, as they&#8230;</p>\n","keywords":["Chino Valley Ranchers","omega-3 fatty acids","soy free eggs","Why Soy Free Eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2016/12/15027978_1347216411964303_7537167603606404656_n-1.png","image":{"src":"/images/15027978_1347216411964303_7537167603606404656_n-1.png","alt":""},"date":"2015-01-03T22:45:36","author":"Chino Valley Ranchers","content":"<p>Over the last 50 years, soy has become a staple of the American diet. Over that time, more and more people, especially children, are experiencing allergic reactions to soy based foods of every variety, from soy milk to meats produced with soy based feed. This can come as quite a revelation to some, as they might believe their allergic reaction has to do with the food itself, be it eggs, meats or milk, rather than the soy itself. As a result, and many are looking to reduce or eliminate soy protein from their diet.</p>\n<p>Consumers come to us with concerns about a number of issues, especially dealing with their special diet needs. After many requests from consumers for a soy free egg, we researched how this could be done considering soy provides a significant part of the chicken’s diet. <!--more--> The challenge then became the fact that there are not many certified organic products that could supplement the nutritional values present in soybeans. Working with our nutritionist for some time and searching for approved organic ingredients the chickens enjoyed eating, we finally figured it out. By including a mix of organic grains and seeds including organic sunflowers, we were able to provide the nutrients needed for the optimal health and livability of the hen.</p>\n<p>The eggs were then sent in to see if in fact they were free of soy or the proteins found within it.</p>\n<p>The tests proved to show an absence of all soy protein inside of the egg! We are excited to share with you this innovative new egg that will allow all people who have not been able to eat eggs because of soy allergies to do so. You can expect the same brilliant colored yolks, great taste and superior quality that you find in the rest of our organic eggs. We have also added whole flaxseed to the diet for high levels of Omega-3 fatty acids reaching levels of around 225mg and more.</p>\n<p>There is also up to five times the amount of Vitamin E found in regular eggs, which serves asa vital part of the body’s antioxidant system. Whether you have soy allergies or just would like to try soy free product, these eggs are the perfect fit for your diet.</p>\n<p>For more information about soy free eggs, please visit our sister website at  <a title=\"Soy Free Egg\" href=\"http://www.soyfreeegg.com\">http://www.soyfreeegg.com.</a></p>\n"}