{"title":"You’ll Love Our Poached Egg Cauliflower Grits","slug":"youll-love-our-poached-egg-cauliflower-grits","excerpt":"<p>Add some Southern-inspiration to your morning with this week’s healthy breakfast recipe! Your friends at Chino Valley Ranchers have whipped up a nutritious cauliflower grits recipe to kick-start your day. Made with all natural, Chino Valley Ranchers’ eggs, this dish is packed with fiber, vitamins, and minerals, which will surely make your taste buds dance!</p>\n","keywords":["cage-free eggs","Chino Valley Ranchers","egg recipes","eggs","organic eggs","recipes"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/11/grits-with-poached-eggs-greens-and-bacon.jpg","image":{"src":"/images/grits-with-poached-eggs-greens-and-bacon.jpg","alt":""},"date":"2017-11-09T20:00:55","author":"Chino Valley Ranchers","content":"<p>Add some Southern-inspiration to your morning with this week’s healthy breakfast recipe! Your friends at Chino Valley Ranchers have whipped up a nutritious cauliflower grits recipe to kick-start your day. Made with all natural, Chino Valley Ranchers’ eggs, this dish is packed with fiber, vitamins, and minerals, which will surely make your taste buds dance!<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Cauliflower stems removed</li>\n<li>Onion, chopped</li>\n<li>Olive oil</li>\n<li>Garlic, minced</li>\n<li>Low-sodium vegetable broth</li>\n<li>Cheddar cheese, shredded</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<p><strong>1. Prepare your grits.</strong></p>\n<p>In a food processor, pulse your cauliflower until you have a rice-like consistency. If you don’t have a food processor, don’t fret! You can manually chop up your cauliflower, or purchase pre-riced cauliflower from the store. Once you have your cauliflower grits, set them aside.</p>\n<p>Heat the olive oil in a skillet over medium heat. Add the onion and cook it until it’s soft and slightly browned. To the same skillet, add the cauliflower rice, a sprinkle of salt and pepper and enough veggie broth to coat the top of the cauliflower. Cover and cook for about eight to ten minutes, stirring occasionally.</p>\n<p><strong>2. Poach your eggs.</strong></p>\n<p>While your grits are cooking, bring a separate pot of water to a simmer and crack a few Chino Valley Ranchers eggs into the water to begin your poaching process. Unsure how to perfectly poach an egg? Read our step-step-guide <a href=\"http://www.chinovalleyranchers.com/egg-cellent-ways-to-cook-your-eggs-series-poached-eggs/\">here</a>.</p>\n<p><strong>3. Assemble your grits.</strong></p>\n<p>As you check on your grits, make sure that the liquid is fully absorbed by the cauliflower – that’s when you know that it’s ready! Turn the heat off and continue stirring your grits, making sure to mash a few pieces for a smoother consistency. Then, mix in some cheddar cheese.</p>\n<p>Scoop your grits into a few plates (or bowls!) and top each serving with a poached egg. If you like some heat, add a touch of cayenne pepper!</p>\n<p>And there you have it! A Southern-inspired meal perfect for anyone following a gluten-free or vegetarian diet. If you enjoyed this recipe, be sure to check out our other recipes on our website. For more information on our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us today</a>!</p>\n"}