{"title":"You’ll Love This Simple Egg Salad Sandwich Recipe","slug":"youll-love-this-simple-egg-salad-sandwich-recipe","excerpt":"<p>Nothing can hit the spot more than a homemade egg salad sandwich &#8211; it’s tasty and has the protein you need on the go. Here’s a simple egg salad sandwich recipe created in our Chino Valley Ranchers’ kitchen that we know you’ll love!</p>\n","keywords":["Best Organic Eggs","cage-free eggs","cage-free organic eggs","Chino Valley Ranchers","Chino Valley Ranchers' organic omega-3 eggs","egg recipe","freshest eggs","organic egg producers","organic eggs"],"imageLocationOld":"https://www.chinovalleyranchers.com/wp-content/uploads/2017/04/caroline-attwood-243824.jpg","image":{"src":"/images/caroline-attwood-243824.jpg","alt":""},"date":"2017-04-26T21:10:54","author":"Chino Valley Ranchers","content":"<p>Nothing can hit the spot more than a homemade egg salad sandwich &#8211; it’s tasty and has the protein you need on the go. Here’s a simple egg salad sandwich recipe created in our Chino Valley Ranchers’ kitchen that we know you’ll love!<!--more--></p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Mayonnaise</li>\n<li>Fresh lemon juice</li>\n<li>Yellow mustard</li>\n<li>Salt &amp; pepper</li>\n<li>Finely chopped celery</li>\n<li>Thinly sliced green onions</li>\n<li>Wheat bread</li>\n<li>Lettuce leaves</li>\n</ul>\n<p><strong>1. Hard-boil your eggs.<br />\n</strong>Place your eggs in a large enough pot to create a single layer and prevent stacking. Add cold water to cover the eggs entirely with about an inch of water over them. Turn the temperature on high and bring the water to a boil. Once the water has boiled, remove the pot from the burner and cover the top. Allow the eggs to stand in the hot water for about 10 to 12 minutes. Transfer the eggs to a bowl of ice water to cool them down completely. This will also make them easier to peel.</p>\n<p><strong> 2. </strong><strong>Chop the eggs.<br />\n</strong>Once the eggs are cooled and peeled, chop them up into small piece and place them into a bowl. The chopped size depends on your preference, but the finer pieces will absorb more flavor.</p>\n<p><strong> 3. </strong><strong>Mix the egg salad.<br />\n</strong>In a separate bowl, add a dollop of mayonnaise, a squirt of lemon juice, and a small squeeze of mustard. Mix the ingredients together until you have a creamy consistency. Add some salt and pepper for some extra flavor. In the same bowl, add the chopped eggs, a handful of celery and some green onions and cover the bowl. Refrigerate your salad for at least two hours to allow the flavors to set.</p>\n<p><strong>4. Plate and taste.</strong></p>\n<p>Once you’re ready for a tasty meal, take your salad out of the refrigerator and place a few spoonfuls onto a slice of wheat bread. Top with a few lettuce leaves and enjoy!</p>\n<p>There you have it! A simple egg salad sandwich for you and your family to enjoy. For more recipes, check out Chino Valley Ranchers’ YouTube channel. Want to find out more about where you get Chino Valley Ranchers’ eggs near you? Contact us today!</p>\n"}