{"title":"4 Things You Didn’t Know About Eggs","slug":"4-things-you-didnt-know-about-eggs","date":"2016-04-06T09:42:59","author":"Chino Valley Ranchers","content":"<p>At Chino Valley Ranchers, we know everything there is to know about eggs. Whether it’s a request for a delicious egg recipe or a question about egg nutrition, we’re more than likely to have the answers you’re looking for. We also understand that to the average egg consumer, there are a lot of interesting facts about eggs that aren’t very well known. That’s why we’re happy to share with you four things you probably didn’t know about eggs. Read on!<!--more--></p>\n<h4><strong>1. Hens can lay a lot of eggs. </strong></h4>\n<p>While you might not think about it when you buy your eggs at the grocery store, hens have the ability to produce a lot of eggs every year. In fact, the average hen will lay 250 to 270 eggs per year!</p>\n<h4><strong>2. Eggs contain almost all of the essential vitamins.</strong></h4>\n<p>It’s a pretty well known fact that eggs are a great source of protein, as 100 percent of an egg’s protein actually gets absorbed and used by the body. But did you know that eggs are a great source for lots of vitamins as well? Eggs contain all of the essential vitamins, except for Vitamin C. In fact, you can receive 10 percent of your daily Vitamin D intake by simply eating eggs.</p>\n<h4><strong>3. Eggs can assist in brain development. </strong></h4>\n<p>There is scientific evidence that shows that eggs – specifically egg yolks – can help with fetal brain development when a pregnant woman consumes an egg. This is because egg yolks are a great source of the B-vitamin choline, which has been proven to enhance neurological functions and reduce inflammation.</p>\n<h4><strong>4. Eggs can make you happier. </strong></h4>\n<p>Well, sort of. Besides their yummy taste making you feel great, scientific research has shown that the choline in eggs can also make you happier. The choline gets broken down into bethane, which can produce “happiness” hormones such as serotonin and dopamine.</p>\n<p>It’s important to know what you’re putting in your body and the impact it can have on your health. We at Chino Valley Ranchers understand this, which is why we wanted to share these fun egg facts with you. To learn more about our fresh and healthy eggs, contact us today!</p>\n"}