{"title":"Celebrate National Deviled-Egg Day with a Grandma Nichols Recipe!","slug":"celebrate-national-deviled-egg-day-with-a-grandma-nichols-recipe","date":"2017-11-02T16:43:03","author":"Chino Valley Ranchers","content":"<p>November 2nd is National Deviled Egg Day, and while deviled eggs are usually the talk of the town come Easter time, they&#8217;re also a go-to appetizer for the upcoming holidays. But, how did deviled eggs get their name in the first place?<!--more--></p>\n<p>Though the history of National Deviled Egg Day has a few cracks in it, it’s been noted that the practice of “<a href=\"http://www.history.com/news/hungry-history/the-ancient-history-of-deviled-eggs\">stuffing eggs</a>” dates back to the 13th century. By the 18th century, the name “Deviled Egg” was coined to describe food that was very spicy, likely to compare the heat of the food with the devil.</p>\n<p>To celebrate National Deviled Egg Day, Chino Valley Ranchers is sharing a special deviled egg recipe made by our very own Grandma Nichols! Unlike some deviled eggs, Grandma Nichols’ recipe has a special ingredient – relish! Now you can enjoy a classic deviled egg recipe with a nice, added kick.</p>\n<p><img class=\"aligncenter  wp-image-2148\" src=\"http://www.chinovalleyranchers.com/wp-content/uploads/2017/11/Grandpa-and-Grandma-Nichols.jpg\" alt=\"Grandpa and Grandma Nichols\" width=\"265\" height=\"353\" srcset=\"https://www.chinovalleyranchers.com/wp-content/uploads/2017/11/Grandpa-and-Grandma-Nichols.jpg 1862w, https://www.chinovalleyranchers.com/wp-content/uploads/2017/11/Grandpa-and-Grandma-Nichols-768x1024.jpg 768w\" sizes=\"(max-width: 265px) 100vw, 265px\" /></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>6 Chino Valley Ranchers’ eggs</li>\n<li>¼ cup mayonnaise</li>\n<li>1 teaspoon mustard</li>\n<li>1 tablespoon relish</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n<li>Paprika<strong> </strong></li>\n</ul>\n<p><strong>1. Bring your eggs to boil.</strong></p>\n<p>To get started, bring a pot of water to a rolling boil and gently add your Chino Valley Ranchers eggs in with a slotted spoon. We’ve found that a perfectly boiled egg takes 12 minutes to boil. There is no need to bring your eggs to room temperature; you can start cooking them straight from the fridge. The water should naturally reduce to a simmer, due to the addition of cold eggs, but make sure to maintain the simmer for about 12 minutes.</p>\n<p><strong>2. Prepare your filling.</strong></p>\n<p>Once the 12 minutes are up, remove the eggs from the hot water and allow them to cool in a bowl of ice water. Peel your eggs cut them in half (length-wise) and scoop the yolks into a medium bowl. Add the mayonnaise, mustard and relish and mash away! Then, sprinkle in some salt and pepper to bring out the flavors.</p>\n<p><strong>3. Assemble your deviled eggs.</strong></p>\n<p>Using a spoon or a piping bag, fill your empty egg whites evenly with the yolk mixture. Try adding paprika for a nice but deviled garnish. Enjoy right away or cover and store in the refrigerator for your evening get-together!</p>\n<p>There you have it &#8211; a celebratory deviled egg recipe by our very own Grandma Nichols! Make your deviled eggs stand out by using organic, grass-fed Chino Valley Ranchers eggs. You’ll surely please any guests when they arrive!</p>\n<p>For more information about our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact</a> Chino Valley Ranchers today.</p>\n"}