{"title":"Celebrate Father’s Day with Homemade Eggs Benedict","slug":"celebrate-fathers-day-with-homemade-eggs-benedict","date":"2017-06-15T00:01:46","author":"Chino Valley Ranchers","content":"<p>Father’s Day is this weekend, and your friends at Chino Valley Ranchers have prepared a delicious eggs benedict recipe just for dad! A velvety, rich hollandaise sauce should be combined with none other than your favorite Chino Valley Ranchers’ eggs. Did we mention that it’s heart-healthy? <!--more-->That’s right – we made sure to lighten the load with a lemony white sauce and bump up the fiber with spinach and whole wheat muffins. Now that’s what we call a ben-ediction!</p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Freshly squeezed lemon juice</li>\n<li>Butter</li>\n<li>All-purpose flour</li>\n<li>Milk</li>\n<li>English muffins</li>\n<li>Sliced tomato</li>\n<li>Fresh baby spinach</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<p><strong>1. Prepare the hollandaise.</strong></p>\n<p>Preheat your oven to 350°F. In a small pot, begin boiling some water. This will be used to poach the eggs later.</p>\n<p>In a saucepan, melt enough butter to coat the bottom of the pan. Add the same amount of flour and cook for one minute, stirring vigorously with a wire whisk. While stirring, gradually add in the milk – about double the amount of flour and butter combined. Allow the sauce to thicken by bringing it to a boil and stirring frequently. Reduce the heat and simmer the sauce for about 5 minutes. Afterward, remove your sauce from the heat and stir in the fresh lemon juice with a pinch of salt and pepper. Set your hollandaise aside and keep warm.</p>\n<p><strong>2. Poach your eggs.</strong></p>\n<p>Break 1 Chino Valley Ranchers egg into a cup and, while holding the cup at the water’s surface, slip the egg into the pot. Continue the process for the remaining amount of eggs. Allow the eggs to cook until the whites are set, which will take about 3 to 5 minutes. Using a slotted spoon, transfer the eggs to a paper-towel-lined plate.</p>\n<p><strong> 3. </strong><strong>Serve your Benedict!</strong></p>\n<p>While your eggs are cooking, toast your English muffin halves in the oven until they are golden brown. Once they are done d removed from the oven, top each muffin half with some baby spinach, a sliced tomato and one poached egg. Drizzle with some hollandaise sauce and enjoy!</p>\n<p>There you have it – a delicious and healthy Father’s Day treat for dad! To learn more about our products, please <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today!</p>\n"}