{"title":"Chino Valley Ranchers — Local Pioneers of Organic Free-Range Eggs Share Their Story","slug":"chino-valley-ranchers-local-pioneers-of-organic-free-range-eggs-share-their-story","date":"2018-12-13T19:51:23","author":"Chino Valley Ranchers","content":"<p>Chino Valley Ranchers&#8217; California Organic: The Natural Choice video shares the story of how they came to be the first local producers of organic and free-range eggs — years before the start of the current USDA program and the movement towards organic products. Chino Valley Ranchers began producing their own eggs in 1959 and by the mid-1990s — after customers started requesting &#8220;organic&#8221; — Chino Valley Ranchers had developed methods to produce organic and free-range eggs. Today, their organic and free-range eggs are sold in Sprouts, Whole Foods, Mother&#8217;s Market and other grocery stores throughout the west coast.<!--more--></p>\n<p>For nearly 30 years, Chino Valley Ranchers has been developing methods to increase the quality of their organic and free-range eggs. Each of its state-of-the-art processing facilities benefits from nutrition research, top-grade grains, precision feed formulation, staff nutritionist, and an organic feed mill.</p>\n<p>Chris Nichols, Vice President of Chino Valley Ranchers, says, he is &#8220;proud to have Southern California&#8217;s only dedicated organic poultry feed mill. Our natural feed formulations are free of hormones, animal proteins, steroids, and antibiotics. We take organic, safe, and free-range eggs to the next level by investing in equipment and technologies that will benefit our hens, chickens, and loyal customers.&#8221;</p>\n<p>Chino Valley Ranchers continues to expand and shares its practices by partnering with small independent farms located throughout the United States. Each farm follows the same, high-quality standards of bird care as the Colton, CA facility.</p>\n<p>The California Organic: The Natural Choice video can be viewed at <a href=\"https://www.chinovalleyranchers.com/the-california-organic-difference/\" target=\"_blank\" rel=\"nofollow noopener\">https://www.chinovalleyranchers.com/the-california-organic-difference/ </a></p>\n"}