{"title":"Egg-cellent Ways to Cook Your Eggs Series: Hard-Boiled Eggs","slug":"egg-cellent-ways-to-cook-your-eggs-series-hard-boiled-eggs","date":"2016-02-16T13:56:35","author":"Chino Valley Ranchers","content":"<p>There are many different ways to cook your eggs. Whether it is fried, scrambled, hard-boiled or poached, we at Chino Valley Ranchers want to provide the best egg experience for our customers. That’s why we’ve compiled a four-part series on different ways to cook your eggs. The first installment of the series is on hard-boiled eggs. Take a look and enjoy!<!--more--></p>\n<p>Hard-boiled eggs are very versatile. Whether you’re cooking them for a hearty breakfast, an afternoon snack or as an addition to a simple dinner salad, a hard-boiled egg works well with many different meals. At the heart of these recipes is a perfectly cooked hard-boiled egg. Chino Valley Ranchers is happy to share our recipe on how to make an egg-cellent hard-boiled egg!</p>\n<p><strong>1.</strong> Place your eggs in a pot and fill it with water until all of the eggs are covered with about an inch of water.</p>\n<p><strong>2.</strong> Place the pot on the stove and let it sit to boil for about 8 to 15 minutes, depending on how soft or hard you like your eggs cooked. Be sure to have a lid covering the pot as well.</p>\n<p><strong>3.</strong> Drain the water from the pot and then run cold water over the eggs. This helps stop the cooking process.</p>\n<p><strong>4.</strong> Once the eggs are cool enough to touch, gently tap the eggs with a spoon or simply tap them against the counter top and carefully remove the shell from the eggs. If you do not remove the shell right away, place the eggs in the refrigerator and they will stay good for about an extra five days. Otherwise, your eggs are ready to be enjoyed!</p>\n<p>After doing these four steps, you will have yourself a perfectly boiled egg. To add some flavor to your creation, add salt, pepper, ketchup or anything else that sounds yummy.</p>\n<p>The most essential part of this recipe is the egg itself, so be sure to purchase your eggs from Chino Valley Ranchers, a trusted and top producer of eggs in California.</p>\n"}