{"title":"Happy Hens Come from California","slug":"happy-hens-come-from-california","date":"2018-12-05T16:00:37","author":"Chino Valley Ranchers","content":"<p>As a third-generation egg farm, we at Chino Valley Ranchers understand that in order to produce quality, certified organic eggs, the well-being of our hens is a top priority. That’s why our chickens are raised in a healthy environment where they are fed all-organic diets and kept cage-free. Because of the great weather that comes with living in Southern California, these chickens get to exercise, roam around and simply be chickens. It’s no wonder that happy hens come from California.</p>\n<p>Continue reading to learn how Chino Valley Ranchers is producing delicious certified organic eggs.<!--more--></p>\n<p><strong>The History of an Organic Chino Valley Ranchers<br />\n</strong>Chino Valley Ranchers was started by Charles Burton Nichols back in the 1950s. Today, the business is managed by his son, Steve, and his wife, Kathy, along with their son, Chris. It has always been a family-owned and -operated business with a focus on quality.</p>\n<p>The concept of going “organic” and producing certified organic eggs at Chino Valley Ranchers started with Steve and Kathy. The two did the research and implemented new strategies that forever changed the business.</p>\n<p>“As far as I know, we’re one of the first people that started organic,” said Steve. “I didn’t know anything about organic and had to go learn. Someone asked me, ‘Can you do organic eggs?’ So, we looked into it, started it, got farmers on board with grains that started developing and then it grew very quickly. People loved it.”</p>\n<p><strong>Truly Free-Range Chickens<br />\n</strong>Another key aspect of raising happier chickens—and thus, producing better eggs—is the free-range concept.</p>\n<p>“For Chino Valley Ranchers, we believe in true free-range,” said Chris Nichols. “That means our hens get to enjoy the outside. They get to enjoy the blue skies. The birds get sunlight. They get fresh air. They get exercise. They get to burn calories. They get to live in a happy and healthy environment.”</p>\n<p>When chickens are raised without cages, you get happier chickens and quality products. This is why Chino Valley Ranchers eggs are so delicious and full of organic nutrients. Our hens are raised in the best conditions possible, so you get the healthiest eggs and egg products possible.</p>\n<p>To learn more about Chino Valley Ranchers’ unique approach to raising hens and producing organic eggs, check out our latest video <a href=\"https://www.chinovalleyranchers.com/the-california-organic-difference/\">here.</a></p>\n"}