{"title":"How Eating Eggs Supports Weight Loss","slug":"how-eating-eggs-supports-weight-loss","date":"2020-01-26T01:36:44","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">Over many decades, weight loss fads have thrown shade at eggs, questioning the health benefits of eggs; they’ve been blasted as cholesterol bombs and cancerous killers. But despite it all, eggs have withstood the test of time and their nutritional benefits are still undisputed.</span><!--more--></p>\n<p><b>Yes, eggs are healthy.</b></p>\n<p><span style=\"font-weight: 400;\">Eggs are low in calories and high in antioxidants, vitamin D, protein and choline. Vitamin D supports healthy bones and immune function, while choline fuels metabolism. To keep your fat intake in check, avoid cooking eggs with oils or butter. </span></p>\n<p><b>Eggs are filling.</b><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">If you’re aiming for weight loss, then you need protein. One large egg has about six grams of protein.</span></p>\n<p><span style=\"font-weight: 400;\">If you lift weights or engage in any kind of physical exercise, then you should consume 0.5-0.8 grams of protein per pound of bodyweight on a daily basis. A 160 pound individual should consume up to 128 grams of protein per day. Eat eggs to reduce cravings and feel full while consuming fewer calories. </span></p>\n<p><b>Eat eggs before or after a workout.</b></p>\n<p><span style=\"font-weight: 400;\">According to the </span><a href=\"https://www.acsm.org/docs/default-source/files-for-resource-library/protein-intake-for-optimal-muscle-maintenance.pdf?sfvrsn=688d8896_2\"><span style=\"font-weight: 400;\">American College of Sports Medicine</span></a><span style=\"font-weight: 400;\">, the benefits of pre-exercise protein supplementation include helping to increase lean muscle mass and strength and reduce fat mass. In addition, “Several studies have demonstrated that protein ingestion following an acute bout of resistance training stimulates muscle protein synthesis for up to three hours. In contrast, failing to eat after exercise</span></p>\n<p><span style=\"font-weight: 400;\">may limit protein synthesis and therefore limit potential progress in lean muscle tissue development.”</span></p>\n<p><b>Eggs supercharge your metabolism.</b></p>\n<p><span style=\"font-weight: 400;\">A 2014 study found that consuming protein can increase an individual&#8217;s metabolic rate by 15-30 percent. This is compared to 5-10 percent for carbohydrates and three percent for fats. </span></p>\n<p><span style=\"font-weight: 400;\">Every fitness expert knows that one key to weight loss is increasing the basal metabolic rate (BMR). Though it is unclear whether it is possible to change one’s metabolic rate, choosing to eat foods that provide nutritional quality rather than “empty” calories is important for aiding weight loss. </span></p>\n"}