{"title":"Kick off Cinco de Mayo with Our Healthy Huevos Rancheros Recipe","slug":"kick-off-cinco-de-mayo-with-our-healthy-huevos-rancheros-recipe","date":"2017-05-03T19:14:35","author":"Chino Valley Ranchers","content":"<p>In 1862, Mexico made history over the defeat of the French army and since then, Cinco de Mayo has become one of the most famous holidays in America! Kick off this celebration with our healthy huevos rancheros recipe, made with the help of your friends at Chino Valley Ranchers.<!--more--></p>\n<p><u>What You’ll Need</u></p>\n<ul>\n<li>Chino Valley Ranchers’ eggs</li>\n<li>Olive oil</li>\n<li>Chopped onion</li>\n<li>Chopped tomato</li>\n<li>Corn tortillas</li>\n<li>Shredded Mexican blend cheese</li>\n<li>Canned black beans, rinsed and drained</li>\n<li>Avocado</li>\n</ul>\n<p><u>Optional Ingredients</u></p>\n<ul>\n<li>Chopped green chilies</li>\n<li>Salt &amp; pepper</li>\n<li>Cumin</li>\n<li>Fresh cilantro</li>\n<li>Lime wedges</li>\n</ul>\n<p><strong>1. Prepare the salsa.<br />\n</strong>Preheat your oven to 250° Using a large skillet over medium heat, cook the chopped onions with the olive oil for about 2 minutes, or until they are soft and translucent. Add the chopped tomato and some green chilies, depending on how spicy you want to make it. Sprinkle with cumin, salt, and pepper for more flavor and continue cooking for another 3 minutes. Set your freshly made salsa aside.</p>\n<p><strong>2. Add some crunch.</strong></p>\n<p>Prepare the tortillas by warming them on a large skillet, one by one, over medium heat. The goal is to get them crispy – about 20 seconds on each side should do. Place your tortillas on a baking sheet and sprinkle each one with cheese and black beans. Bake them for 3 minutes, or just until the cheese melts, then remove from the oven.</p>\n<p><strong>3. Time to get crackin’.</strong></p>\n<p>With the same skillet used to warm the tortillas, add olive oil over medium heat. Crack your Chino Valley Ranchers’ eggs into the pan and cook until sunny-side perfection is reached, or about 4 minutes.</p>\n<p><strong>4. Egg-celente!</strong></p>\n<p>Plate each tortilla and place one fried Chino Valley Ranchers egg in the center. Top with your home-made salsa, chopped avocado, and cilantro. Spritz with lime juice and enjoy!</p>\n<p>We hope you enjoy this healthy treat from south of the border! To make this dish really stand out, be sure to use Chino Valley Ranchers’ eggs! For more information on our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today.</p>\n"}