{"title":"Know (and Care!) from Where Your Food Comes","slug":"know-and-care-from-where-your-food-comes","date":"2016-01-19T09:24:20","author":"Chino Valley Ranchers","content":"<p><em>Should you care from where your food comes? </em>This topic and its sister topics—organic food and GMO’s, amongst others—has been a hot-button issue for quite some time. The short answer is, yes, you should care. At the very least, you should <em>know</em> from where your food originates. That way you can decide whether or not to care.</p>\n<p>SEE ALSO: <a href=\"http://chinovalleyranchers.com/blog/demand-for-organic-and-cage-free-eggs-increases/\">Demand for Organic and Cage Free Eggs Increases</a></p>\n<p>Several questions can be asked about food sourcing, such as how livestock was raised, how wheat or corn were grown, if genetic engineering or modification were involved, and if it’s organic. But the single most important question you can ask about your food is this: <em>Is it local</em>? Local food is fresh food. Local food has an easy-to-follow trail. Oftentimes you can ask the farmer or rancher him (or her!) self how their products were raised.</p>\n<p>Here are our top 3 reasons why you should know from where your food comes.</p>\n<ol>\n<li>Bridge the gap from the farm to the table. Over the past few generations, this gap has grown pretty large. Kids don’t always understand that cheese comes from cows, or that organic eggs come from chickens. Connecting our food to its source offers a healthy relationship with what we eat. Food—and the animals that provide it—should be appreciated and respected. We should know how vegetables are grown, how chickens are raised, or how flour is milled.</li>\n<li>Know what you’re putting into your body—and consequently, the bodies of your family. Take a look at the ingredients list on a packaged food in the pantry. Chances are it’s full of preservatives, trans fats, sodium and sugars. On the contrary, when we make our food from fresh ingredients, we likely are eating large amounts of clean, whole foods.</li>\n<li>Leave a smaller carbon footprint. When we buy our food from local sources, such as organic eggs from Chino Valley Ranchers, it means it isn’t traveling as far to make it to your table. Less travel means less gasoline used for the vehicles that transport the foods, which in turn means less carbon emissions in our environment. According to a study done by the Leopold Center for Sustainable Agriculture at Iowa State University, a local carrot travels roughly 27 miles to get to your table, while a conventionally sourced carrot travels about 1,800 miles! Isn’t that crazy? How old do you think each carrot is by the time it gets to your plate?</li>\n</ol>\n<p>At Chino Valley Ranchers, we understand the value of eating fresh, locally sourced foods. That’s why we make it easy to buy our <a href=\"http://www.chinovalleyranchers.com/organic_living.php\">organic eggs</a> straight from our farm. Give us a call or stop by today to get your locally sourced organic eggs!</p>\n"}