{"title":"Lutein &#038; Zeaxanthin: Here’s How These Antioxidants Can Improve Your Vision","slug":"lutein-zeaxanthin-heres-how-these-antioxidants-can-improve-your-vision","date":"2017-09-27T22:23:56","author":"Chino Valley Ranchers","content":"<p>We all know that maintaining a healthy lifestyle is important for our quality of life – including our eye health. With an aging population among us, there comes a rise in age-related health conditions that affect our eyes, such as cataracts and macular degeneration. Luckily, caring for your vision can be as simple as making sure you eat a well-balanced diet. Research suggests that two antioxidants, lutein, and zeaxanthin, play important roles in our visual health.<!--more--></p>\n<p><strong>What are lutein and zeaxanthin?</strong></p>\n<p>Both lutein and zeaxanthin are antioxidants found in both green, leafy vegetables and – you guessed it – eggs! These antioxidants have long been associated with eye health in reducing the risk of cataracts, which is the leading cause of blindness in people 65 and older.</p>\n<p>Lutein and zeaxanthin accumulate in the eye’s lens and in the macular region of the retina. Scientists believe <a href=\"http://www.eggnutritioncenter.org/blog/lutein-zeaxanthin-and-eye-health/\">high levels</a> of lutein and zeaxanthin in these areas may protect the eye from damage due to oxidation. According to the American Optometric Association, a large egg yolk contains <a href=\"https://www.aoa.org/patients-and-public/caring-for-your-vision/diet-and-nutrition/lutein\">one-fourth</a> the recommended daily intake of lutein and zeaxanthin need for optimal eye health.</p>\n<p><strong>The Importance of a Quality Diet</strong></p>\n<p>To produce the most optimal amounts of lutein and zeaxanthin, hens must be fed quality grains, including yellow corn and alfalfa meal. At Chino Valley Ranchers, our hens are fed diets rich in organic feed. We use only top grade corn, soybean, alfalfa, flax seed and other select seeds, plus limestone meal for essential minerals. All of our organic grains come from non-genetically-modified seeds and are grown in certified organic fields that are free of pesticides. As you would expect, our natural feed formulations never contain hormones, animal proteins, steroids, or antibiotics.</p>\n<p><strong>Absorption in the Body</strong></p>\n<p>As mentioned previously, lutein and zeaxanthin are found abundantly in leafy vegetables, such as spinach, kale, collards, and others. However, research has shown that, due to the egg yolk’s fat content, the yolk’s lutein and zeaxanthin may be <a href=\"http://www.allaboutvision.com/nutrition/lutein.htm\">more easily absorbed</a> by the body than the lutein and zeaxanthin from other sources. So the next time you make a salad to stay healthy, be sure to add a Chino Valley Ranchers egg to it!</p>\n<p>At Chino Valley Ranchers, providing our customers with nutrient-dense egg products is important to us. It’s one of the reasons why we only use organic, quality grains to feed our hens. To learn more about our eggs and where to find them, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact us</a> today!</p>\n"}