{"title":"Organic Egg Recipes: Halloween Deviled Eggs","slug":"organic-egg-recipes-halloween-deviled-eggs","date":"2015-10-23T10:00:00","author":"Chino Valley Ranchers","content":"<p>Feeling <em>egg-citedly</em> festive this week? With Halloween just around the corner, parties are sure to be happening left and right. We rounded up some of the most festive Halloween deviled egg recipes we could find so that our loyal customers could be the hit of the party. From cute to creepy, here are the organic egg recipes.<!--more--></p>\n<p><strong>SEE ALSO:</strong> <a href=\"http://chinovalleyranchers.com/blog/how-to-make-delicious-scrambled-eggs/\">How to Make Delicious Scrambled Eggs</a></p>\n<p>To make a plain ol’ deviled egg, do the following: place 12 <a href=\"http://chinovalleyranchers.com/our_eggs_humane-harvest.php\">humane harvest eggs</a> in a saucepan and cover them with plenty of water (there should be roughly 1.5 inches of water above the eggs). Turn heat to high until the water begins to boil, and then cover, turn heat to low, and cook for one minute longer. Remove pan from the heat and leave covered for 14 more minutes. Rinse eggs under cold water for at least one minute. Next, peel the eggs and slice them lengthwise, removing yolks and dropping them into a medium-sized bowl. Set egg whites aside. Mash egg yolks with a fork or potato masher until they’re crumbly. Add mayo, mustard, salt, and pepper to taste. Using a spoon, evenly distribute the yolk mixture into the egg white. Sprinkle some paprika on top and serve.</p>\n<p><strong>SEE ALSO:</strong> <a href=\"http://chinovalleyranchers.com/blog/7-steps-to-the-perfect-hard-boiled-egg/\">7 Steps to the Perfect Hard-Boiled Egg</a></p>\n<ul>\n<li>Pumpkin deviled eggs: Prepare as indicated above, except add some red food coloring to the yolk mixture (this will turn it an orangish color). Chop some chives into ¼-½ inch pieces. Scoop orange yolk mixture into the egg whites and sprinkle with paprika, then place one piece of chive near the top for the pumpkin stem.</li>\n</ul>\n<ul>\n<li>Spider deviled eggs: Prepare as indicated above. Slice six black olives in half (this will be the spider’s body), and then slice another 5-6 black olives into small slices (these will be the spider’s legs). Scoop yolk mixture into eggs. Place olive half in center. Place 4 olive slices on each side of the half.</li>\n</ul>\n<ul>\n<li>Monster eye deviled eggs: Prepare as indicated above, except add some green food coloring to the yolk mixture. You want it to be a “slime” green color. Using red food coloring, draw squiggly lines on the egg whites (these will look like blood shot eyes). Scoop yolk mixture into eggs and top with a stuffed olive, cut in half.</li>\n</ul>\n<p><strong>SEE ALSO:</strong> <a href=\"http://chinovalleyranchers.com/blog/quick-and-easy-organic-egg-recipes-for-breakfast/\">Quick and Easy Organic Egg Recipes for Breakfast</a></p>\n<p>At Chino Valley Ranchers, we love getting creative and festive with our organic egg recipes. If you have any questions about our humane harvest eggs, please contact us today!</p>\n"}