{"title":"Protein Intake Linked to High-Performance Classroom Behavior","slug":"protein-intake-linked-to-high-performance-classroom-behavior","date":"2018-02-16T19:57:27","author":"Chino Valley Ranchers","content":"<p>According to the <a href=\"https://www.ers.usda.gov/topics/food-nutrition-assistance/food-security-in-the-us/key-statistics-graphics.aspx#children\">USDA</a>, 6.5 million children lived in food-insecure households throughout the United States in 2016. To combat this, many school-targeted interventions have been implemented to provide free or reduced lunches to underserved students. Now, educators are analyzing the types of foods that students consume and how they affect classroom behavior.<!--more--></p>\n<p>In addition to providing lunches, schools oftentimes serve snacks to student populations who are food insecure. While these snacks – such as crackers, granola bars and fruit snacks – are inexpensive and shelf-stable, they are also high on the glycemic index scale. A high <a href=\"https://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/glycemic-index-diet/art-20048478\">glycemic load</a> can exacerbate students’ blood sugar fluctuations and can contribute to challenging behaviors.</p>\n<p>A <a href=\"http://www.aeb.org/in-the-news/american-egg-board/iowa-experiment-correlates-protein-snacks-to-improved-behavior\">group of educators</a> in one Iowan school district hypothesized that protein-based snacks with low sugar content might help improve classroom behavior and thereby increase the students’ potential for academic success. To test this, the group developed the “Protein Intervention” project. During the pilot project, protein-based snacks such as hard-boiled eggs, yogurt and string cheese were substituted for the carbohydrate snacks typically given to students visiting the school nurse. Records were kept of the students’ visit and their snack choice.</p>\n<p>The data showed that the majority of students selected hard-boiled eggs. In addition, only 10 percent of the students received negative behavioral referrals when they consumed a protein-rich snack, and the rest of these students’ behavioral referrals occurred on days when they did not visit the nurse and request protein.</p>\n<p>The verdict? High-protein snacks like eggs contain six grams of high-quality protein and varying levels of vitamins and minerals, which can help sustain hunger and boost focus. In addition, one large egg contains less than one gram of carbohydrate, which does not impact blood glucose.</p>\n<p>At Chino Valley Ranchers, we understand that eggs provide an affordable indulgence and are a convenient way to add protein to any kind of dish. That’s why we are proud to carry humane, organic and quality egg products that are sustainable and promote good health. With Chino Valley Ranchers’ nutrient-dense eggs, you can count on our products to help in your child’s development.</p>\n<p>To learn more about our products, <a href=\"http://www.chinovalleyranchers.com/store-locator/\">contact Chino Valley Ranchers today</a>!</p>\n"}