{"title":"Start Your Morning with Chino Valley Ranchers’ Spinach &#038; Feta Frittata","slug":"start-your-morning-with-chino-valley-ranchers-spinach-feta-frittata","date":"2018-07-06T18:16:55","author":"Chino Valley Ranchers","content":"<p>Here at Chino Valley Ranchers, we love experimenting with different frittata recipes. What are frittatas, you ask? Similar to omelets, frittatas are made from beaten eggs and can include a variety of ingredients. We love them because they’re versatile, quick and easy to make for everyone to enjoy.</p>\n<p>This week, Chino Valley Ranchers brings you a tasty spinach and feta frittata recipe to get everyone’s morning started off right. Try it out for yourself!<!--more--></p>\n<p><u>What You’ll Need:</u></p>\n<ul>\n<li>8-12 Chino Valley Ranchers eggs</li>\n<li>Olive oil</li>\n<li>Scallions, diced</li>\n<li>Spinach</li>\n<li>Feta, drained and crumbled</li>\n<li>Butter</li>\n</ul>\n<p><u>Optional Ingredients:</u></p>\n<ul>\n<li>Salt</li>\n<li>Pepper</li>\n</ul>\n<ol>\n<li><strong>Sauté the veggies.</strong><br />\nBegin by preheating your oven to 350°F. Meanwhile, coat a sauté pan with olive oil and bring it to medium heat. Add the scallions and spinach to the pan and cook until the spinach begins to wilt. The spinach will wilt quickly, so make sure to stir the ingredients frequently. Add a pinch of salt and pepper and then set it aside.</li>\n<li><strong>Combine the ingredients.</strong><br />\nCrack your Chino Valley Ranchers eggs into a medium-sized bowl and whisk until well-combined and fluffy. Using a small amount of butter, grease an oven-safe dish and add in the sautéed scallions and spinach, making sure they’re evenly laid out at the bottom. Then, pour the scrambled eggs over the vegetables. Sprinkle the crumbled feta into the dish, making sure it’s evenly distributed.</li>\n<li><strong>Bake the frittata</strong>.<br />\nAllow the frittata to bake until it has a golden top layer. Depending on the size of your frittata, this might take up to 30 minutes. Test the consistency by inserting a fork or knife into the center; if it comes out clean, then your frittata is ready.</li>\n</ol>\n<p>And there you have it – a delicious and healthy spinach and feta frittata in three easy steps. Ensure you get the best frittata by using Chino Valley Ranchers’ eggs. <a href=\"http://www.chinovalleyranchers.com/store-locator\">Contact us</a> today to learn more about our tasty products and where to find them!</p>\n"}