{"title":"The Origin and History of the Easter Egg Tradition","slug":"the-origin-and-history-of-the-easter-egg-tradition","date":"2020-04-09T17:53:14","author":"Chino Valley Ranchers","content":"<p><span style=\"font-weight: 400;\">Depending on your cultural background or religious beliefs, your Easter celebrations may include decorating Easter eggs, indulging in chocolate bunnies or going on an Easter egg hunt. But do you know how those traditions developed and what they mean? Here’s a brief history of Easter traditions.</p>\n<p></span><b>The Origin of the Word “Easter”</p>\n<p></b>Ancient pagans in Europe observed the Spring Equinox as the return of the sun god. English monk Verable Beded wrote has argued that the word Easter comes from the pagan fertility goddess named “Eostre” in English and Germanic cultures. However, today scholars say there is little evidence of such a goddess outside of Bede’s writings.</p>\n<p>In other languages, the word for Easter derives from the Greek and Latin Pascha or Pasch, for Passover. In Spanish, the word for Easter is Pascua and in French, the word is Pasques.</p>\n<p><b>The Symbolism of the Easter Egg</p>\n<p></b>In many cultures, the egg symbolizes new life, fertility and rebirth. Iranians, for example, decorate eggs on Nowruz — the Iranian New Year that falls on the Spring Equinox.</p>\n<p>In Christianity, especially in Orthodox Christianity and Eastern Catholicism, the Easter egg is symbolic of the resurrection of Jesus Christ. The hard shell represents the sealed tomb in which Jesus was buried and cracking the shell represents Jesus’ resurrection from the dead. Easter egg rolls are a symbol of the rolling away of the stone from Christ’s tomb.</p>\n<p>Historically, church leaders did not allow Christians to eat eggs during the week leading up to Easter. Because of this, eggs laid during the week were decorated to make them Holy Week eggs that were then given as gifts to children. Many Orthodox Christians today abstain from eggs during Lent and enjoy eggs on Easter.</p>\n<p><b>Celebrate Easter with Egg Crafts</p>\n<p></b>Whether Easter holds any religious meaning to you or not, celebrate this Easter by making egg crafts with your kids.</p>\n<p><span>Check out this article for </span><a href=\"https://www.thesprucecrafts.com/easy-easter-egg-crafts-4011879\"><span>9 Easy Easter Egg Crafts for Kids</span></a><span> and have a Happy Easter!</span></p>\n"}