{"title":"The Perfect Potato Crusted Quiche","slug":"the-perfect-potato-crusted-quiche","date":"2017-12-21T22:33:40","author":"Chino Valley Ranchers","content":"<p>I can proudly say that my first attempt at a quiche was a success! I’ve always been intimidated by making crusts, that’s why you’ve yet to see a pie of any sort here (even though I’ve been wanting to make a pot pie). To avoid traditional crust I used thinly sliced Yukon potatoes. After baking the potatoes were crisp to perfection! This quiche is filled with veggies, <a class=\"notranslate\" href=\"https://www.instagram.com/chinovalleyranchers/\">@chinovalleyranchers</a> egg whites, almond cream cheese, and uncured turkey bacon. <!--more--></p>\n<p>Ingredients:</p>\n<ul>\n<li>2 medium Yukon gold potatoes, cut into thin slices</li>\n<li>2 slices uncured turkey bacon, diced into bite-size pieces</li>\n<li>2 cups raw broccoli</li>\n<li>1 cup diced cucumber</li>\n<li>1/2 cup raw yellow onion</li>\n<li>2 cups spinach</li>\n<li>1/4 cup Ripple unsweetened original (or another type of milk)</li>\n<li>2 tablespoons almond cream cheese (or regular cream cheese if not dairy free)</li>\n<li>6 egg whites</li>\n<li>1/4 teaspoon sea salt</li>\n<li>ground pepper to taste</li>\n</ul>\n<p>Instructions:</p>\n<ul>\n<li>Preheat over to 375 degrees F.</li>\n<li>Spray a 9-inch pie pan with nonstick cooking spray. Add thin potato slices all around the base and sides. Spray the potatoes with additional cooking spray and bake for 20 minutes.</li>\n<li>While the potato crust is baking, cook the turkey bacon, and transfer to a separate plate. Sauté the onions, broccoli, and cucumber in the same pan. Once the onions are golden brown, add spinach and cook until wilted. Mix in almond cream cheese, cooked/diced turkey bacon, and combine completely.</li>\n<li>In a medium bowl whisk together egg whites, spices, and Ripple. Add veggie mixture over the potato crust, spreading evenly throughout the pan. Then add egg mixture over the top.</li>\n<li>Bake for 35-40 minutes or until the top becomes golden brown.</li>\n<li>Remove from heat and allow to cool for 10 minutes before cutting into 6-8 slices. Top with hot sauce and enjoy!</li>\n</ul>\n<p><a href=\"https://whatrobineats.wordpress.com/2017/12/21/the-perfect-potato-crusted-quiche/\"><em>Via WhatRobinEats</em></a></p>\n"}