{"title":"Top Chef Season 15 Finalist, Joe Sasto, Features Chino Valley Ranchers’ Organic Eggs in Decadent Pasta Dish","slug":"top-chef-season-15-finalist-joe-sasto-features-chino-valley-ranchers-organic-eggs-in-decadent-pasta-dish","date":"2019-01-21T22:54:39","author":"Chino Valley Ranchers","content":"<p>Chino Valley Ranchers recently had their eggs featured in a ravioli recipe by Top Chef Season 15 Finalist, Joe Sasto (<a href=\"https://www.instagram.com/chef.joe.sasto/\">@chef.joe.sasto</a>).<!--more--></p>\n<p>Chino Valley Ranchers is one of the largest egg producers and distributors in Southern California. For almost 70 years, they have produced high-quality free-range eggs that top chefs love using. To this day, Chino Valley Ranchers is a leading organic egg provider in the U.S.</p>\n<p>“A good egg is what you put into it. We offer specialized diets that lead to specific nutrients and organic options,” said Chris Nichols, co-owner of Chino Valley Ranchers. “By doing so, our hens are able to enjoy healthier lives, which in turn produces better quality eggs.”</p>\n<p>In his <a href=\"https://www.instagram.com/p/BrlhQAUgxUx/\">Instagram post</a>, Chef Joe Sasto uses his creative signature flair to make a picture-perfect hand-rolled ravioli dish. He places a Chino Valley Ranchers’ egg yolk right in the center of rolled out pasta dough to create a perfectly symmetrical ravioli. As a pasta-making connoisseur, Sasto finds joy in creating decadent dishes. “Making your own pasta is way more fun!” Sasto says in response to a comment. “These taste even better than they look.”</p>\n<p>Sasto’s love for cooking dates back to when he was a child spending time with his mother in the kitchen. Since then, he’s been mentored by Italian-influenced chefs across the globe, which ultimately lead to him managing his own handmade pasta program. Today, Sasto drives his passion for cooking as the Executive Chef at the new Los Angeles restaurant, Cal Mare.</p>\n<p>Check out Joe’s beautiful ravioli dish <a href=\"https://www.instagram.com/p/BrlhQAUgxUx/\">here</a>.</p>\n<p>For more information about Chino Valley Ranchers and all of our organic free-range egg products, contact us at <a href=\"https://chinovalleyranchers.com/contact\">(800) 354-4503.</a></p>\n"}