{"title":"What Does the Color of Your Egg Yolk Mean?","slug":"what-does-the-color-of-your-egg-yolk-mean","date":"2019-01-14T21:08:08","author":"Chino Valley Ranchers","content":"<p>Here at Chino Valley Ranchers, we’ve seen a lot of egg yolks. And if you’re like us, then you have probably experienced the varying degrees of yellow yolks in your lifetime. But, why do some egg yolks look more orange or more yellow than others? Many people assume that the color of an egg’s yolk will vastly improve the quality of the taste or the nutritional value of the egg. It turns out that the color really represents the kind of diet being fed to the hen.<!--more--></p>\n<p><strong>Carotenoid Intake<br />\n</strong>Most hens are fed diets that contain natural xanthophylls (a subset of carotenoids). This is what produces a yellow-orange color in the yolks of the eggs they lay. Some feeds will contain more xanthophylls, which will produce darker yellow or gold yolks. Meanwhile, some feeds have less color in the form of xanthophylls and will produce yolks that are much lighter in color.</p>\n<p><strong>What About that Greenish Tint?<br />\n</strong>Another color often associated with egg yolks is a slight greenish ring that often appears when you hard boil an egg. Again, this is typically related to the diet being fed to the hens. The greenish color is a result of the sulfur and iron compounds in the egg reacting at the surface of the yolk while it is being cooked. It is nothing to be alarmed about and it won’t impact the quality or taste of the egg. In many cases, it’s simply a matter of changing the cooking time or temperature. Rapidly cooling hard-boiled eggs can help to minimize the green appearance on the yolks.</p>\n<p><strong>100% Organic<br />\n</strong>Whether your egg yolks are a rich golden hue or slightly yellow in appearance, the color of the yolk shouldn’t be a huge concern. At Chino Valley Ranchers, we feed our chickens only all-natural organic feeds to make sure they lay the healthiest and most nutrient-rich eggs possible. The yolk colors may vary a bit depending on the feeds we use, but you always know you are getting naturally nutritious and delicious eggs with our products.</p>\n<p>To learn more about our all-natural organic feeds or to find a Chino Valley Ranchers distributor near you, <a href=\"https://www.chinovalleyranchers.com/store-locator\">visit our store locator</a>!</p>\n"}