{
    "title": "How to Build an Egg-cellent Adult Lunchbox",
    "slug": "how-to-build-an-egg-cellent-adult-lunchbox",
    "category": "recipe-article",
    "tags": [
        "lunch",
        "dinner"
    ],
    "image": {
        "src": "/images/healthy-lunch-ideas-recipes-meal-prep.jpg",
        "alt": ""
    },
    "button": {
        "text": "Download Recipe Card",
        "src": "#"
    },
    "content": "<p><span style=\"font-weight: 400;\">Whether you’re feeling nostalgic or just want to make lunchtime a little more interesting, an adult lunchbox could give you something to look forward to in your day. Here are a few tips to help you get started.</span><!--more--></p>\n<p><b>1. Pick the right container.</b></p>\n<p>If you want to make sure certain foods stay in their location and maintain the aesthetic appeal of your lunch, then choose a glass storage container with multiple compartments or a bento box. You could also bring a separate container for dips and dressings.</p>\n<p><b>2. Keep it simple. </b></p>\n<p>If cooking is not your pastime, or you just don’t have time to cook a three-course meal for lunch every day, then a simple lunchbox formula is all you need. When building your lunchbox, keep in mind this simple formula: whole grain + lean protein + heart-healthy fats + fruit/vegetables. Be sure to use a wide range of colors to increase the nutritional value of your meal and create a visually appealing lunch.</p>\n<p><b>3. Do some meal prep.</b></p>\n<p>If you don’t like cooking every day, then meal prep is the way to go. Begin by roasting veggies, such as carrots, zucchini, broccoli, bell peppers and eggplant. Next, cook a pot of whole grains, such as quinoa, buckwheat, barley, rice, or whole-grain pasta. Your protein foods can include chicken, tofu, fish, chickpeas, tofu or eggs.</p>\n<p><span style=\"font-weight: 400;\">Chino Valley Ranchers </span><a href=\"https://www.chinovalleyranchers.com/products/veg-a-fed-omega-3/\"><span style=\"font-weight: 400;\">Veg-A-Fed Omega-3</span></a><span style=\"font-weight: 400;\"> eggs are an excellent source of protein and healthy Omega-3 fats. Each egg contains 225 mg of Omega-3, also known as alpha-linolenic acid (ALA), which supports </span><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4350958/\"><span style=\"font-weight: 400;\">cardiovascular and neural health</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">Having all of these foods on hand will make it easy for you to quickly create your lunchbox — and even change up the combination to create an entirely different meal every day.</span></p>\n<p><b>4. Get creative!</b></p>\n<p><span>Consider foods like stuffed sweet potato, taco bowls, burrito bowls, curry, or </span><a href=\"https://www.brit.co/living/healthy-eating/squachos/\"><span>zucchini nachos</span></a><span> (aka squachos). Get out of your cooking comfort zone and experiment with interesting recipes.</span></p>\n<p><b>5. Top it off with something special.</b></p>\n<p>If you’re making a salad or grain bowl, consider adding crushed nuts, dried fruit, exotic cheeses and creative salad dressings. By the time you’re done creating your adult lunchbox, your teenager will be begging you to start making their lunch again!</p>\n"
}